[["farming_292.jpg", {"POS": ["the people farms the wheat from the field using a scythe at a farm.", "the man farms the item from the field using a scythe at a open.", "the people farms the item from the field using a tool at a outdoors."], "NEG": ["the people farms the wheat from the field using a putty at a farm.", "the man farms the item from the field using a flint at a outdoors.", "the people farms the item from the field using a cultural attache at a open."]}], ["spanking_98.jpg", {"POS": ["the begetter spanks the boy with the thenar in the sitting room", "the begetter spanks the yearling with the mitt in the room", "the man spanks the boy with the hand in the living-room"], "NEG": ["the male parent spanks the son with the towage in the sitting room", "the father spanks the bambino with the tramp in the room", "the adult male spanks the boy with the equipage in the living-room"]}], ["tearing_91.jpg", {"POS": ["the individual tears the graph paper with the manus in the place", "the someone tears the page with the manus in the table", "the someone tears the notebook with the paw in the desk"], "NEG": ["the individual tears the graph paper with the eating utensil in the place", "the mortal tears the page with the nose in the table", "the individual tears the notebook with the blade in the desk"]}], ["smashing_238.jpg", {"POS": ["an person smashes the car window with a tool against against at a parking lot", "an somebody smashes the car window with a stone against against at a outdoors", "an grownup smashes the car window with a tool against against at a open air"], "NEG": ["an mortal smashes the car window with a awl against against at a parking lot", "an somebody smashes the car window with a thermometer against against at a out-of-doors", "an grownup smashes the car window with a medical care against against at a outdoors"]}], ["practicing_280.jpg", {"POS": ["an cager practices a hoops using a basketball at basketball court", "an basketball player practices a basketball using a basketball at court", "an man practices a basketball using a basketball at basketball court"], "NEG": ["an cager practices a basketball using a spray paint at basketball court", "an basketball player practices a basketball game using a iced-tea spoon at court", "an man practices a hoops using a player at basketball court"]}], ["watering_148.jpg", {"POS": ["hose is watering grass with nose in field.", "somebody is watering grass with hose in field.", "soul is watering grass with hosepipe in out-of-doors."], "NEG": ["hosepipe is watering grass with paintbrush in field.", "person is watering grass with game in field.", "someone is watering grass with water in open."]}], ["pouring_231.jpg", {"POS": ["an soul pours a atomic number 80 from a beaker to a Petri dish with a paw in a place", "an mortal pours a quicksilver from a beaker to a saucer with a paw in a home", "an someone pours a metal from a glass to a bowl with a tool in a inside"], "NEG": ["an person pours a mercury from a beaker to a Petri dish with a backhoe in a place", "an someone pours a mercury from a beaker to a saucer with a bowl in a family", "an somebody pours a metallic element from a drinking glass to a bowl with a stylus in a inside"]}], ["mining_231.jpg", {"POS": ["an miner mines the rock with a tool at a mine", "an somebody mines the resource with a drill at a cave", "an mortal mines the stone with a bulldozer at a cave"], "NEG": ["an mineworker mines the stone with a spirit level at a mine", "an somebody mines the resource with a mug at a cave", "an person mines the stone with a sheet metal at a cave"]}], ["peeling_17.jpg", {"POS": ["an someone peels an avocado pear with a finger at a table", "an someone peels an avocado pear with a finger at a countertop", "an mortal peels an alligator pear with a hand at a kitchen"], "NEG": ["an soul peels an avocado pear with a ophthalmoscope at a table", "an mortal peels an avocado with a whistling at a countertop", "an soul peels an avocado with a hand at a kitchen"]}], ["dusting_73.jpg", {"POS": ["an man dusts a counter using a towel at a interior", "an man dusts a table using a fabric at a living room", "an man dusts a table using a solution at a living room"], "NEG": ["an man dusts a counter using a pencil at a interior", "an adult male dusts a table using a team at a sitting room", "an adult male dusts a table using a harpoon gun at a parlour"]}], ["pouring_311.jpg", {"POS": ["an adult pours a H2O from a cup to a pan with a mitt in a kitchen", "an person pours a water from a cup to a pot with a mitt in a kitchen stove", "an mortal pours a H2O from a mug to a pot with a mitt in a kitchen"], "NEG": ["an adult pours a water from a cup to a pan with a dolphinfish in a kitchen", "an soul pours a H2O from a cup to a pot with a chiropteran in a kitchen stove", "an soul pours a water from a mug to a pot with a pool in a kitchen"]}], ["eating_8.jpg", {"POS": ["an man eat a sandwich from a plate using a manus at a business office", "an adult male eat a sandwich from a plate using a mitt at a room", "an adult male eat a sandwich from a paper plate using a hand at a desk"], "NEG": ["an adult male eat a sandwich from a plate using a oxyacetylene torch at a business office", "an adult male eat a sandwich from a plate using a open air at a room", "an adult male eat a sandwich from a paper plate using a inflatable cushion at a desk"]}], ["applying_48.jpg", {"POS": ["woman is applying a ointment to a face using paw in a place.", "adult female is applying a ointment to a cheek using hand in a room.", "woman is applying a cream to a face using finger in a place."], "NEG": ["adult female is applying a emollient to a face using scissor hold in a place.", "adult female is applying a ointment to a cheek using Magic Marker in a room.", "woman is applying a cream to a face using roller in a place."]}], ["weeding_165.jpg", {"POS": ["an female weeds with a paw at a open", "an adult female weeds with a garden trowel at a lawn", "an adult female weeds with a glove at a garden"], "NEG": ["an female weeds with a front yard at a out-of-doors", "an woman weeds with a book matches at a lawn", "an adult female weeds with a attention at a garden"]}], ["drawing_194.jpg", {"POS": ["an mortal draws a six-gun using a pencil in a place", "an individual draws a six-gun using a pencil in a place", "an someone draws a gun using a pencil in a place"], "NEG": ["an person draws a revolver using a mallet in a place", "an someone draws a six-gun using a fishing tackle in a place", "an somebody draws a gun using a compressed air in a place"]}], ["curling_181.jpg", {"POS": ["woman curling hair with curling iron in place.", "adult female curling hair with curling iron in place.", "woman curling hair with curling iron in place."], "NEG": ["adult female curling hair with potter's wheel in place.", "adult female curling hair with gravitation in place.", "adult female curling hair with lancet in place."]}], ["flinging_212.jpg", {"POS": ["man flings stone toward police using paw in a open", "boy flings stone toward police using hand in a street", "adult male flings brick toward policeman using manus in a street"], "NEG": ["adult male flings stone toward law using visible radiation in a open", "boy flings rock toward constabulary using desktop in a street", "adult male flings brick toward police officer using straw in a street"]}], ["breaking_228.jpg", {"POS": ["the male child breaks the plank using a fist at a PLACE.", "the male child breaks the item using a hand at a PLACE.", "the boy breaks the item using a mitt at a PLACE."], "NEG": ["the male child breaks the plank using a dolly at a PLACE.", "the male child breaks the item using a dubiety at a PLACE.", "the male child breaks the item using a network at a PLACE."]}], ["cooking_162.jpg", {"POS": ["an female child cooks a vegetable in a pot over a heatsource using a wooden spoon in a place", "an little girl cooks a veggie in a pot over a heatsource using a tool in a place", "an little girl cooks a veg in a pot over a heatsource using a manus in a kitchen"], "NEG": ["an girl cooks a vegetable in a pot over a heatsource using a card in a place", "an female child cooks a veggie in a pot over a heatsource using a spindle in a place", "an female child cooks a vegetable in a pot over a heatsource using a gauze bandage in a kitchen"]}], ["slicing_215.jpg", {"POS": ["the chef slices the sliceditem using a knife at the kitchen.", "the man slices the nutrient using a knife at the kitchen.", "the adult male slices the nutrient using a knife at the counter."], "NEG": ["the chef slices the sliceditem using a electric drill at the kitchen.", "the man slices the food using a strainer vine at the kitchen.", "the adult male slices the nutrient using a pull at the counter."]}], ["uncorking_154.jpg", {"POS": ["the adult male uncorks a wine bottle using a corkscrew in outside.", "the man uncorks a wine bottle using a bottle screw in outside.", "the adult male uncorks a wine bottle using a bottle screw in open."], "NEG": ["the man uncorks a wine bottle using a stairs in outside.", "the man uncorks a wine bottle using a wooden spoon in outside.", "the man uncorks a wine bottle using a showerhead in open air."]}], ["shaving_211.jpg", {"POS": ["an man shaves a coagent's(when different than the man)face using a tool with the help of a froth at a place", "an man shaves a coagent's(when different than the man)face using a brush with the help of a shaving cream at a mirror", "an man shaves a coagent's(when different than the man)face using a brush with the help of a shaving soap at a room"], "NEG": ["an adult male shaves a coagent's(when different than the adult male)face using a file with the help of a froth at a place", "an man shaves a coagent's(when different than the man)face using a test tube with the help of a shaving soap at a mirror", "an adult male shaves a coagent's(when different than the adult male)face using a whisk with the help of a shaving cream at a room"]}], ["lighting_112.jpg", {"POS": ["an mortal lights an cigarette on fire using a book matches at a place", "an match lights an fag on fire using a match at a place", "an somebody lights an cigarette on fire using a matchstick at a place"], "NEG": ["an soul lights an cigarette on fire using a bound at a place", "an match lights an cigaret on fire using a pocket lighter at a place", "an mortal lights an cigaret on fire using a hearth at a place"]}], ["mending_20.jpg", {"POS": ["the adult male mends shoe with manus in outside", "the individual mends insole with tool in open air", "the people mends item with paw in out-of-doors"], "NEG": ["the man mends shoe with caput in exterior", "the person mends innersole with wash in open", "the people mends item with strip in outdoors"]}], ["distributing_132.jpg", {"POS": ["the adult male uses a manus to distribute drygoods to people at a outside.", "the adult male uses a paw to distribute bag to people at a outside.", "the people uses a manus to distribute traveling bag to people at a open air."], "NEG": ["the man uses a puck to distribute soft goods to people at a exterior.", "the adult male uses a file to distribute bag to people at a outside.", "the people uses a tapeline to distribute traveling bag to people at a open air."]}], ["repairing_332.jpg", {"POS": ["the man repairs item’s problem using mitt in place", "the adult male repairs box’s problem using mitt in place", "the man repairs machine’s problem using hand in room"], "NEG": ["the adult male repairs item’s problem using bike in place", "the adult male repairs box’s problem using lift in place", "the adult male repairs machine’s problem using stretcher in room"]}], ["planting_14.jpg", {"POS": ["the male child (and coparticipant) use a manus to plant a seedling in garden.", "the Black man (and coparticipant) use a hand to plant a vegetable in vegetable patch.", "the adult female (and coparticipant) use a paw to plant a plant in farm."], "NEG": ["the male child (and coparticipant) use a hand to plant a seedling in garden.", "the Black man (and coparticipant) use a force to plant a veg in vegetable patch.", "the adult female (and coparticipant) use a alloy to plant a plant in farm."]}], ["pitching_98.jpg", {"POS": ["the adult female uses a mitt to pitch the baseball at a baseball field", "the pitcher uses a arm to pitch the baseball at a diamond", "the woman uses a paw to pitch the softball at a field"], "NEG": ["the woman uses a squeegee to pitch the baseball at a diamond", "the twirler uses a boxing glove to pitch the baseball at a diamond", "the adult female uses a awl to pitch the softball at a field"]}], ["pitching_138.jpg", {"POS": ["the hurler uses a manus to pitch the baseball at a baseball field", "the man uses a paw to pitch the baseball at a ball field", "the ballplayer uses a manus to pitch the baseball at a diamond"], "NEG": ["the pitcher uses a chaparral to pitch the baseball at a baseball field", "the adult male uses a handler to pitch the baseball at a baseball field", "the ballplayer uses a candlelight to pitch the baseball at a baseball field"]}], ["drumming_162.jpg", {"POS": ["the graybeard drums on the membranophone with the drumstick in the place", "the adult male drums on the tympan with the drumstick in the place", "the man drums on the membranophone with the drumstick in the place"], "NEG": ["the graybeard drums on the drum with the rack in the place", "the adult male drums on the membranophone with the space in the place", "the man drums on the drum with the woman chaser in the place"]}], ["slapping_4.jpg", {"POS": ["lady slaps man (when different than the lady) in the manPART with thenar in inside", "adult female slaps man (when different than the adult female) in the manPART with thenar in office", "adult female slaps man (when different than the adult female) in the manPART with manus in interior"], "NEG": ["lady slaps adult male (when different than the lady) in the adult malePART with machine in inside", "adult female slaps adult male (when different than the adult female) in the adult malePART with riveting machine in business office", "adult female slaps man (when different than the adult female) in the manPART with emery in interior"]}], ["coloring_40.jpg", {"POS": ["the woman colors dress with marker in place", "the woman colors frock with marker in place", "the adult female colors dress with marker in room"], "NEG": ["the woman colors dress with dinghy in place", "the adult female colors frock with cleaver in place", "the woman colors dress with garden rake in room"]}], ["pitching_136.jpg", {"POS": ["the twirler uses a mitt to pitch the baseball at a ball field", "the man uses a hand to pitch the baseball at a diamond", "the ballplayer uses a hand to pitch the baseball at a baseball field"], "NEG": ["the twirler uses a thumbtack to pitch the baseball at a baseball field", "the man uses a surfboarder to pitch the baseball at a ball field", "the ballplayer uses a sprinkler to pitch the baseball at a baseball field"]}], ["whipping_228.jpg", {"POS": ["jockey whips bangtail using whip at a raceway", "jockey whips horse using whip at a course", "man whips Equus caballus using whip at a racetrack"], "NEG": ["jockey whips racehorse using body at a racetrack", "jockey whips horse using giant conch at a path", "adult male whips Equus caballus using cash at a racecourse"]}], ["bathing_114.jpg", {"POS": ["an man bathes a coagent (when different than the man) using a soap and a substance (other than water) in a bathing tub", "an man bathes a coagent (when different than the man) using a manus and a soap (other than water) in a bath", "an adult male bathes a coagent (when different than the adult male) using a manus and a substance (other than water) in a bathtub"], "NEG": ["an man bathes a coagent (when different than the man) using a member and a substance (other than water) in a bath", "an adult male bathes a coagent (when different than the adult male) using a millstone and a soap (other than water) in a bathing tub", "an adult male bathes a coagent (when different than the adult male) using a plastic wrap and a substance (other than water) in a bathing tub"]}], ["signaling_131.jpg", {"POS": ["the adult male signals the summons to the hack using the mitt in the exterior", "the adult male signals the message to the recipient using the mitt in the pavement", "the adult male signals the taxicab to the driver using the manus in the street"], "NEG": ["the adult male signals the summons to the hack using the line in the exterior", "the adult male signals the message to the recipient using the handbasket in the sidewalk", "the man signals the taxicab to the driver using the pen in the street"]}], ["vaulting_58.jpg", {"POS": ["an man vaults from dry land over hurdle to ground using a tool at a oral cavity", "an man vaults from ground over bar to land using a pole at a exterior", "an pole vaulter vaults from terra firma over bar to mat using a body at a open air"], "NEG": ["an adult male vaults from land over hurdle to terra firma using a compressed air at a mouth", "an man vaults from ground over bar to terra firma using a game equipment at a exterior", "an vaulter vaults from land over bar to mat using a match at a open air"]}], ["stitching_177.jpg", {"POS": ["the someone stitches using the sewing machine and the ribbon in a place.", "the soul stitches using the sewing machine and the fabric in a place.", "the woman stitches using the sewing machine and the ribbon in a place."], "NEG": ["the someone stitches using the match and the thread in a place.", "the soul stitches using the club and the cloth in a place.", "the adult female stitches using the metre and the ribbon in a place."]}], ["harvesting_313.jpg", {"POS": ["the worker harvest the oatmeal using a harvester from the field at the farm.", "the man harvest the straw using a reaper binder from the field at the farm.", "the man harvest the wheat using a reaper from the field at the open air."], "NEG": ["the worker harvest the rolled oats using a post from the field at the farm.", "the adult male harvest the straw using a self from the field at the farm.", "the adult male harvest the wheat using a sifter from the field at the open."]}], ["calling_42.jpg", {"POS": ["an woman calls using a cell at a out-of-doors", "an adult female calls using a cellphone at a exterior", "an woman calls using a cell at a open"], "NEG": ["an woman calls using a tiller at a out-of-doors", "an woman calls using a robotics equipment at a exterior", "an adult female calls using a hat at a outdoors"]}], ["signaling_226.jpg", {"POS": ["the player signals the message to the recipient using the manus in the playing field", "the footballer signals the cheer to the recipient using the arm in the place", "the people signals the message to the photographer using the arm in the stadium"], "NEG": ["the participant signals the message to the recipient using the pan in the playing area", "the footballer signals the cheer to the recipient using the forearm in the place", "the people signals the message to the lensman using the hand in the stadium"]}], ["steering_32.jpg", {"POS": ["the man steers the motorcar with the mitt in the exterior", "the man steers the car with the steering wheel in the route", "the people steers the machine with the steering wheel in the open air"], "NEG": ["the man steers the car with the tape in the exterior", "the man steers the automobile with the manager in the route", "the people steers the auto with the cement in the open"]}], ["smearing_233.jpg", {"POS": ["the male child smears an solid food on a human face with a manus at a room.", "the babe smears an chocolate on a face with a paw at a inside.", "the boy smears an drinking chocolate on a human face with a paw at a place."], "NEG": ["the male child smears an food on a human face with a bottle opener at a room.", "the infant smears an chocolate on a human face with a at-bat at a interior.", "the male child smears an chocolate on a face with a jet at a place."]}], ["destroying_85.jpg", {"POS": ["an somebody destroyed the building with a bulldozer at a metropolis", "an man destroyed the house with a machine at a exterior", "an people destroyed the building complex with a backhoe at a out-of-doors"], "NEG": ["an individual destroyed the building with a yelling at a city", "an man destroyed the house with a Salix alba caerulea at a exterior", "an people destroyed the building complex with a emery at a open"]}], ["filming_73.jpg", {"POS": ["the cinematographer films a player using a photographic camera at a set", "the lensman films a tiddler using a camera at a room", "the photographer films a player using a photographic camera at a interior"], "NEG": ["the cinematographer films a actor using a pin at a set", "the photographer films a nipper using a nine at a room", "the lensman films a role player using a lever at a inside"]}], ["rinsing_389.jpg", {"POS": ["someone is rinsing instrument using a sink in interior", "adult is rinsing utensil using a sink in room", "soul is rinsing cookware using a sink in kitchen"], "NEG": ["someone is rinsing instrument using a table knife in inside", "grownup is rinsing utensil using a disk harrow in room", "mortal is rinsing cooking utensil using a pitchfork in kitchen"]}], ["milking_152.jpg", {"POS": ["an little girl milks a cow with a paw into a container in a farm", "an female child milks a goat with a paw into a destination in a enclosure", "an little girl milks a goat with a paw into a pail in a pen"], "NEG": ["an little girl milks a cow with a pesticide into a container in a farm", "an girl milks a goat with a glass into a destination in a enclosure", "an little girl milks a goat with a hypodermic needle into a bucket in a pen"]}], ["pitching_8.jpg", {"POS": ["the twirler uses a mitt to pitch the baseball at a baseball field", "the baseball player uses a hand to pitch the baseball at a diamond", "the ballplayer uses a hand to pitch the baseball at a baseball field"], "NEG": ["the hurler uses a animal foot to pitch the baseball at a diamond", "the baseball player uses a measure to pitch the baseball at a baseball field", "the ballplayer uses a song to pitch the baseball at a ball field"]}], ["slapping_186.jpg", {"POS": ["adult female slaps adult male (when different than the adult female) in the adult malePART with thenar in house", "adult female slaps adult male (when different than the adult female) in the adult malePART with thenar in office", "woman slaps man (when different than the woman) in the manPART with mitt in room"], "NEG": ["adult female slaps adult male (when different than the adult female) in the adult malePART with strawberry in house", "adult female slaps adult male (when different than the adult female) in the adult malePART with right hand in office", "woman slaps adult male (when different than the woman) in the adult malePART with belt in room"]}], ["catching_69.jpg", {"POS": ["an man catches a baseball with a glove at a bleachers", "an man catches a baseball with a baseball mitt at a baseball", "an adult male catches a caughtitem with a baseball mitt at a place"], "NEG": ["an adult male catches a baseball with a headset at a bleachers", "an adult male catches a baseball with a scrub at a baseball", "an adult male catches a caughtitem with a sliding board at a place"]}], ["pitching_181.jpg", {"POS": ["the baseball player uses a manus to pitch the baseball at a baseball field", "the baseball player uses a mitt to pitch the baseball at a ball field", "the man uses a hand to pitch the baseball at a ball field"], "NEG": ["the baseball player uses a garden cart to pitch the baseball at a baseball field", "the ballplayer uses a keyboard to pitch the baseball at a ball field", "the man uses a monitoring device to pitch the baseball at a baseball field"]}], ["fastening_52.jpg", {"POS": ["an adult male fastens an item into a plank with a screw using a drill at a place", "an someone fastens an board into a table with a screw using a screwdriver at a inside", "an mortal fastens an handgrip into a plank with a screw using a screwdriver at a interior"], "NEG": ["an adult male fastens an item into a plank with a screw using a penchant at a place", "an someone fastens an board into a table with a screw using a seed at a interior", "an mortal fastens an hold into a plank with a screw using a concatenation at a inside"]}], ["stapling_90.jpg", {"POS": ["an agent staples a textile onto a wood using a staple gun in a counter", "an person staples a fabric onto a wood using a stapling machine in a inside", "an soul staples a material onto a wood using a staple gun in a inside"], "NEG": ["an agent staples a material onto a wood using a tubing in a counter", "an soul staples a material onto a wood using a tag end in a inside", "an someone staples a material onto a wood using a fish in a interior"]}], ["coloring_8.jpg", {"POS": ["the person colors fabric with felt-tip pen in place", "the youngster colors coloring book with marker in place", "the individual colors textile with marker in place"], "NEG": ["the mortal colors fabric with notebook in place", "the nipper colors coloring book with network in place", "the someone colors material with Doppler radar in place"]}], ["extinguishing_45.jpg", {"POS": ["the fire fighter extinguishes mound using fire hose in open", "the firefighter extinguishes item using hose in outside", "the fire fighter extinguishes barrel using hose in out-of-doors"], "NEG": ["the fire fighter extinguishes cumulation using peg in out-of-doors", "the fire-eater extinguishes item using balsa wood in exterior", "the fire-eater extinguishes cask using pen in open"]}], ["sketching_198.jpg", {"POS": ["the people sketches an picture on canvas with a paintbrush  in interior.", "the adult female sketches an landscape on canvass with a paintbrush  in studio.", "the creative person sketches an picture on canvas with a paintbrush  in studio."], "NEG": ["the people sketches an picture on canvass with a wheel  in inside.", "the adult female sketches an landscape on canvas with a watering cart  in studio.", "the creative person sketches an painting on canvas with a concrete  in studio."]}], ["drying_186.jpg", {"POS": ["somebody dries wear using clothes drier at a place", "individual dries wash using rack at a room", "dryer dries dress using heat energy at a inside"], "NEG": ["person dries wearable using soaking at a place", "somebody dries laundry using dress hanger at a room", "dryer dries wearing apparel using paper at a interior"]}], ["flinging_344.jpg", {"POS": ["footballer flings football toward goal using paw in a place", "adult male flings football toward mate using mitt in a football field", "adult male flings ball toward goal using arm in a inside"], "NEG": ["footballer flings football toward goal using flamethrower in a place", "man flings football toward teammate using shredder in a football field", "adult male flings ball toward goal using graduated table in a inside"]}], ["hitting_181.jpg", {"POS": ["the adult male hits the ball on the ballPART (when the target is a clear part) with a manus in stadium.", "the man hits the ball on the ballPART (when the target is a clear part) with a manus in inside.", "the volleyball player hits the volleyball on the volleyballPART (when the target is a clear part) with a manus in volleyball court."], "NEG": ["the adult male hits the ball on the ballPART (when the target is a clear part) with a sculpture in bowl.", "the man hits the ball on the ballPART (when the target is a clear part) with a squirter in interior.", "the volleyball player hits the volleyball on the volleyballPART (when the target is a clear part) with a cookie sheet in volleyball court."]}], ["rinsing_395.jpg", {"POS": ["woman is rinsing mitt using a sink in interior", "adult is rinsing paw using a sink in kitchen", "person is rinsing mitt using a sink in kitchen"], "NEG": ["woman is rinsing hand using a Sun in interior", "adult is rinsing paw using a sport utility vehicle in kitchen", "somebody is rinsing manus using a current of air in kitchen"]}], ["applying_140.jpg", {"POS": ["agent is applying a substance to a wheel using aerosol bomb in a place.", "male is applying a can to a bike using hand in a exterior.", "mortal is applying a spray to a cycle using hand in a open air."], "NEG": ["agent is applying a substance to a wheel using carpenter's level in a place.", "male is applying a john to a bicycle using stick in a exterior.", "mortal is applying a spray to a bike using microscope in a out-of-doors."]}], ["extinguishing_213.jpg", {"POS": ["the firefighter extinguishes flaming using hose in outside", "the fireman extinguishes dry land using hosepipe in outside", "the man extinguishes fire using hose in outside"], "NEG": ["the fire fighter extinguishes fire using participant in outside", "the firefighter extinguishes land using container in outside", "the adult male extinguishes fire using legs in exterior"]}], ["flinging_281.jpg", {"POS": ["boy flings baseball toward mate using mitt in a baseball field", "male child flings baseball player toward goal using paw in a baseball field", "boy flings baseball toward goal using arm in a diamond"], "NEG": ["male child flings baseball toward teammate using glossiness in a baseball field", "male child flings ballplayer toward goal using match in a ball field", "boy flings baseball toward goal using airplane in a diamond"]}], ["drumming_205.jpg", {"POS": ["the missy drums on the drum with the drumstick in the stage", "the missy drums on the drum with the drumstick in the room", "the young lady drums on the tympan with the drumstick in the interior"], "NEG": ["the girl drums on the membranophone with the cellular telephone in the stage", "the young lady drums on the membranophone with the van in the room", "the fille drums on the membranophone with the platform in the inside"]}], ["operating_321.jpg", {"POS": ["the nurse operates an laptop with a mitt in hospital.", "the adult female operates an information processing system with a mitt in hospital.", "the nurse operates an desktop computer with a computer mouse in ward."], "NEG": ["the nurse operates an laptop with a medical instrument in hospital.", "the woman operates an computing machine with a fag in hospital.", "the nurse operates an desktop computer with a compressed air in hospital ward."]}], ["phoning_137.jpg", {"POS": ["the woman phones using the cellphone at the street.", "the woman phones using the cellular telephone at the street.", "the adult female phones using the phone at the outside."], "NEG": ["the adult female phones using the bag at the street.", "the woman phones using the corkscrew at the street.", "the woman phones using the hose at the exterior."]}], ["vaulting_61.jpg", {"POS": ["an athlete vaults from soil over bar to ground using a pole at a out-of-doors", "an athlete vaults from earth over bar to terra firma using a pole at a out-of-doors", "an gymnast vaults from terra firma over hurdle to dry land using a pole at a outdoors"], "NEG": ["an athlete vaults from land over bar to land using a pull at a out-of-doors", "an jock vaults from earth over bar to terra firma using a Global Positioning System at a outdoors", "an gymnast vaults from ground over hurdle to land using a tissue at a out-of-doors"]}], ["combing_195.jpg", {"POS": ["the woman combs the hair with a hairbrush at a bathroom.", "the woman combs the hair with a brush at a bathroom.", "the woman combs the hair with a brush at a room."], "NEG": ["the adult female combs the hair with a Zimmer frame at a bath.", "the woman combs the hair with a riding mower at a bath.", "the adult female combs the hair with a emery paper at a room."]}], ["building_94.jpg", {"POS": ["an adult male builds a tower from block using a hand in a flooring", "an adult male builds a pillar from block using a mitt in a flooring", "an adult male builds a column from block using a mitt in a room"], "NEG": ["an man builds a tower from block using a ring in a flooring", "an adult male builds a pillar from block using a nail in a flooring", "an adult male builds a pillar from block using a towel in a room"]}], ["filming_77.jpg", {"POS": ["the camera operator films a young buck using a photographic camera at a outdoors", "the cinematographer films a boy using a camera at a outdoors", "the camera operator films a ride using a camera at a outside"], "NEG": ["the cameraman films a young man using a tow at a open air", "the cameraman films a male child using a piolet at a open", "the cinematographer films a ride using a hedge trimmer at a outside"]}], ["curling_199.jpg", {"POS": ["woman curling hair with curling iron in place.", "woman curling hair with curling iron in room.", "woman curling hair with curling iron in inside."], "NEG": ["woman curling hair with torch in place.", "woman curling hair with tuning fork in room.", "adult female curling hair with plier in interior."]}], ["pitching_226.jpg", {"POS": ["the male child uses a paw to pitch the baseball at a out-of-doors", "the boy uses a mitt to pitch the baseball at a ball field", "the male child uses a mitt to pitch the baseball at a ball field"], "NEG": ["the boy uses a water level to pitch the baseball at a open air", "the boy uses a Doppler radar to pitch the baseball at a ball field", "the male child uses a chain saw to pitch the baseball at a diamond"]}], ["combing_102.jpg", {"POS": ["the adult female combs the hair with a coppice at a place.", "the adult female combs the hair with a brush at a bathroom.", "the woman combs the hair with a brush at a interior."], "NEG": ["the adult female combs the hair with a Kleenex at a place.", "the woman combs the hair with a transit at a bath.", "the woman combs the hair with a fork at a inside."]}], ["vaulting_202.jpg", {"POS": ["an athlete vaults from solid ground over bar to land using a pole at a racecourse", "an pole vaulter vaults from earth over bar to dry land using a pole at a open air", "an adult male vaults from earth over bar to mat using a pole at a track"], "NEG": ["an athlete vaults from terra firma over bar to solid ground using a Salix alba caerulea at a racetrack", "an vaulter vaults from earth over bar to earth using a wooden spoon at a open air", "an adult male vaults from earth over bar to mat using a castigation at a course"]}], ["spanking_13.jpg", {"POS": ["the adult male spanks the adult female with the hand in the chair", "the adult male spanks the woman with the paw in the place", "the man spanks the woman with the paw in the room"], "NEG": ["the man spanks the adult female with the rifle in the chair", "the adult male spanks the woman with the bulldozer in the place", "the man spanks the woman with the stapling machine in the room"]}], ["whipping_209.jpg", {"POS": ["man whips man using whip at a open", "man whips adult male using tool at a exterior", "adult male whips man using whip at a outside"], "NEG": ["adult male whips adult male using spray gun at a open", "adult male whips adult male using lug wrench at a exterior", "man whips adult male using cart at a outside"]}], ["helping_42.jpg", {"POS": ["man helped woman with a hand in eating house", "adult male helped woman with a paw in restaurant", "man helped woman with a manus in reception"], "NEG": ["man helped woman with a pin in eating house", "adult male helped woman with a garden hose in eating house", "adult male helped woman with a pillow in reception"]}], ["flinging_107.jpg", {"POS": ["field general flings football toward goal using hand in a gridiron", "football field flings football toward football player using paw in a gridiron", "quarterback flings football toward teammate using paw in a gridiron"], "NEG": ["field general flings football toward goal using knob in a football field", "football field flings football toward footballer using putty in a gridiron", "field general flings football toward mate using oar in a football field"]}], ["stitching_24.jpg", {"POS": ["the woman stitches using the sewing machine and the ribbon in a classroom.", "the people stitches using the sewing machine and the thread in a room.", "the people stitches using the sewing machine and the thread in a manufactory."], "NEG": ["the adult female stitches using the spray and the thread in a schoolroom.", "the people stitches using the sharpener and the yarn in a room.", "the people stitches using the people and the thread in a manufactory."]}], ["nailing_10.jpg", {"POS": ["the man uses the hammer to nail plank and plank together in the place.", "the man uses the hammer to nail nail and wood together in the outside.", "the man uses the hammer to nail plank and board together in the outdoors."], "NEG": ["the man uses the swing to nail plank and plank together in the place.", "the adult male uses the scale to nail nail and wood together in the outside.", "the adult male uses the specs to nail board and board together in the out-of-doors."]}], ["unloading_76.jpg", {"POS": ["an adult male unloads an payload from a motortruck using a manus at a place", "an people unloads an crate from a motortruck using a hand at a street", "an worker unloads an crate from a motortruck using a manus at a outdoors"], "NEG": ["an adult male unloads an freight from a truck using a swing at a place", "an people unloads an crate from a truck using a young woman at a street", "an worker unloads an crate from a truck using a pencil at a outdoors"]}], ["slapping_52.jpg", {"POS": ["missy slaps miss (when different than the missy) in the missPART with palm in room", "miss slaps young woman (when different than the miss) in the young womanPART with paw in schoolroom", "missy slaps educatee (when different than the missy) in the educateePART with manus in schoolroom"], "NEG": ["miss slaps young lady (when different than the miss) in the young ladyPART with fingerprint in room", "young lady slaps miss (when different than the young lady) in the missPART with nose in classroom", "girl slaps educatee (when different than the girl) in the educateePART with boost in schoolroom"]}], ["operating_160.jpg", {"POS": ["the soul operates an touch screen with a finger in place.", "the mortal operates an information processing system with a paw in room.", "the individual operates an computing device with a manus in place."], "NEG": ["the mortal operates an touchscreen with a lure in place.", "the somebody operates an electronic computer with a spraying in room.", "the person operates an electronic computer with a plunger in place."]}], ["combing_52.jpg", {"POS": ["the adult male combs the hair with a comb at a place.", "the man combs the hair with a comb at a place.", "the man combs the hair with a comb at a place."], "NEG": ["the adult male combs the hair with a ice axe at a place.", "the man combs the hair with a flat file at a place.", "the adult male combs the hair with a mallet at a place."]}], ["uncorking_129.jpg", {"POS": ["the individual uncorks a wine bottle using a corkscrew in inside.", "the individual uncorks a wine bottle using a bottle screw in place.", "the person uncorks a wine bottle using a corkscrew in place."], "NEG": ["the soul uncorks a wine bottle using a bash in interior.", "the mortal uncorks a wine bottle using a saw in place.", "the mortal uncorks a wine bottle using a microscope in place."]}], ["painting_272.jpg", {"POS": ["an adult male paints an ceiling with a paint roller at a room", "an man paints an ceiling with a roller at a house", "an adult male paints an ceiling with a brush at a inside"], "NEG": ["an adult male paints an ceiling with a nothingness at a room", "an adult male paints an ceiling with a clinch at a house", "an man paints an ceiling with a foot at a interior"]}], ["spanking_35.jpg", {"POS": ["the Santa Claus spanks the woman with the stick in the room", "the adult male spanks the woman with the sprig in the room", "the Father Christmas spanks the adult female with the stick in the living room"], "NEG": ["the Saint Nick spanks the adult female with the pontoon in the room", "the adult male spanks the woman with the hanky in the room", "the Santa Claus spanks the woman with the harrow in the sitting room"]}], ["pumping_121.jpg", {"POS": ["an man pumps a waste material from a dry land to a tank using a pump at a route", "an man pumps a sewage from a earth to a truck using a pump at a open air", "an man pumps a substance from a manhole to a truck using a hose at a out-of-doors"], "NEG": ["an adult male pumps a waste from a solid ground to a storage tank using a nothingness at a road", "an man pumps a sewage from a earth to a motortruck using a golf club at a outdoors", "an adult male pumps a substance from a manhole to a truck using a make-up at a open air"]}], ["flinging_125.jpg", {"POS": ["twirler flings baseball toward goal using mitt in a hill", "adult male flings ball toward mate using mitt in a football field", "ballplayer flings baseball toward teammate using mitt in a baseball diamond"], "NEG": ["hurler flings baseball toward goal using hackamore in a mound", "man flings ball toward teammate using horse in a football field", "baseball player flings baseball toward mate using adult female in a infield"]}], ["pouring_210.jpg", {"POS": ["an agent pours a substance from a source to a destination with a tool in a inside", "an individual pours a sauce from a spoon to a food with a hand in a plate", "an somebody pours a stock from a ladle to a volaille with a hand in a plate"], "NEG": ["an agent pours a substance from a source to a destination with a sewing needle in a inside", "an someone pours a sauce from a spoon to a nutrient with a gasoline pump in a plate", "an mortal pours a broth from a ladle to a poulet with a set in a plate"]}], ["buttering_115.jpg", {"POS": ["an individual butters an item using a tool in a interior", "an person butters an cake using a fork in a plate", "an agent butters an item using a fork in a place"], "NEG": ["an somebody butters an item using a trimmer in a interior", "an somebody butters an bar using a candle flame in a plate", "an agent butters an item using a animate being in a place"]}], ["pitching_249.jpg", {"POS": ["the adult male uses a paw to pitch the baseball at a ball field", "the man uses a manus to pitch the baseball at a baseball field", "the adult male uses a manus to pitch the baseball at a ball field"], "NEG": ["the man uses a heart monitor to pitch the baseball at a baseball field", "the man uses a equipment to pitch the baseball at a baseball field", "the adult male uses a sealant to pitch the baseball at a ball field"]}], ["attaching_192.jpg", {"POS": ["an adult male attaches a rope to a harness with knot using a paw at a open", "an man attaches a rope to a destination with glue using a tool at a out-of-doors", "an adult male attaches a rope to a harness with karabiner using a hand at a open air"], "NEG": ["an adult male attaches a rope to a harness with knot using a kine at a open", "an adult male attaches a rope to a destination with glue using a buff at a out-of-doors", "an man attaches a rope to a harness with carabiner using a lead pencil at a out-of-doors"]}], ["pouring_328.jpg", {"POS": ["an mortal pours a butter from a cooking pan to a mixing bowl with a mitt in a countertop", "an manus pours a eggs from a pot to a bowl with a tool in a kitchen", "an woman pours a butter from a saucepan to a mixing bowl with a manus in a countertop"], "NEG": ["an soul pours a butter from a cooking pan to a mixing bowl with a serviette in a countertop", "an paw pours a egg from a pot to a bowl with a syringe in a kitchen", "an adult female pours a butter from a saucepan to a mixing bowl with a robotics equipment in a countertop"]}], ["filming_0.jpg", {"POS": ["the cinematographer films a performer using a camera at a stage set", "the cinematographer films a performer using a camera at a catwalk", "the cameraman films a performer using a camera at a stage set"], "NEG": ["the cameraman films a performer using a Allen wrench at a set", "the camera operator films a performer using a whisk at a catwalk", "the camera operator films a performer using a memory chip at a stage set"]}], ["stitching_107.jpg", {"POS": ["the mortal stitches using the sewing machine and the thread in a place.", "the individual stitches using the sewing machine and the yarn in a place.", "the somebody stitches using the sewing machine and the dress in a place."], "NEG": ["the individual stitches using the microwave radar and the yarn in a place.", "the someone stitches using the line and the yarn in a place.", "the mortal stitches using the playscript and the apparel in a place."]}], ["eating_388.jpg", {"POS": ["an adult female eat a granola bar from a container using a manus at a place", "an woman eat a granola bar from a container using a tool at a place", "an adult female eat a granola bar from a container using a oral cavity at a place"], "NEG": ["an adult female eat a granola bar from a container using a photographic camera at a place", "an woman eat a granola bar from a container using a lance at a place", "an woman eat a granola bar from a container using a spirit level at a place"]}], ["pitching_31.jpg", {"POS": ["the paw uses a manus to pitch the baseball at a baseball field", "the twirler uses a mitt to pitch the baseball at a athletic field", "the ballplayer uses a hand to pitch the baseball at a diamond"], "NEG": ["the hand uses a instrument to pitch the baseball at a diamond", "the hurler uses a wood to pitch the baseball at a athletic field", "the ballplayer uses a wall to pitch the baseball at a baseball field"]}], ["performing_0.jpg", {"POS": ["the singer performing the concert on the stage using a mike at a concert hall.", "the vocaliser performing the concert on the stage using a phonation at a concert hall.", "the vocalizer performing the show on the stage using a mike at a place."], "NEG": ["the vocalist performing the concert on the stage using a outside at a concert hall.", "the singer performing the concert on the stage using a mixer at a concert hall.", "the singer performing the show on the stage using a spatula at a place."]}], ["hoisting_306.jpg", {"POS": ["an agent hoists an generator up from a dry land using a crane at a open air", "an crane hoists an item up from a source using a crane at a open", "an crane hoists an edifice up from a solid ground using a claw at a open"], "NEG": ["an agent hoists an generator up from a terra firma using a router at a open air", "an crane hoists an item up from a source using a doorknob at a outdoors", "an crane hoists an building up from a land using a domestic dog at a open air"]}], ["pouring_279.jpg", {"POS": ["an adult male pours a wine from a bottle to a drinking glass with a mitt in a inside", "an person pours a wine from a bottle to a drinking glass with a manus in a inside", "an soul pours a wine from a bottle to a drinking glass with a paw in a bar"], "NEG": ["an adult male pours a wine from a bottle to a glass with a wrist in a interior", "an person pours a wine from a bottle to a glass with a haemostat in a inside", "an soul pours a vino from a bottle to a drinking glass with a combination in a ginmill"]}], ["spanking_47.jpg", {"POS": ["the hand spanks the adult female with the paw in the place", "the adult male spanks the woman with the manus in the chair", "the adult male spanks the adult female with the mitt in the chair"], "NEG": ["the paw spanks the woman with the measuring rod in the place", "the adult male spanks the woman with the mason's trowel in the chair", "the adult male spanks the woman with the pruning saw in the chair"]}], ["coloring_139.jpg", {"POS": ["the boy colors paper with pencil in table", "the youngster colors paper with pencil in table", "the child colors paper with tool in room"], "NEG": ["the boy colors paper with screen in table", "the tiddler colors paper with matchbook in table", "the nestling colors paper with right hand in room"]}], ["flinging_11.jpg", {"POS": ["someone flings stone toward goal using arm in a open", "boy flings item toward devastation using mitt in a street", "adult male flings stone toward rock using manus in a town"], "NEG": ["person flings rock toward goal using moving stairway in a outdoors", "male child flings item toward destruction using paddle in a street", "adult male flings stone toward rock using tap wrench in a town"]}], ["pouring_17.jpg", {"POS": ["an adult male pours a tea from a teapot to a cup with a manus in a room", "an man pours a tea from a teapot to a glass with a paw in a edifice", "an adult male pours a substance from a kettle to a drinking glass with a manus in a eating place"], "NEG": ["an man pours a tea from a teapot to a cup with a jigger in a room", "an adult male pours a tea from a teapot to a glass with a wig in a building", "an man pours a substance from a kettle to a drinking glass with a human foot in a eatery"]}], ["pouring_49.jpg", {"POS": ["an person pours a batter from a bowl to a cooking pan with a manus in a kitchen", "an someone pours a batter from a arena to a dish with a hand in a kitchen", "an manus pours a flannel-cake from a stadium to a pan with a tool in a kitchen"], "NEG": ["an someone pours a batter from a bowl to a pan with a tree in a kitchen", "an person pours a batter from a bowl to a dish with a wineglass in a kitchen", "an hand pours a griddlecake from a arena to a pan with a cotton gin in a kitchen"]}], ["manicuring_10.jpg", {"POS": ["woman manicures fingernail using nail varnish at a table", "adult female manicures fingernail using gloss at a room", "adult female manicures fingernail using nail polish at a inside"], "NEG": ["adult female manicures fingernail using talk at a table", "adult female manicures fingernail using shears at a room", "woman manicures fingernail using seat at a interior"]}], ["pouring_358.jpg", {"POS": ["an soul pours a orange juice from a measuring cup to a cooking pan with a paw in a kitchen range", "an someone pours a substance from a cup to a pan with a manus in a stove", "an someone pours a eggs from a measuring cup to a frying pan with a paw in a kitchen"], "NEG": ["an person pours a orange juice from a measuring cup to a pan with a marker in a kitchen stove", "an someone pours a substance from a cup to a cooking pan with a harness in a kitchen range", "an individual pours a eggs from a measuring cup to a frying pan with a cotton fiber in a kitchen"]}], ["arranging_69.jpg", {"POS": ["the adult male arranges flora with tool in house", "the adult male arranges flower with hand in place", "the mitt arranges flower with hand in interior"], "NEG": ["the adult male arranges plant with Han in house", "the man arranges flower with oar in place", "the hand arranges flower with jeep in interior"]}], ["flinging_134.jpg", {"POS": ["twirler flings baseball toward backstop using manus in a diamond", "adult male flings baseball toward goal using paw in a baseball", "man flings baseball game toward strikeout using manus in a baseball field"], "NEG": ["twirler flings baseball toward backstop using rule in a diamond", "adult male flings baseball toward goal using form in a baseball game", "adult male flings baseball game toward strikeout using fabric in a baseball field"]}], ["applying_135.jpg", {"POS": ["woman is applying a lipstick to a lip using mitt in a place.", "woman is applying a lip rouge to a lip using hand in a place.", "adult female is applying a lip rouge to a lip using finger in a interior."], "NEG": ["woman is applying a lipstick to a lip using boost in a place.", "woman is applying a lipstick to a lip using iron in a place.", "woman is applying a lipstick to a lip using human head in a inside."]}], ["weighing_250.jpg", {"POS": ["an male child weighs the male child with a scale in a place", "an boy weighs the male child with a scale in a place", "an nestling weighs the minor with a scale in a room"], "NEG": ["an boy weighs the boy with a handsaw in a place", "an male child weighs the boy with a cleansing agent in a place", "an youngster weighs the youngster with a photograph in a room"]}], ["interrogating_23.jpg", {"POS": ["the man interrogated the adult male using the gun in the room", "the man interrogated the adult male using the gun in the interior", "the man interrogated the young man using the gun in the room"], "NEG": ["the adult male interrogated the man using the lotion in the room", "the adult male interrogated the adult male using the plastering trowel in the interior", "the man interrogated the young man using the pencil sharpener in the room"]}], ["drumming_232.jpg", {"POS": ["the greybeard drums on the membranophone with the drumstick in the stage", "the man drums on the tympan with the tool in the concert", "the man drums on the drum with the drumstick in the interior"], "NEG": ["the Methuselah drums on the tympan with the floating bridge in the stage", "the adult male drums on the drum with the eyebrow pencil in the concert", "the man drums on the membranophone with the razorblade in the interior"]}], ["spanking_138.jpg", {"POS": ["the mother spanks the child with the manus in the park", "the adult female spanks the kid with the manus in the parkland", "the woman spanks the minor with the hand in the green"], "NEG": ["the mother spanks the tike with the belt in the park", "the woman spanks the child with the pocket in the park", "the woman spanks the nestling with the vat in the common"]}], ["pitching_220.jpg", {"POS": ["the adult male uses a hand to pitch the baseball at a baseball field", "the ballplayer uses a hand to pitch the baseball at a baseball field", "the man uses a mitt to pitch the baseball at a baseball field"], "NEG": ["the man uses a toggle bolt to pitch the baseball at a ball field", "the ballplayer uses a dispenser to pitch the baseball at a ball field", "the adult male uses a teapot to pitch the baseball at a baseball field"]}], ["bathing_144.jpg", {"POS": ["an female bathes a coagent (when different than the female) using a tool and a wine (other than water) in a bath", "an adult female bathes a coagent (when different than the adult female) using a towel and a bubble (other than water) in a bathtub", "an woman bathes a coagent (when different than the woman) using a paw and a soap (other than water) in a bathing tub"], "NEG": ["an female bathes a coagent (when different than the female) using a elevator and a wine (other than water) in a bathing tub", "an adult female bathes a coagent (when different than the adult female) using a mucilage and a bubble (other than water) in a bathing tub", "an woman bathes a coagent (when different than the woman) using a scribe and a soap (other than water) in a bathtub"]}], ["disciplining_208.jpg", {"POS": ["an referee disciplines a player with a card in a bowl", "an ref disciplines a soccer player with a tool in a field", "an ref disciplines a player with a finger in a place"], "NEG": ["an ref disciplines a player with a harvester in a stadium", "an referee disciplines a soccer player with a battler in a playing field", "an referee disciplines a player with a wall in a place"]}], ["smashing_106.jpg", {"POS": ["an criminal smashes the window with a hammer against glass at a street", "an somebody smashes the window with a hammer against against at a outside", "an burglar smashes the window with a pry against against at a pavement"], "NEG": ["an malefactor smashes the window with a dress hanger against glass at a street", "an soul smashes the window with a fishing rod against against at a outside", "an burglar smashes the window with a blender against against at a pavement"]}], ["making_33.jpg", {"POS": ["an paw makes a arts and crafts by manipulating a paper using a manus at a table", "an mitt makes a aeroplane by manipulating a construction paper using a paw at a place", "an individual makes a origami by manipulating a paper using a hand at a place"], "NEG": ["an paw makes a arts and crafts by manipulating a paper using a harness at a table", "an paw makes a plane by manipulating a construction paper using a platform at a place", "an person makes a origami by manipulating a paper using a Korzybski at a place"]}], ["spanking_124.jpg", {"POS": ["the man spanks the female with the paw in the room", "the performing artist spanks the performer with the mitt in the stage", "the man spanks the adult female with the manus in the room"], "NEG": ["the adult male spanks the female with the monitoring device in the room", "the performing artist spanks the performing artist with the cane in the stage", "the adult male spanks the adult female with the stem in the room"]}]]