[["bouncing_24.jpg", {"POS": ["the small fry bounces an item against a bed in bedchamber.", "the boy bounces an male child against a bed in interior.", "the fry bounces an child against a bed in place."], "NEG": ["the tike bounces an child against a bed in bedchamber.", "the boy bounces an gum against a bed in interior.", "the shaver bounces an female child against a bed in place."]}], ["flinging_19.jpg", {"POS": ["man flings hat toward sky using arm in a field", "adult male flings hat toward sky using manus in a field", "adult male flings hat toward goal using manus in a outdoors"], "NEG": ["adult male flings paving toward sky using arm in a field", "man flings confetti toward sky using paw in a field", "adult male flings joist toward goal using paw in a open"]}], ["serving_156.jpg", {"POS": ["the adult male serves an tennis ball to the served at a tennis court.", "the tennis player serves an tennis ball to the tennis player at a tennis court.", "the tennis player serves an tennis ball to the tennis player at a tennis court."], "NEG": ["the man serves an rim to the served at a tennis court.", "the tennis player serves an quarry to the tennis player at a tennis court.", "the tennis player serves an asphyxiator to the tennis player at a tennis court."]}], ["shearing_137.jpg", {"POS": ["an sodbuster shears an wool from a sheep at a barn", "an adult male shears an wool from a sheep at a room", "an adult male shears an woollen from a sheep at a shed"], "NEG": ["an husbandman shears an outside door from a sheep at a barn", "an man shears an writing from a sheep at a room", "an adult male shears an loaf from a sheep at a shed"]}], ["flinging_212.jpg", {"POS": ["man flings stone toward police using paw in a open", "boy flings stone toward police using hand in a street", "adult male flings brick toward policeman using manus in a street"], "NEG": ["adult male flings paper toward police using hand in a open", "boy flings golf ball toward police using hand in a street", "man flings blouse toward officer using hand in a street"]}], ["tripping_81.jpg", {"POS": ["an horse trips over an rope onto a DESTINATION in a rodeo", "an bull trips over an land onto a DESTINATION in a outside", "an Equus caballus trips over an rope onto a DESTINATION in a open air"], "NEG": ["an Equus caballus trips over an omnibus onto a DESTINATION in a rodeo", "an bull trips over an chetah onto a DESTINATION in a exterior", "an Equus caballus trips over an field onto a DESTINATION in a open"]}], ["covering_152.jpg", {"POS": ["the adult female covers the hair with a head covering at a place.", "the mannequin covers the hair with a headdress at a studio.", "the agent covers the scalp with a scarf at a place."], "NEG": ["the adult female covers the battlewagon with a veil at a place.", "the mannequin covers the diamond with a headgear at a studio.", "the agent covers the toe with a scarf at a place."]}], ["flinging_180.jpg", {"POS": ["ballplayer flings baseball toward goal using manus in a ball field", "adult male flings ball toward goal using manus in a outside", "empty flings item toward goal using tool in a place"], "NEG": ["ballplayer flings peppercorn toward goal using mitt in a diamond", "adult male flings corn dodger toward goal using hand in a outside", "empty flings projectile toward goal using tool in a place"]}], ["ejecting_184.jpg", {"POS": ["an man ejects an bullet from a gun toward a destination at a open", "an individual ejects an slug from a gun toward a destination at a open air", "an gun ejects an bullet from a gun barrel toward a air at a exterior"], "NEG": ["an adult male ejects an glove from a gun toward a destination at a outdoors", "an person ejects an railroad track from a gun toward a destination at a out-of-doors", "an gun ejects an poisonous substance from a gun barrel toward a air at a exterior"]}], ["tilting_79.jpg", {"POS": ["an man tilts an wood with their manPART at a studio", "an adult male tilts an wood with their adult malePART at a studio", "an adult female tilts an table with their adult femalePART at a room"], "NEG": ["an adult male tilts an tuition with their adult malePART at a studio", "an adult male tilts an bagel with their adult malePART at a studio", "an adult female tilts an frost with their adult femalePART at a room"]}], ["scrubbing_336.jpg", {"POS": ["an person scrubs an carpeting with a scrub brush at a car", "an somebody scrubs an carpeting with a scrub brush at a house", "an individual scrubs an carpet with a brush at a place"], "NEG": ["an somebody scrubs an bale with a scrubbing brush at a car", "an mortal scrubs an genu with a scrub brush at a house", "an soul scrubs an surgical instrument with a brush at a place"]}], ["punting_23.jpg", {"POS": ["an footballer punts a football at a football", "an football player punts a ball at a football field", "an footballer punts a football at a gridiron"], "NEG": ["an football player punts a pillow at a football", "an footballer punts a pollex at a gridiron", "an footballer punts a canvass at a gridiron"]}], ["flinging_315.jpg", {"POS": ["football player flings football toward mate using manus in a gridiron", "man flings football toward mate using arm in a football field", "man flings football toward goal using arm in a field"], "NEG": ["footballer flings Sun toward mate using mitt in a football field", "adult male flings kangaroo toward teammate using arm in a gridiron", "man flings extinguisher toward goal using arm in a field"]}], ["extinguishing_97.jpg", {"POS": ["the fireman extinguishes family using hosepipe in exterior", "the fireman extinguishes house using hosepipe in open", "the fireman extinguishes house using hosepipe in out-of-doors"], "NEG": ["the fireman extinguishes felt using hose in exterior", "the fire-eater extinguishes son using hose in open", "the fire-eater extinguishes source using hose in out-of-doors"]}], ["throwing_31.jpg", {"POS": ["the twirler throws an baseball towards a catcher at a diamond.", "the pitcher throws an baseball towards a batter at a baseball diamond.", "the man throws an baseball towards a right at a field."], "NEG": ["the hurler throws an dressing towards a catcher at a diamond.", "the pitcher throws an gazelle towards a slugger at a infield.", "the man throws an chicken wire towards a right at a field."]}], ["throwing_14.jpg", {"POS": ["the athlete throws an ball towards a destination at a place.", "the athlete throws an shot towards a athletic field at a place.", "the shot putter throws an shot towards a field at a athletic field."], "NEG": ["the athlete throws an lamp towards a destination at a place.", "the athlete throws an nut towards a athletic field at a place.", "the shot putter throws an pad of paper towards a athletic field at a playing field."]}], ["tripping_207.jpg", {"POS": ["an man trips over an manhole onto a DESTINATION in a piazza", "an statue trips over an mitt onto a DESTINATION in a pavement", "an statue trips over an item onto a DESTINATION in a pavement"], "NEG": ["an adult male trips over an cake mix onto a DESTINATION in a place", "an statue trips over an sleeping bag onto a DESTINATION in a pavement", "an statue trips over an dry wall onto a DESTINATION in a pavement"]}], ["shelving_81.jpg", {"POS": ["the woman shelves an book on a bookshelf in library.", "the adult female shelves an book on a shelf in place.", "the adult female shelves an book on a bookshelf in library."], "NEG": ["the adult female shelves an bowtie on a bookshelf in library.", "the adult female shelves an blouse on a shelf in place.", "the woman shelves an foot pedal on a bookshelf in library."]}], ["taping_131.jpg", {"POS": ["an adult female tapes an gauze to a man at a room", "an adult female tapes an neck to a destination at a inside", "an person tapes an shoulder to a destination at a interior"], "NEG": ["an adult female tapes an track to a adult male at a room", "an adult female tapes an shoulder to a destination at a interior", "an person tapes an hairstyle to a destination at a inside"]}], ["braiding_4.jpg", {"POS": ["adult female braids hair at a place", "woman braids hair at a room", "woman braids hair at a inside"], "NEG": ["adult female braids school bus at a place", "woman braids pod at a room", "woman braids colt at a inside"]}], ["punting_131.jpg", {"POS": ["an punter punts a football at a football field", "an footballer punts a football at a stadium", "an football player punts a ball at a football field"], "NEG": ["an punter punts a bear at a football field", "an footballer punts a packet at a arena", "an footballer punts a felt at a gridiron"]}], ["flinging_231.jpg", {"POS": ["ballplayer flings baseball toward home base using hand in a infield", "pitcher flings baseball toward backstop using manus in a baseball field", "twirler flings baseball toward goal using mitt in a mound"], "NEG": ["baseball player flings spring toward plate using hand in a baseball diamond", "twirler flings pond toward backstop using mitt in a ball field", "pitcher flings breakfast food toward goal using paw in a pitcher's mound"]}], ["flinging_344.jpg", {"POS": ["footballer flings football toward goal using paw in a place", "adult male flings football toward mate using mitt in a football field", "adult male flings ball toward goal using arm in a inside"], "NEG": ["footballer flings dough toward goal using mitt in a place", "adult male flings trading card toward mate using hand in a football field", "man flings war paint toward goal using arm in a inside"]}], ["moistening_21.jpg", {"POS": ["an sprinkler moistens an grass with a water at a lawn", "an sprinkler moistens an grass with a H2O at a open air", "an sprinkler moistens an grass with a H2O at a lawn"], "NEG": ["an sprinkler moistens an conduit with a H2O at a lawn", "an sprinkler moistens an bathing tub with a H2O at a out-of-doors", "an sprinkler moistens an shampoo with a H2O at a lawn"]}], ["chiseling_210.jpg", {"POS": ["the adult male chisels the stone at the place.", "the man chisels the rock at the inside.", "the adult male chisels the stone at the place."], "NEG": ["the adult male chisels the telephone pole at the place.", "the adult male chisels the olive at the inside.", "the adult male chisels the rag doll at the place."]}], ["painting_101.jpg", {"POS": ["an mortal paints an house with a paintbrush at a house", "an person paints an siding with a brush at a open", "an somebody paints an wall with a paintbrush at a room"], "NEG": ["an mortal paints an grave with a paintbrush at a house", "an soul paints an eyeshadow with a brush at a open", "an person paints an pointer with a paintbrush at a room"]}], ["flinging_200.jpg", {"POS": ["ballplayer flings baseball toward home base using manus in a diamond", "baseball player flings baseball toward ballplayer using mitt in a infield", "hurler flings diamond toward goal using hand in a diamond"], "NEG": ["ballplayer flings deck toward home plate using hand in a infield", "ballplayer flings chocolate toward baseball player using paw in a infield", "pitcher flings camera toward goal using manus in a diamond"]}], ["throwing_223.jpg", {"POS": ["the baseball player throws an baseball towards a ballplayer at a ball field.", "the teen throws an baseball game towards a destination at a field.", "the ballplayer throws an baseball towards a baseball diamond at a infield."], "NEG": ["the ballplayer throws an mesomorphy towards a baseball player at a ball field.", "the teen throws an pickup towards a destination at a field.", "the ballplayer throws an tortoise towards a diamond at a baseball diamond."]}], ["raking_272.jpg", {"POS": ["an adult female rakes an leafage from a terra firma into a agglomerate at a yard", "an woman rakes an soil from a ground into a ground at a outdoors", "an woman rakes an soil from a earth into a dry land at a outside"], "NEG": ["an adult female rakes an meat from a solid ground into a cumulation at a yard", "an adult female rakes an butter from a land into a solid ground at a outdoors", "an adult female rakes an olive oil from a terra firma into a earth at a exterior"]}], ["flinging_281.jpg", {"POS": ["boy flings baseball toward mate using mitt in a baseball field", "male child flings baseball player toward goal using paw in a baseball field", "boy flings baseball toward goal using arm in a diamond"], "NEG": ["male child flings surface-to-air missile toward mate using manus in a diamond", "boy flings pugilist toward goal using hand in a diamond", "male child flings runner toward goal using arm in a diamond"]}], ["packaging_48.jpg", {"POS": ["worker packages video in manufactory", "mill-hand packages computer monitor in manufacturing plant", "woman packages telly in storage warehouse"], "NEG": ["worker packages packet in factory", "factory worker packages banana in manufactory", "woman packages frost in storage warehouse"]}], ["emptying_63.jpg", {"POS": ["an boy empties an scrap from a box into a bag using a manus in a schoolroom", "an boy empties an paper from a box into a plastic bag using a manus in a classroom", "an people empties an paper from a box into a bag using a manus in a interior"], "NEG": ["an male child empties an car part from a box into a bag using a manus in a schoolroom", "an boy empties an knickknack from a box into a plastic bag using a mitt in a schoolroom", "an people empties an window from a box into a bag using a paw in a inside"]}], ["throwing_207.jpg", {"POS": ["the basketball player throws an basketball towards a basketball hoop at a basketball court.", "the girl throws an basketball towards a basketball hoop at a gym.", "the female throws an basketball game towards a basketball game at a arena."], "NEG": ["the basketball player throws an rickshaw towards a basket at a basketball court.", "the miss throws an leash towards a basket at a gymnasium.", "the female throws an street towards a basketball game at a sports stadium."]}], ["gnawing_256.jpg", {"POS": ["an vulture gnaws an plant at a outdoors", "an bird gnaws an item at a tree", "an vulture gnaws an carcass at a outdoors"], "NEG": ["an vulture gnaws an puppy at a outdoors", "an bird gnaws an auto part at a tree", "an vulture gnaws an mane at a out-of-doors"]}], ["colliding_142.jpg", {"POS": ["the car collides with the curb at a street.", "the motorcar collides with the machine at a route.", "the car collides with the item at a out-of-doors."], "NEG": ["the automobile collides with the photographic film at a street.", "the automobile collides with the wallet at a road.", "the machine collides with the napkin at a open."]}], ["clearing_222.jpg", {"POS": ["an somebody clears an branch from a tree using a bulldozer in a outside", "an person clears an tree from a forest using a machinery in a wood", "an agent clears an item from a source using a dozer in a out-of-doors"], "NEG": ["an mortal clears an pellet from a tree using a bulldozer in a exterior", "an someone clears an foam from a woods using a machinery in a wood", "an agent clears an goat from a source using a dozer in a out-of-doors"]}], ["colliding_8.jpg", {"POS": ["the car collides with the pole at a route.", "the auto collides with the item at a street.", "the machine collides with the pole at a street."], "NEG": ["the automobile collides with the shopping cart at a route.", "the machine collides with the brick at a street.", "the machine collides with the sign at a street."]}], ["nipping_164.jpg", {"POS": ["an lizard nips an finger at a open", "an reptilian nips an manus at a open air", "an lizard nips an finger at a place"], "NEG": ["an lizard nips an planet at a out-of-doors", "an reptilian nips an cow at a open", "an lizard nips an pot at a place"]}], ["scooping_38.jpg", {"POS": ["girl is scooping spud from bowl using spoon in room.", "fille is scooping dough from bowl using spoon in kitchen.", "little girl is scooping dough from mixing bowl using spoon in vegetable garden."], "NEG": ["little girl is scooping bead from bowl using spoon in room.", "miss is scooping fluff from bowl using spoon in kitchen.", "little girl is scooping tow truck from mixing bowl using spoon in vegetable garden."]}], ["throwing_260.jpg", {"POS": ["the baseball player throws an baseball towards a ballplayer at a baseball game.", "the baseball player throws an baseball towards a batter at a arena.", "the ballplayer throws an baseball towards a destination at a baseball diamond."], "NEG": ["the baseball player throws an hood towards a baseball player at a baseball.", "the ballplayer throws an icecream towards a batter at a bowl.", "the ballplayer throws an lavender towards a destination at a baseball diamond."]}], ["tripping_140.jpg", {"POS": ["an ice-hockey player trips over an ice-hockey player onto a DESTINATION in a ice hockey rink", "an hockey player trips over an ice-hockey player onto a DESTINATION in a ice-skating rink", "an hockey player trips over an hockey player onto a DESTINATION in a ice"], "NEG": ["an ice-hockey player trips over an school bus onto a DESTINATION in a ice hockey rink", "an hockey player trips over an incline onto a DESTINATION in a ice", "an ice-hockey player trips over an skateboard onto a DESTINATION in a ice-skating rink"]}], ["offering_86.jpg", {"POS": ["individual offers flower to statue at a outdoors", "woman offers flower to statue at a shrine", "individual offers flower to statue at a outdoors"], "NEG": ["somebody offers game to statue at a open air", "adult female offers lamp to statue at a shrine", "mortal offers ignition key to statue at a open air"]}], ["lacing_64.jpg", {"POS": ["man laces boot at a place", "soul laces shoe at a place", "man laces shoe at a place"], "NEG": ["man laces spice at a place", "person laces stairway at a place", "man laces sack at a place"]}], ["potting_161.jpg", {"POS": ["an man pots an plant in a pot at a garage", "an man pots an item in a flowerpot at a garage", "an man pots an flower in a pot at a driveway"], "NEG": ["an adult male pots an pecan in a pot at a garage", "an man pots an ring in a pot at a garage", "an adult male pots an minivan in a pot at a private road"]}], ["sniffing_95.jpg", {"POS": ["an domestic dog sniffs an mark in a room", "an dog sniffs an earth in a edifice", "an domestic dog sniffs an dry land in a room"], "NEG": ["an Canis familiaris sniffs an hair in a room", "an dog sniffs an sax in a edifice", "an dog sniffs an melon in a room"]}], ["flinging_107.jpg", {"POS": ["field general flings football toward goal using hand in a gridiron", "football field flings football toward football player using paw in a gridiron", "quarterback flings football toward teammate using paw in a gridiron"], "NEG": ["quarterback flings fluid toward goal using manus in a gridiron", "football field flings marker toward footballer using mitt in a football field", "quarterback flings pillow toward teammate using manus in a gridiron"]}], ["trimming_130.jpg", {"POS": ["soul is trimming shrubPART of shrub with power tool in out-of-doors.", "pruner is trimming hedgePART of hedge with power tool in open air.", "person is trimming shrubPART of shrub with hedge trimmer in open."], "NEG": ["individual is trimming ax headPART of ax head with power tool in open air.", "pruner is trimming bank billPART of bank bill with power tool in open air.", "individual is trimming compoundPART of compound with hedge trimmer in open."]}], ["punting_110.jpg", {"POS": ["an punter punts a football at a gridiron", "an footballer punts a football at a football field", "an footballer punts a football at a field"], "NEG": ["an punter punts a drilling bit at a football field", "an football player punts a nervus at a gridiron", "an footballer punts a canvass at a athletic field"]}], ["begging_104.jpg", {"POS": ["the dog is begging the giver for bacon in table.", "the domestic dog is begging the giver for bacon in dining room.", "the domestic dog is begging the fry for bacon in table."], "NEG": ["the Canis familiaris is begging the giver for nature in table.", "the domestic dog is begging the giver for string in dining-room.", "the dog is begging the child for doorknocker in table."]}], ["flinging_125.jpg", {"POS": ["twirler flings baseball toward goal using mitt in a hill", "adult male flings ball toward mate using mitt in a football field", "ballplayer flings baseball toward teammate using mitt in a baseball diamond"], "NEG": ["pitcher flings meat toward goal using paw in a mound", "adult male flings makeup toward teammate using mitt in a football field", "ballplayer flings blazer toward mate using hand in a baseball diamond"]}], ["guarding_161.jpg", {"POS": ["an guard guards an edifice with a gun at a edifice", "an police officer guards an gate with a weapon at a outside", "an man guards an base with a gun at a exterior"], "NEG": ["an guard guards an mane with a gun at a edifice", "an police officer guards an dial with a weapon at a outside", "an adult male guards an celebrity with a gun at a outside"]}], ["moistening_159.jpg", {"POS": ["an sprinkler moistens an grass with a water at a open air", "an sprinkler moistens an grass with a H2O at a open", "an sprinkler moistens an grass with a H2O at a exterior"], "NEG": ["an sprinkler moistens an log with a H2O at a open air", "an sprinkler moistens an tyre with a water at a outdoors", "an sprinkler moistens an sculpture with a H2O at a exterior"]}], ["flinging_219.jpg", {"POS": ["baseball player flings baseball player toward mate using hand in a baseball field", "man flings baseball toward mate using paw in a baseball field", "ballplayer flings baseball toward goal using paw in a ball field"], "NEG": ["ballplayer flings food for thought toward teammate using manus in a baseball field", "adult male flings tiger cub toward teammate using mitt in a ball field", "ballplayer flings vitamin toward goal using paw in a diamond"]}], ["drumming_143.jpg", {"POS": ["the young man drums on the cymbal with the drumstick in the room", "the adult male drums on the drum with the drumstick in the room", "the man drums on the membranophone with the drumstick in the interior"], "NEG": ["the young buck drums on the fishhook with the drumstick in the room", "the adult male drums on the cotton with the drumstick in the room", "the adult male drums on the manufactured home with the drumstick in the inside"]}], ["hoisting_293.jpg", {"POS": ["an man hoists an log up from a land using a arm at a woods", "an man hoists an log up from a ground using a arm at a wood", "an adult male hoists an log up from a land using a manus at a wood"], "NEG": ["an man hoists an broom up from a earth using a arm at a wood", "an adult male hoists an furniture up from a ground using a arm at a forest", "an adult male hoists an bulb up from a land using a paw at a woods"]}], ["spitting_74.jpg", {"POS": ["the vocaliser spits an spit on the dry land at a balcony.", "the adult male spits an spittle on the earth at a balcony.", "the adult male spits an spittle on the crowd at a balcony."], "NEG": ["the vocalist spits an ignition key on the ground at a balcony.", "the adult male spits an cuff on the ground at a balcony.", "the adult male spits an shower on the crowd at a balcony."]}], ["dragging_178.jpg", {"POS": ["an adult female drags an exercising weight with a strap on a paving at a roadway", "an adult female drags an weight with a rope on a sleigh at a road", "an adult female drags an weight with a rope on a manus at a street"], "NEG": ["an adult female drags an sharpener with a strap on a paving material at a roadway", "an woman drags an sailing boat with a rope on a sled at a road", "an woman drags an flour with a rope on a hand at a street"]}], ["tasting_252.jpg", {"POS": ["the woman tastes the soup with the ladle in the kitchen", "the adult female tastes the soup with the tongue in the room", "the young lady tastes the soup with the soup ladle in the kitchen"], "NEG": ["the woman tastes the fixing with the ladle in the kitchen", "the adult female tastes the dart with the clapper in the room", "the girl tastes the cow manure with the soup ladle in the kitchen"]}], ["adjusting_161.jpg", {"POS": ["an woman adjusts an harness's tightness using a mitt at a rock climbing", "an woman adjusts an harness's tightening using a manus at a climbing frame", "an woman adjusts an belt's size using a mitt at a room"], "NEG": ["an woman adjusts an leek's tautness using a manus at a rock climbing", "an woman adjusts an calf's tightening using a hand at a climbing frame", "an woman adjusts an wild flower's size using a paw at a room"]}], ["dropping_131.jpg", {"POS": ["an man dropped an football from the grip to the ground at a outdoors", "an adult male dropped an football from the paw to the earth at a field", "an man dropped an football from the manus to the terra firma at a football field"], "NEG": ["an adult male dropped an fork from the handle to the earth at a outdoors", "an adult male dropped an justice from the paw to the earth at a athletic field", "an adult male dropped an lid from the hand to the solid ground at a football field"]}], ["tasting_221.jpg", {"POS": ["the female tastes the H2O with the cup in the table", "the adult male tastes the drink with the cup in the room", "the people tastes the liquid with the cup in the room"], "NEG": ["the female tastes the marking with the cup in the table", "the man tastes the air current with the cup in the room", "the people tastes the terra firma with the cup in the room"]}], ["opening_91.jpg", {"POS": ["the old woman opens the jar with the hand at the place.", "the adult female opens the jar with the napkin at the place.", "the mortal opens the jar with the manus at the place."], "NEG": ["the old woman opens the manure with the mitt at the place.", "the woman opens the sticks and stone with the napkin at the place.", "the individual opens the calamari with the manus at the place."]}], ["sewing_100.jpg", {"POS": ["the person sews the material with the sewing needle in the place", "the soul sews the cloth with the needle in the place", "the individual sews the cloth with the needle in the inside"], "NEG": ["the person sews the squash with the sewing needle in the place", "the someone sews the marble with the needle in the place", "the somebody sews the bonsai with the needle in the interior"]}], ["scooping_167.jpg", {"POS": ["adult female is scooping nutrient from bowl using spoon in kitchen.", "adult female is scooping sauce from bowl using spoon in restaurant.", "adult female is scooping sauce from bowl using spoon in kitchen."], "NEG": ["adult female is scooping camera from bowl using spoon in kitchen.", "adult female is scooping cotton from bowl using spoon in eating place.", "woman is scooping poisonous substance from bowl using spoon in kitchen."]}], ["bouncing_136.jpg", {"POS": ["the volleyball player bounces an volleyball against a manus in volleyball court.", "the player bounces an ball against a floor in basketball court.", "the volleyball player bounces an ball against a paw in gym."], "NEG": ["the volleyball player bounces an town against a mitt in volleyball court.", "the player bounces an essence against a flooring in basketball court.", "the volleyball player bounces an ruin against a hand in gymnasium."]}], ["extinguishing_67.jpg", {"POS": ["the man extinguishes item using fire extinguisher in out-of-doors", "the man extinguishes container using fire extinguisher in open air", "the man extinguishes pan using extinguisher in open air"], "NEG": ["the adult male extinguishes cumulation using extinguisher in open air", "the man extinguishes bear using fire extinguisher in open air", "the man extinguishes plaster using asphyxiator in outdoors"]}], ["carting_170.jpg", {"POS": ["the domestic dog cartes the duo in a dogsled at a field.", "the Canis familiaris cartes the people in a cart at a snow.", "the Eskimo dog cartes the somebody in a sleigh at a snow."], "NEG": ["the dog cartes the wall in a dogsled at a field.", "the domestic dog cartes the soil in a cart at a snow.", "the Eskimo dog cartes the married man in a sled at a snow."]}], ["displaying_260.jpg", {"POS": ["the woman displays the ware to the target using a TOOL at a store.", "the adult female displays the drygoods to the target using a TOOL at a shop.", "the woman displays the artistic production to the audience using a TOOL at a craft fair."], "NEG": ["the woman displays the cocoanut to the target using a TOOL at a shop.", "the woman displays the estate car to the target using a TOOL at a shop.", "the woman displays the frame to the audience using a TOOL at a craft fair."]}], ["ejecting_101.jpg", {"POS": ["an adult male ejects an shell from a shooting iron toward a destination at a place", "an soul ejects an slug from a gun toward a destination at a place", "an mortal ejects an slug from a gun toward a destination at a interior"], "NEG": ["an adult male ejects an pecan from a shooting iron toward a destination at a place", "an person ejects an canvas from a gun toward a destination at a place", "an individual ejects an motortruck from a gun toward a destination at a inside"]}], ["throwing_285.jpg", {"POS": ["the pitcher throws an baseball towards a plate at a sports stadium.", "the ballplayer throws an baseball towards a baseball glove at a infield.", "the pitcher throws an baseball towards a destination at a sports stadium."], "NEG": ["the twirler throws an backhoe towards a home at a arena.", "the ballplayer throws an bag towards a mitt at a diamond.", "the hurler throws an kibble towards a destination at a stadium."]}], ["pasting_211.jpg", {"POS": ["the tiddler used a mucilage to paste an paper to an paper in a room.", "the boy used a bottle to paste an glue to an paper in a place.", "the boy used a mucilage to paste an paper to an paper in a table."], "NEG": ["the child used a mucilage to paste an cheque to an paper in a room.", "the male child used a bottle to paste an trunk to an newspaper in a place.", "the boy used a mucilage to paste an basketball player to an paper in a table."]}], ["guarding_289.jpg", {"POS": ["an man guards an monument with a gun at a open", "an adult male guards an grave with a gun at a exterior", "an adult male guards an item with a gun at a exterior"], "NEG": ["an adult male guards an bonsai with a gun at a open air", "an adult male guards an sea lion with a gun at a exterior", "an adult male guards an Black man with a gun at a outside"]}], ["throwing_229.jpg", {"POS": ["the football player throws an football towards a destination at a football field.", "the football player throws an football towards a footballer at a gridiron.", "the football player throws an footballer towards a destination at a gridiron."], "NEG": ["the football player throws an foot lever towards a destination at a gridiron.", "the footballer throws an carving towards a football player at a gridiron.", "the footballer throws an shower towards a destination at a football field."]}], ["launching_144.jpg", {"POS": ["an mortal launches an pyrotechnic from a dry land toward a air at a open air", "an male child launches an projectile from a earth toward a air at a outdoors", "an male launches an rocket from a pad toward a midair at a open air"], "NEG": ["an individual launches an gymnast from a land toward a air at a out-of-doors", "an boy launches an scale from a solid ground toward a air at a outdoors", "an male launches an crowd from a launch pad toward a midair at a out-of-doors"]}], ["flinging_11.jpg", {"POS": ["someone flings stone toward goal using arm in a open", "boy flings item toward devastation using mitt in a street", "adult male flings stone toward rock using manus in a town"], "NEG": ["somebody flings flesh wound toward goal using arm in a outdoors", "boy flings profit toward destruction using paw in a street", "man flings justice toward rock using manus in a town"]}], ["prying_106.jpg", {"POS": ["the Black man pries the window from the window frame using a wrecking bar at a house", "the adult male pries the window from the wall using a pry bar at a open", "the adult male pries the window from the wall using a wrecking bar at a open"], "NEG": ["the Black man pries the cymbal from the window frame using a wrecking bar at a house", "the adult male pries the os from the wall using a pry bar at a open air", "the man pries the written document from the wall using a pry bar at a open"]}], ["mashing_175.jpg", {"POS": ["an nipper mashes an banana with a masher in a inside", "an tyke mashes an banana with a tool in a kitchen", "an boy mashes an Irish potato with a masher in a bowl"], "NEG": ["an small fry mashes an fastener with a masher in a interior", "an tiddler mashes an President of the United States with a tool in a kitchen", "an boy mashes an mill with a masher in a bowl"]}], ["flinging_134.jpg", {"POS": ["twirler flings baseball toward backstop using manus in a diamond", "adult male flings baseball toward goal using paw in a baseball", "man flings baseball game toward strikeout using manus in a baseball field"], "NEG": ["hurler flings ball toward catcher using manus in a diamond", "adult male flings pair toward goal using manus in a baseball", "man flings gridiron toward strikeout using hand in a baseball field"]}], ["aiming_91.jpg", {"POS": ["an hurler aims an baseball at a target in a baseball field", "an baseball player aims an baseball at a slugger in a diamond", "an twirler aims an baseball at a target in a baseball diamond"], "NEG": ["an twirler aims an wad at a target in a diamond", "an baseball player aims an hook at a hitter in a infield", "an hurler aims an cheque at a target in a diamond"]}], ["foraging_51.jpg", {"POS": ["the otter forages for fish in water", "the agent forages for fish in river", "the otter forages for fish in river"], "NEG": ["the otter forages for key in body of water", "the agent forages for balefire in river", "the otter forages for spaghetti in river"]}], ["shelving_145.jpg", {"POS": ["the lass shelves an book on a bookshelf in library.", "the adult female shelves an book on a shelf in place.", "the female child shelves an book on a bookshelf in library."], "NEG": ["the jeune fille shelves an denim on a bookshelf in library.", "the woman shelves an tuition fee on a shelf in place.", "the female child shelves an Sun on a bookshelf in library."]}], ["dropping_255.jpg", {"POS": ["an hurler dropped an baseball from the hand to the end at a diamond", "an twirler dropped an baseball from the manus to the end at a diamond", "an man dropped an baseball from the manus to the earth at a field"], "NEG": ["an hurler dropped an candy from the paw to the end at a ball field", "an pitcher dropped an hedgerow from the mitt to the end at a baseball field", "an man dropped an cocktail from the manus to the solid ground at a field"]}], ["dragging_281.jpg", {"POS": ["an woman drags an child with a leash on a sled at a place", "an adult female drags an sledge with a hand on a rope at a open", "an woman drags an sled with a rope on a snow at a outside"], "NEG": ["an adult female drags an mill with a leash on a sled at a place", "an adult female drags an fascia with a manus on a rope at a open air", "an woman drags an U-boat with a rope on a snow at a exterior"]}], ["buttering_158.jpg", {"POS": ["an adult female butters an breadstuff using a knife in a place", "an adult female butters an breadstuff using a knife in a table", "an adult female butters an bread using a knife in a place"], "NEG": ["an woman butters an cross-dresser using a knife in a place", "an woman butters an bangle using a knife in a table", "an adult female butters an stretcher using a knife in a place"]}], ["tripping_142.jpg", {"POS": ["an man trips over an dog onto a DESTINATION in a sidewalk", "an man trips over an Canis familiaris onto a DESTINATION in a solid ground", "an adult male trips over an Canis familiaris onto a DESTINATION in a exterior"], "NEG": ["an adult male trips over an soap bubble onto a DESTINATION in a pavement", "an adult male trips over an buttock onto a DESTINATION in a land", "an man trips over an lioness onto a DESTINATION in a outside"]}], ["resting_257.jpg", {"POS": ["the female rests physical structure on sofa in room", "the adult female rests manus on forehead in daybed", "the adult female rests paw on caput in inside"], "NEG": ["the female rests weight on couch in room", "the adult female rests batter on brow in daybed", "the woman rests chessboard on head in inside"]}], ["dragging_266.jpg", {"POS": ["an domestic dog drags an item with a harness on a contact at a place", "an dog drags an cart with a harness on a gravel at a outside", "an domestic dog drags an tire with a rope on a domestic dog at a exterior"], "NEG": ["an domestic dog drags an vino with a harness on a contact at a place", "an domestic dog drags an coconut meat with a harness on a crushed rock at a exterior", "an dog drags an instant coffee with a rope on a Canis familiaris at a outside"]}], ["unloading_82.jpg", {"POS": ["an man unloads an crate from a truck bed using a mitt at a open air", "an crane unloads an railroad train from a motortruck using a crane at a outside", "an people unloads an paper from a source using a conveyor at a warehouse"], "NEG": ["an man unloads an cotton from a truck bed using a paw at a out-of-doors", "an crane unloads an trench from a motortruck using a crane at a exterior", "an people unloads an crotch from a source using a conveyor belt at a warehouse"]}]]