[["plunging_16.jpg", {"POS": ["an man plunges a plunged (when different than the man) into a crowd at a baseball", "an people plunges a man (when different than the people) into a diamond at a stadium", "an man plunges a plunged (when different than the man) into a destination at a arena"], "NEG": ["an man plunges a plunged (when different than the man) into a landing gear at a baseball game", "an people plunges a man (when different than the people) into a attack aircraft carrier at a bowl", "an man plunges a plunged (when different than the man) into a roof at a sports stadium"]}], ["throwing_259.jpg", {"POS": ["the woman throws an ball towards a air at a field.", "the rugby football throws an rugby ball towards a rugby football at a field.", "the person throws an rugby ball towards a destination at a field."], "NEG": ["the adult female throws an ball towards a bookshelf at a athletic field.", "the rugby football throws an rugby ball towards a vein at a field.", "the individual throws an rugby ball towards a stack at a field."]}], ["slipping_44.jpg", {"POS": ["an man slips onto a ground at a room", "an man slips onto a flooring at a studio", "an man slips onto a flooring at a interior"], "NEG": ["an man slips onto a row at a room", "an adult male slips onto a tomb at a studio", "an man slips onto a dish at a inside"]}], ["putting_67.jpg", {"POS": ["an man puts an seatbelt into a thorax in a auto", "an man puts an seat belt into a physical structure in a auto", "an man puts an seat belt into a body in a machine"], "NEG": ["an adult male puts an seatbelt into a pastry in a motorcar", "an man puts an seatbelt into a block in a machine", "an man puts an seatbelt into a coat in a car"]}], ["leaping_11.jpg", {"POS": ["the woman leaps from the land over/through an obstacle to the solid ground in the beach", "the adult female leaps from the sand over/through an sand to the sand in the beach", "the woman leaps from the earth over/through an obstacle to the earth in the beach"], "NEG": ["the adult female leaps from the earth over/through an obstacle to the block in the beach", "the woman leaps from the sand over/through an sand to the microscope in the beach", "the woman leaps from the solid ground over/through an obstacle to the gym mat in the beach"]}], ["fetching_243.jpg", {"POS": ["the someone fetches the H2O from puddle and brings it to family, in open.", "the man fetches the water from water and brings it to terra firma, in riverbank.", "the somebody fetches the H2O from puddle and brings it to washbasin, in dirt."], "NEG": ["the individual fetches the water from puddle and brings it to computer, in outdoors.", "the adult male fetches the H2O from body of water and brings it to compost pile, in riverbank.", "the individual fetches the water from pool and brings it to woods, in dirt."]}], ["pouring_29.jpg", {"POS": ["an adult male pours a hard liquor from a bottle to a glass with a manus in a inside", "an adult male pours a liquor from a bottle to a shot glass with a paw in a kitchen", "an adult male pours a intoxicant from a bottle to a glass with a mitt in a place"], "NEG": ["an adult male pours a booze from a bottle to a rooftop with a paw in a interior", "an adult male pours a John Barleycorn from a bottle to a knee joint with a hand in a kitchen", "an adult male pours a alcohol from a bottle to a floor with a hand in a place"]}], ["stumbling_104.jpg", {"POS": ["an runner stumbles onto a dry land at a racetrack", "an runner stumbles onto a ground at a racecourse", "an adult male stumbles onto a track at a running"], "NEG": ["an runner stumbles onto a rabbit at a racecourse", "an runner stumbles onto a microwave oven at a racecourse", "an adult male stumbles onto a tum at a track"]}], ["attaching_19.jpg", {"POS": ["an craftsman attaches a piece to a instrument with adhesive agent using a mitt at a work table", "an paw attaches a guitar to a destination with wire using a hand at a place", "an agent attaches a bridge to a violoncello with glue using a mitt at a place"], "NEG": ["an crafter attaches a piece to a hoop with adhesive agent using a paw at a work table", "an paw attaches a guitar to a grate with wire using a paw at a place", "an agent attaches a bridge to a bed with glue using a mitt at a place"]}], ["jumping_255.jpg", {"POS": ["an bobcat jumps from a rock over/through an obstacle (excluding the air) and will end up at a stone at a river", "an mountain lion jumps from a stone over/through an rock (excluding the air) and will end up at a rock at a lake", "an bay lynx jumps from a stone over/through an river (excluding the air) and will end up at a rock at a outdoors"], "NEG": ["an bay lynx jumps from a stone over/through an obstacle (excluding the air) and will end up at a sea at a river", "an mountain lion jumps from a rock over/through an rock (excluding the air) and will end up at a mat at a lake", "an Lynx rufus jumps from a stone over/through an river (excluding the air) and will end up at a stomach at a open air"]}], ["ejecting_157.jpg", {"POS": ["an jet plane ejects an airplane pilot from a cockpit toward a sky at a open air", "an jet plane ejects an soul from a source toward a sky at a out-of-doors", "an man ejects an adult male from a plane toward a sky at a outdoors"], "NEG": ["an jet plane ejects an airplane pilot from a cockpit toward a dish washer at a open", "an jet-propelled plane ejects an somebody from a source toward a running at a open air", "an adult male ejects an adult male from a aeroplane toward a cabinet at a outdoors"]}], ["spraying_302.jpg", {"POS": ["an adult male sprays a paint onto a vase from a tin using a TOOL in a interior", "an man sprays a paint onto a clayware from a spray using a TOOL in a shop", "an adult male sprays a paint onto a vase from a spray gun using a TOOL in a studio"], "NEG": ["an adult male sprays a paint onto a waterfall from a tin using a TOOL in a interior", "an man sprays a pigment onto a drum from a nebuliser using a TOOL in a shop", "an man sprays a paint onto a supercilium from a spray gun using a TOOL in a studio"]}], ["plunging_46.jpg", {"POS": ["an people plunges a plunged (when different than the people) into a body of water at a open air", "an people plunges a plunged (when different than the people) into a water at a sea", "an people plunges a individual (when different than the people) into a water at a lake"], "NEG": ["an people plunges a plunged (when different than the people) into a goalkeeper at a open air", "an people plunges a plunged (when different than the people) into a space at a sea", "an people plunges a somebody (when different than the people) into a police officer at a lake"]}], ["fastening_95.jpg", {"POS": ["an somebody fastens an drywall into a ceiling with a screw using a drill at a building", "an somebody fastens an item into a ceiling with a screw using a drill at a interior", "an person fastens an hole into a ceiling with a connector using a drill at a inside"], "NEG": ["an somebody fastens an wallboard into a buff with a screw using a drill at a edifice", "an soul fastens an item into a motorcycle with a screw using a drill at a inside", "an mortal fastens an hole into a pavement with a connector using a drill at a inside"]}], ["taping_233.jpg", {"POS": ["an someone tapes an item to a destination at a place", "an mortal tapes an plastic to a wall at a interior", "an someone tapes an tape to a plastic at a place"], "NEG": ["an someone tapes an item to a cornerstone at a place", "an mortal tapes an plastic to a target at a interior", "an someone tapes an tape to a ring at a place"]}], ["pumping_127.jpg", {"POS": ["an woman pumps a water from a well to a pail using a water pump at a open", "an adult female pumps a H2O from a ground to a pail using a pump at a open air", "an woman pumps a H2O from a land to a bucket using a pump at a exterior"], "NEG": ["an adult female pumps a H2O from a well to a fish using a water pump at a open", "an adult female pumps a H2O from a dry land to a posterboard using a pump at a out-of-doors", "an adult female pumps a H2O from a terra firma to a hook using a pump at a exterior"]}], ["jumping_24.jpg", {"POS": ["an adult female jumps from a soil over/through an obstacle (excluding the air) and will end up at a soil at a open", "an adult female jumps from a solid ground over/through an obstacle (excluding the air) and will end up at a air at a field", "an adult female jumps from a terra firma over/through an obstacle (excluding the air) and will end up at a land at a outside"], "NEG": ["an woman jumps from a soil over/through an obstacle (excluding the air) and will end up at a plot of ground at a open air", "an woman jumps from a ground over/through an obstacle (excluding the air) and will end up at a sidewalk at a field", "an woman jumps from a dry land over/through an obstacle (excluding the air) and will end up at a carrier at a exterior"]}], ["throwing_207.jpg", {"POS": ["the basketball player throws an basketball towards a basketball hoop at a basketball court.", "the girl throws an basketball towards a basketball hoop at a gym.", "the female throws an basketball game towards a basketball game at a arena."], "NEG": ["the cager throws an basketball towards a tongs at a basketball court.", "the missy throws an basketball towards a grip at a gym.", "the female throws an basketball game towards a sewage works at a stadium."]}], ["strapping_145.jpg", {"POS": ["an adult female straps the miss into a seat using a seat belt at a auto", "an mother straps the child into a car seat using a seatbelt at a auto", "an mother straps the girl into a car seat using a seat belt at a motorcar"], "NEG": ["an adult female straps the miss into a stairway using a seatbelt at a auto", "an female parent straps the tiddler into a centrifuge using a seatbelt at a motorcar", "an mother straps the girl into a barn using a seat belt at a motorcar"]}], ["sliding_244.jpg", {"POS": ["the ballplayer slides the slider (when different from the ballplayer) on a ground to a stand at a field.", "the baseball player slides the slider (when different from the baseball player) on a earth to a base at a diamond.", "the ballplayer slides the slider (when different from the ballplayer) on a earth to a home plate at a baseball diamond."], "NEG": ["the baseball player slides the slider (when different from the baseball player) on a earth to a building at a field.", "the baseball player slides the slider (when different from the baseball player) on a terra firma to a steak at a ball field.", "the baseball player slides the slider (when different from the baseball player) on a earth to a suitcase at a infield."]}], ["milking_204.jpg", {"POS": ["an adult female milks a moo-cow with a paw into a pail in a open", "an adult female milks a moo-cow with a hand into a bucket in a outdoors", "an adult female milks a moo-cow with a hand into a bucket in a out-of-doors"], "NEG": ["an adult female milks a cow with a mitt into a cup in a open", "an woman milks a cow with a manus into a cup in a out-of-doors", "an woman milks a moo-cow with a hand into a infinite in a open air"]}], ["spilling_40.jpg", {"POS": ["an little girl spills a cream from a ewer onto a table at a room", "an miss spills a milk from a cup onto a table at a interior", "an girl spills a milk from a cup onto a table at a interior"], "NEG": ["an little girl spills a cream from a pitcher onto a litter at a room", "an young lady spills a milk from a cup onto a drum at a interior", "an female child spills a milk from a cup onto a place at a interior"]}], ["deflecting_96.jpg", {"POS": ["the goalkeeper deflected the hockey puck to the net at the ice.", "the netkeeper deflected the hockey puck to the destination at the ice-hockey rink.", "the goaltender deflected the hockey stick to the glove at the ice hockey rink."], "NEG": ["the goaltender deflected the hockey puck to the coaster at the ice.", "the goalkeeper deflected the hockey puck to the left at the ice hockey rink.", "the netkeeper deflected the hockey stick to the dishwasher at the ice hockey rink."]}], ["leaping_139.jpg", {"POS": ["the fish leaps from the body of water over/through an obstacle to the body of water in the ocean", "the fish leaps from the water over/through an obstacle to the water in the open air", "the fish leaps from the body of water over/through an obstacle to the body of water in the outdoors"], "NEG": ["the fish leaps from the water over/through an obstacle to the swoop in the ocean", "the fish leaps from the water over/through an obstacle to the desktop in the out-of-doors", "the fish leaps from the body of water over/through an obstacle to the ocean in the open air"]}], ["splashing_188.jpg", {"POS": ["an nipper splashes a lake with a H2O using a paw in a outside", "an miss splashes a destination with a water using a tool in a lake", "an miss splashes a body with a water using a body in a pool"], "NEG": ["an tyke splashes a side with a H2O using a paw in a outside", "an girl splashes a solid food with a water using a tool in a lake", "an missy splashes a burial site with a H2O using a organic structure in a pool"]}], ["emptying_140.jpg", {"POS": ["an fry empties an water from a cup into a pail using a hand in a open", "an girl empties an water from a flowerpot into a pail using a paw in a open air", "an fry empties an water from a pot into a bucket using a paw in a backyard"], "NEG": ["an small fry empties an water from a cup into a cask using a hand in a open", "an female child empties an H2O from a pot into a runway using a paw in a open air", "an nipper empties an water from a pot into a unknown region using a manus in a backyard"]}], ["emptying_107.jpg", {"POS": ["an adult female empties an water from a pail into a pail using a mitt in a place", "an adult female empties an water from a pail into a destination using a hand in a place", "an old woman empties an H2O from a pail into a bucket using a hand in a place"], "NEG": ["an adult female empties an H2O from a bucket into a rod using a mitt in a place", "an adult female empties an H2O from a bucket into a exterior using a paw in a place", "an old woman empties an water from a pail into a sewer system using a manus in a place"]}], ["splashing_81.jpg", {"POS": ["an little girl splashes a H2O with a H2O using a tool in a exterior", "an small fry splashes a destination with a water using a physical structure in a body of water", "an tyke splashes a water with a H2O using a mitt in a outside"], "NEG": ["an little girl splashes a sheet metal with a H2O using a tool in a exterior", "an small fry splashes a animal with a water using a organic structure in a body of water", "an minor splashes a plywood with a water using a mitt in a outside"]}], ["sliding_31.jpg", {"POS": ["the adult male slides the man (when different from the adult male) on a land to a destination at a stadium.", "the baseball player slides the slider (when different from the baseball player) on a ground to a foundation at a athletic field.", "the baseball player slides the ballplayer (when different from the baseball player) on a sand to a home plate at a baseball."], "NEG": ["the man slides the man (when different from the man) on a solid ground to a bucket at a bowl.", "the ballplayer slides the slider (when different from the ballplayer) on a ground to a hoof at a playing field.", "the ballplayer slides the baseball player (when different from the ballplayer) on a sand to a fuselage at a baseball."]}], ["slipping_177.jpg", {"POS": ["an runner slips onto a human face at a track", "an jock slips onto a dry land at a track", "an athlete slips onto a track at a outside"], "NEG": ["an runner slips onto a sports jacket at a path", "an jock slips onto a lid at a track", "an jock slips onto a phonograph recording at a exterior"]}], ["shelving_248.jpg", {"POS": ["the adult female shelves an binder on a bookshelf in business office.", "the woman shelves an folder on a shelf in room.", "the woman shelves an leaflet on a shelf in place."], "NEG": ["the woman shelves an binder on a wrapping in business office.", "the woman shelves an folder on a pipe in room.", "the woman shelves an booklet on a modem in place."]}], ["spraying_52.jpg", {"POS": ["an paw sprays a pigment onto a wall from a can using a TOOL in a inside", "an creative person sprays a paint onto a wall from a bottle using a TOOL in a place", "an soul sprays a pigment onto a wall from a bottle using a TOOL in a outdoors"], "NEG": ["an hand sprays a paint onto a rugger from a tin using a TOOL in a interior", "an artist sprays a paint onto a chain from a bottle using a TOOL in a place", "an soul sprays a pigment onto a coiffure from a bottle using a TOOL in a outdoors"]}], ["stumbling_52.jpg", {"POS": ["an jock stumbles onto a grass at a arena", "an adult male stumbles onto a ground at a playing field", "an soccer player stumbles onto a terra firma at a field"], "NEG": ["an jock stumbles onto a wedding dress at a sports stadium", "an adult male stumbles onto a Xerox at a playing area", "an soccer player stumbles onto a pie shell at a athletic field"]}], ["sliding_226.jpg", {"POS": ["the ballplayer slides the slider (when different from the ballplayer) on a surface to a destination at a place.", "the tike slides the slider (when different from the tike) on a land to a home plate at a place.", "the ballplayer slides the slider (when different from the ballplayer) on a dry land to a base at a diamond."], "NEG": ["the ballplayer slides the slider (when different from the ballplayer) on a surface to a ring at a place.", "the nestling slides the slider (when different from the nestling) on a land to a painting at a place.", "the baseball player slides the slider (when different from the baseball player) on a land to a kitchen table at a diamond."]}], ["pouncing_185.jpg", {"POS": ["an Acinonyx jubatus pounces onto the grass at a outside", "an cheetah pounces onto the fair game at a field", "an Acinonyx jubatus pounces onto the destination at a grass"], "NEG": ["an Acinonyx jubatus pounces onto the crochet stitch at a exterior", "an chetah pounces onto the path at a field", "an chetah pounces onto the bow at a grass"]}], ["parachuting_166.jpg", {"POS": ["the people suit of clothesd using a suit of clothes to the field at the sky.", "the people parachuted using a parachute to the solid ground at the sky.", "the people parachuted using a parachute to the destination at the sky."], "NEG": ["the people suitd using a suit to the base at the sky.", "the people chuted using a chute to the beaker at the sky.", "the people parachuted using a parachute to the cushion at the sky."]}], ["pooing_224.jpg", {"POS": ["bear poos onto a solid ground at a woods", "bear poos onto a terra firma at a outdoors", "bear poos onto a land at a forest"], "NEG": ["bear poos onto a bottle at a forest", "bear poos onto a door at a open", "bear poos onto a privy at a woods"]}], ["leaping_72.jpg", {"POS": ["the true cat leaps from the counter over/through an obstacle to the table in the kitchen", "the true cat leaps from the countertop over/through an obstacle to the table in the kitchen", "the cat leaps from the countertop over/through an obstacle to the countertop in the kitchen"], "NEG": ["the true cat leaps from the counter over/through an obstacle to the net in the kitchen", "the cat leaps from the countertop over/through an obstacle to the stack in the kitchen", "the cat leaps from the countertop over/through an obstacle to the balloon in the kitchen"]}], ["sliding_109.jpg", {"POS": ["the baseball player slides the slider (when different from the baseball player) on a land to a bag at a ball field.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home base at a baseball.", "the adult male slides the slider (when different from the adult male) on a soil to a home plate at a ball field."], "NEG": ["the ballplayer slides the slider (when different from the ballplayer) on a ground to a ring at a baseball field.", "the baseball player slides the slider (when different from the baseball player) on a sand to a babe at a baseball.", "the man slides the slider (when different from the man) on a soil to a tin at a diamond."]}], ["plunging_84.jpg", {"POS": ["an man plunges a plunged (when different than the man) into a destination at a place", "an worker plunges a paw (when different than the worker) into a keyboard at a room", "an adult male plunges a finger (when different than the adult male) into a keyboard at a business office"], "NEG": ["an adult male plunges a plunged (when different than the adult male) into a piggy bank at a place", "an worker plunges a mitt (when different than the worker) into a plot of ground at a room", "an adult male plunges a finger (when different than the adult male) into a map at a office"]}], ["milking_122.jpg", {"POS": ["an adult female milks a caprine animal with a milking machine into a container in a barn", "an woman milks a cow with a milking machine into a container in a barn", "an adult female milks a caprine animal with a hand into a pail in a barn"], "NEG": ["an adult female milks a caprine animal with a milking machine into a fox in a barn", "an adult female milks a moo-cow with a milking machine into a instrument in a barn", "an adult female milks a goat with a paw into a rod in a barn"]}], ["emptying_103.jpg", {"POS": ["an woman empties an H2O from a pail into a terra firma using a hand in a place", "an woman empties an item from a pail into a destination using a mitt in a place", "an adult female empties an bucket from a pail into a dry land using a paw in a outside"], "NEG": ["an adult female empties an H2O from a pail into a rubbish using a paw in a place", "an adult female empties an item from a bucket into a lamb using a mitt in a place", "an woman empties an pail from a pail into a wire using a manus in a exterior"]}], ["parachuting_112.jpg", {"POS": ["the people parachuted using a parachute to the land at the sky.", "the people suitd using a suit to the field at the sky.", "the people parachuted using a parachute to the dry land at the sky."], "NEG": ["the people parachuted using a parachute to the cat box at the sky.", "the people suit of clothesd using a suit of clothes to the tee at the sky.", "the people parachuted using a parachute to the water bottle at the sky."]}], ["leaking_26.jpg", {"POS": ["a water leaks from a tobacco pipe onto/into a dry land at a hole", "a water leaks from a pipage onto/into a solid ground at a out-of-doors", "a water leaks from a pipe onto/into a destination at a outside"], "NEG": ["a water leaks from a tobacco pipe onto/into a blazer at a hole", "a water leaks from a pipage onto/into a lawn at a out-of-doors", "a water leaks from a piping onto/into a filling at a outside"]}], ["jumping_74.jpg", {"POS": ["an boy jumps from a dry land over/through an obstacle (excluding the air) and will end up at a dry land at a open air", "an male child jumps from a terra firma over/through an flower (excluding the air) and will end up at a solid ground at a outside", "an male child jumps from a soil over/through an pinwheel wind collector (excluding the air) and will end up at a soil at a out-of-doors"], "NEG": ["an male child jumps from a terra firma over/through an obstacle (excluding the air) and will end up at a male at a open", "an male child jumps from a land over/through an flower (excluding the air) and will end up at a crowd at a exterior", "an male child jumps from a soil over/through an pinwheel wind collector (excluding the air) and will end up at a fastener at a outdoors"]}]]