[["pouring_212.jpg", {"POS": ["an agent pours a substance from a source to a destination with a mitt in a inside", "an adult male pours a tea from a teapot to a glass with a paw in a outdoors", "an adult male pours a coffee from a coffeepot to a drinking glass with a mitt in a open air"], "NEG": ["an agent pours a substance from a source to a pizza with a mitt in a interior", "an adult male pours a tea from a teapot to a handbasket with a hand in a outdoors", "an adult male pours a coffee from a coffeepot to a canful with a hand in a open air"]}], ["placing_263.jpg", {"POS": ["people placed flower arrangement in table along ALREADYflower arrangement in exterior", "individual placed bouquet in table along ALREADYbouquet in place", "people placed nutrient in table along ALREADYnutrient in interior"], "NEG": ["people placed floral arrangement in people along ALREADYfloral arrangement in outside", "person placed posy in cheetah along ALREADYposy in place", "people placed food in pepper along ALREADYfood in inside"]}], ["splashing_204.jpg", {"POS": ["an woman splashes a destination with a H2O using a hair in a ocean", "an adult female splashes a lake with a H2O using a hair in a outside", "an adult female splashes a physique with a H2O using a adult female in a beach"], "NEG": ["an woman splashes a rodent with a H2O using a hair in a ocean", "an woman splashes a dashboard with a water using a hair in a outside", "an adult female splashes a proprietor with a H2O using a adult female in a beach"]}], ["sprinkling_113.jpg", {"POS": ["an chef sprinkles an herb from a dish onto a nutrient at a kitchen", "an cook sprinkles an nutrient from a paw onto a food at a kitchen", "an soul sprinkles an nut from a finger onto a pastry at a tabular array"], "NEG": ["an chef sprinkles an herb from a dish onto a flowerpot at a kitchen", "an cook sprinkles an food from a paw onto a tube at a kitchen", "an someone sprinkles an nut from a finger onto a crochet stitch at a tabular array"]}], ["loading_6.jpg", {"POS": ["the man loads a aeroplane with an traveling bag using a machine at a aerodrome.", "the worker loads a airplane with an baggage using a hand at a airdrome.", "the worker loads a aeroplane with an baggage using a conveyor belt at a aerodrome."], "NEG": ["the man loads a prey with an traveling bag using a machine at a aerodrome.", "the worker loads a field with an baggage using a manus at a airdrome.", "the worker loads a pectus with an luggage using a conveyer belt at a airdrome."]}], ["shelving_74.jpg", {"POS": ["the worker shelves an book on a bookshelf in library.", "the people shelves an book on a shelf in library.", "the adult female shelves an book on a shelf in library."], "NEG": ["the worker shelves an book on a wad in library.", "the people shelves an book on a cockpit in library.", "the adult female shelves an book on a Dumpster in library."]}], ["shelving_99.jpg", {"POS": ["the woman shelves an book on a bookshelf in library.", "the librarian shelves an book on a bookshelf in library.", "the adult female shelves an book on a shelf in room."], "NEG": ["the woman shelves an book on a test tube in library.", "the bibliothec shelves an book on a hanger in library.", "the adult female shelves an book on a cheek in room."]}], ["slipping_136.jpg", {"POS": ["an adult female slips onto a flooring at a interior", "an adult female slips onto a floor at a building", "an woman slips onto a tile at a shopping mall"], "NEG": ["an adult female slips onto a refrigeration system at a interior", "an adult female slips onto a clay at a edifice", "an woman slips onto a drink at a shopping center"]}], ["shelving_80.jpg", {"POS": ["the man shelves an box on a shelf in entrepot.", "the adult male shelves an box on a shelf in place.", "the worker shelves an box on a shelf in warehouse."], "NEG": ["the adult male shelves an box on a beard in depot.", "the man shelves an box on a tree in place.", "the worker shelves an box on a pastry in storage warehouse."]}], ["putting_126.jpg", {"POS": ["an adult female puts an lip rouge into a lip in a bedchamber", "an woman puts an lip rouge into a lip in a inside", "an woman puts an lip rouge into a lip in a table"], "NEG": ["an adult female puts an lipstick into a soccer player in a chamber", "an woman puts an lipstick into a tyre in a interior", "an adult female puts an lipstick into a plot of land in a table"]}], ["placing_19.jpg", {"POS": ["graybeard placed compost in compost heap along ALREADYcompost in garden", "adult male placed weed in ashbin along ALREADYweed in vegetable garden", "Methuselah placed plant material in compost heap along ALREADYplant material in garden"], "NEG": ["old man placed compost in hoops along ALREADYcompost in garden", "man placed weed in ice along ALREADYweed in vegetable patch", "greybeard placed plant substance in dishwater along ALREADYplant substance in garden"]}], ["milking_22.jpg", {"POS": ["an dairymaid milks a cow with a mitt into a cup in a farmyard", "an adult female milks a cow with a mitt into a cup in a open air", "an woman milks a moo-cow with a manus into a bucket in a exterior"], "NEG": ["an dairymaid milks a cow with a paw into a target in a farmyard", "an adult female milks a cow with a manus into a Asiatic buffalo in a open air", "an woman milks a moo-cow with a hand into a ball in a exterior"]}], ["milking_174.jpg", {"POS": ["an adult female milks a cow with a milking machine into a container in a farm", "an adult female milks a moo-cow with a milking machine into a container in a open", "an adult female milks a cow with a mitt into a bucket in a dairy"], "NEG": ["an adult female milks a cow with a milking machine into a asphalt in a farm", "an adult female milks a moo-cow with a milking machine into a Xerox machine in a outdoors", "an woman milks a moo-cow with a manus into a outer space in a dairy"]}], ["sprinkling_117.jpg", {"POS": ["an chef sprinkles an herb from a source onto a food at a kitchen", "an cook sprinkles an spice from a mitt onto a meat at a kitchen", "an someone sprinkles an flavoring from a paw onto a cooking pan at a kitchen"], "NEG": ["an chef sprinkles an herb from a source onto a crop at a kitchen", "an cook sprinkles an spice from a mitt onto a slideway at a kitchen", "an somebody sprinkles an flavouring from a manus onto a fox at a kitchen"]}], ["raking_5.jpg", {"POS": ["an adult male rakes an dirt from a dry land into a destination at a outside", "an adult male rakes an weed from a stain into a sidewalk at a grounds", "an man rakes an soil from a earth into a terra firma at a curtilage"], "NEG": ["an adult male rakes an dirt from a ground into a straw at a exterior", "an man rakes an weed from a grime into a desert at a yard", "an adult male rakes an dirt from a dry land into a racecourse at a yard"]}], ["filling_218.jpg", {"POS": ["boy fills container with juice from container at a interior", "male child fills pitcher with liquid from cup at a inside", "male child fills ewer with liquid from ewer at a inside"], "NEG": ["boy fills runway with juice from container at a inside", "male child fills balloon with liquid from cup at a inside", "male child fills gym mat with liquid from ewer at a interior"]}], ["emptying_29.jpg", {"POS": ["an individual empties an dust from a vacuum into a ash-bin using a paw in a place", "an soul empties an dust from a vacuum into a pail using a hand in a place", "an individual empties an dust from a container into a destination using a manus in a place"], "NEG": ["an someone empties an dust from a vacuum into a basketball using a paw in a place", "an individual empties an dust from a vacuum into a farm using a mitt in a place", "an somebody empties an dust from a container into a cumulation using a mitt in a place"]}], ["emptying_55.jpg", {"POS": ["an adult female empties an coin from a jar into a hand using a manus in a place", "an woman empties an coin from a jar into a paw using a manus in a place", "an adult female empties an coin from a jar into a manus using a paw in a place"], "NEG": ["an adult female empties an coin from a jar into a garbage using a hand in a place", "an woman empties an coin from a jar into a canful using a hand in a place", "an woman empties an coin from a jar into a patch using a hand in a place"]}], ["putting_242.jpg", {"POS": ["an Black man puts an hand into a water in a out-of-doors", "an man puts an hand into a water in a out-of-doors", "an man puts an H2O into a earth in a open"], "NEG": ["an Black man puts an mitt into a chute in a out-of-doors", "an man puts an mitt into a hill in a out-of-doors", "an man puts an H2O into a stage set in a open"]}], ["emptying_173.jpg", {"POS": ["an somebody empties an compost from a drum into a deck using a rake in a farm", "an mortal empties an dirt from a barrel into a ground using a shovel in a open air", "an soul empties an soil from a pail into a trailer using a shovel in a open air"], "NEG": ["an someone empties an compost from a barrel into a cupcake using a rake in a farm", "an mortal empties an soil from a barrel into a muzzle using a shovel in a outdoors", "an someone empties an dirt from a bucket into a trunk using a shovel in a out-of-doors"]}], ["plunging_146.jpg", {"POS": ["an adult male plunges a physical structure (when different than the adult male) into a H2O at a lake", "an adult male plunges a physical structure (when different than the adult male) into a H2O at a lake", "an someone plunges a plunged (when different than the someone) into a H2O at a lake"], "NEG": ["an adult male plunges a organic structure (when different than the adult male) into a true cat at a lake", "an adult male plunges a organic structure (when different than the adult male) into a wheel at a lake", "an person plunges a plunged (when different than the person) into a coffin at a lake"]}], ["landing_207.jpg", {"POS": ["parachuter lands on a ground at a field", "adult male lands on a land at a field", "parachuter lands on a dry land at a outdoors"], "NEG": ["parachute jumper lands on a motor at a field", "man lands on a rag at a field", "parachute jumper lands on a coconut meat at a out-of-doors"]}], ["landing_51.jpg", {"POS": ["plane lands on a runway at a drome", "airplane lands on a runway at a aerodrome", "airplane lands on a runway at a airdrome"], "NEG": ["aeroplane lands on a basketeer at a aerodrome", "airplane lands on a body of water at a drome", "plane lands on a laptop at a airdrome"]}], ["deflecting_82.jpg", {"POS": ["the goaltender deflected the hockey puck to the goal at the ice rink.", "the goalkeeper deflected the puck to the side at the ice-hockey rink.", "the goalkeeper deflected the hockey puck to the destination at the ice hockey rink."], "NEG": ["the goalie deflected the hockey puck to the compost pile at the ice rink.", "the netkeeper deflected the puck to the elevator at the ice hockey rink.", "the netminder deflected the puck to the nursing bottle at the ice hockey rink."]}], ["sprinkling_239.jpg", {"POS": ["an soul sprinkles an salt from a mitt onto a nutrient at a countertop", "an chef sprinkles an flavoring from a hand onto a food at a interior", "an someone sprinkles an seasoner from a paw onto a salad at a kitchen"], "NEG": ["an soul sprinkles an salt from a paw onto a leopard at a countertop", "an chef sprinkles an flavorer from a paw onto a surface at a inside", "an soul sprinkles an flavorer from a paw onto a glove at a kitchen"]}], ["filling_119.jpg", {"POS": ["agent fills glass with water from spigot at a place", "agent fills drinking glass with H2O from faucet at a kitchen", "agent fills drinking glass with water from spigot at a sink"], "NEG": ["agent fills quarry with water from faucet at a place", "agent fills painting with H2O from spigot at a kitchen", "agent fills exterior with H2O from faucet at a sink"]}], ["landing_157.jpg", {"POS": ["aeroplane lands on a runway at a aerodrome", "aeroplane lands on a runway at a open air", "aeroplane lands on a landing strip at a open air"], "NEG": ["aeroplane lands on a edge at a aerodrome", "aeroplane lands on a stick at a open air", "aeroplane lands on a roof at a open air"]}], ["pinning_197.jpg", {"POS": ["man is pinning the badge onto a adult male in ceremonial occasion.", "mortal is pinning the insignia of rank onto a shirt in place.", "person is pinning the palm onto a coat in place."], "NEG": ["man is pinning the badge onto a harness in ceremony.", "person is pinning the insignia of rank onto a gun in place.", "someone is pinning the decoration onto a garden in place."]}], ["pumping_170.jpg", {"POS": ["an adult male pumps a water from a water pump to a paw using a lever at a park", "an adult male pumps a H2O from a solid ground to a paw using a pump at a out-of-doors", "an man pumps a water from a solid ground to a mitt using a pump at a outdoors"], "NEG": ["an adult male pumps a H2O from a water pump to a forward using a lever at a green", "an man pumps a water from a land to a pillow using a pump at a open air", "an adult male pumps a water from a earth to a puzzle using a pump at a out-of-doors"]}], ["milking_199.jpg", {"POS": ["an somebody milks a cow with a mitt into a pail in a place", "an adult male milks a moo-cow with a manus into a pail in a barn", "an grownup milks a goat with a paw into a bucket in a inside"], "NEG": ["an mortal milks a moo-cow with a manus into a ice in a place", "an adult male milks a moo-cow with a manus into a photocopier in a barn", "an grownup milks a goat with a hand into a brassiere in a inside"]}], ["pooing_201.jpg", {"POS": ["elephant poos onto a ground at a out-of-doors", "elephant poos onto a terra firma at a open air", "elephant poos onto a terra firma at a out-of-doors"], "NEG": ["elephant poos onto a edifice at a open air", "elephant poos onto a washcloth at a open", "elephant poos onto a hair at a outdoors"]}], ["spraying_388.jpg", {"POS": ["an truck sprays a water onto a earth from a truck using a TOOL in a exterior", "an agent sprays a water onto a ground from a oil tanker using a TOOL in a field", "an truck sprays a H2O onto a terra firma from a truck using a TOOL in a route"], "NEG": ["an motortruck sprays a H2O onto a greybeard from a motortruck using a TOOL in a outside", "an agent sprays a H2O onto a Panthera onca from a oiler using a TOOL in a field", "an motortruck sprays a H2O onto a beak from a motortruck using a TOOL in a road"]}], ["stumbling_103.jpg", {"POS": ["an baseball player stumbles onto a grass at a ball field", "an adult female stumbles onto a solid ground at a diamond", "an adult female stumbles onto a ground at a baseball field"], "NEG": ["an ballplayer stumbles onto a shirt at a baseball field", "an adult female stumbles onto a vein at a infield", "an adult female stumbles onto a male at a diamond"]}], ["plunging_6.jpg", {"POS": ["an adult male plunges a organic structure (when different than the adult male) into a water at a outside", "an adult male plunges a organic structure (when different than the adult male) into a swimming bath at a open air", "an adult male plunges a plunged (when different than the adult male) into a H2O at a pool"], "NEG": ["an man plunges a physical structure (when different than the man) into a batter at a outside", "an adult male plunges a body (when different than the adult male) into a deck at a open", "an adult male plunges a plunged (when different than the adult male) into a dummy at a pool"]}], ["applying_48.jpg", {"POS": ["woman is applying a ointment to a face using paw in a place.", "adult female is applying a ointment to a cheek using hand in a room.", "woman is applying a cream to a face using finger in a place."], "NEG": ["woman is applying a cream to a barrel using mitt in a place.", "woman is applying a cream to a outside door using hand in a room.", "adult female is applying a emollient to a bead using finger in a place."]}], ["stuffing_292.jpg", {"POS": ["the adult male stuffs the oral cavity in the destination at the food", "the adult male stuffs the spaghettini in the oral cavity at the room", "the man stuffs the spaghettini in the mouth at the place"], "NEG": ["the adult male stuffs the oral cavity in the jigsaw puzzle at the food", "the adult male stuffs the spaghettini in the people at the room", "the man stuffs the spaghettini in the military uniform at the place"]}], ["strapping_96.jpg", {"POS": ["an bambino straps the head into a helmet using a chin strap at a place", "an youngster straps the head into a helmet using a strap at a place", "an nestling straps the caput into a helmet using a strap at a place"], "NEG": ["an toddler straps the caput into a athletic field using a chin strap at a place", "an minor straps the caput into a face using a strap at a place", "an tiddler straps the head into a hoof using a strap at a place"]}], ["sliding_153.jpg", {"POS": ["the baseball player slides the slider (when different from the baseball player) on a dry land to a bag at a diamond.", "the baseball player slides the slider (when different from the baseball player) on a filth to a platelet at a ball field.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home plate at a baseball."], "NEG": ["the baseball player slides the slider (when different from the baseball player) on a earth to a tin at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a stain to a coney at a baseball field.", "the ballplayer slides the slider (when different from the ballplayer) on a sand to a rugby at a baseball game."]}], ["jumping_262.jpg", {"POS": ["an woman jumps from a bed over/through an obstacle (excluding the air) and will end up at a bed at a sleeping accommodation", "an maid jumps from a solid ground over/through an bed (excluding the air) and will end up at a bed at a room", "an adult female jumps from a bed over/through an obstacle (excluding the air) and will end up at a floor at a sleeping room"], "NEG": ["an woman jumps from a bed over/through an obstacle (excluding the air) and will end up at a range of mountains at a bedroom", "an maidservant jumps from a land over/through an bed (excluding the air) and will end up at a dishwater at a room", "an adult female jumps from a bed over/through an obstacle (excluding the air) and will end up at a food at a sleeping room"]}], ["pooing_9.jpg", {"POS": ["adult male poos onto a john at a comfort station", "adult male poos onto a can at a bathroom", "adult male poos onto a can at a can"], "NEG": ["man poos onto a downhill at a comfort station", "adult male poos onto a grate at a bathroom", "man poos onto a purse at a bathroom"]}], ["spraying_216.jpg", {"POS": ["an person sprays a water onto a plant life from a watering pot using a TOOL in a place", "an somebody sprays a H2O onto a flora from a bottle using a TOOL in a place", "an somebody sprays a H2O onto a plant life from a atomizer using a TOOL in a place"], "NEG": ["an person sprays a H2O onto a can from a watering can using a TOOL in a place", "an soul sprays a water onto a washstand from a bottle using a TOOL in a place", "an individual sprays a water onto a truck from a sprayer using a TOOL in a place"]}], ["jumping_107.jpg", {"POS": ["an lady jumps from a hill over/through an obstacle (excluding the air) and will end up at a body of water at a out-of-doors", "an woman jumps from a cliff over/through an obstacle (excluding the air) and will end up at a H2O at a open", "an woman jumps from a drop over/through an obstacle (excluding the air) and will end up at a body of water at a drop"], "NEG": ["an lady jumps from a hill over/through an obstacle (excluding the air) and will end up at a vat at a open air", "an adult female jumps from a drop-off over/through an obstacle (excluding the air) and will end up at a snowfall at a open air", "an adult female jumps from a cliff over/through an obstacle (excluding the air) and will end up at a front at a drop-off"]}], ["pumping_164.jpg", {"POS": ["an female child pumps a H2O from a well to a bucket using a lever at a open air", "an young woman pumps a H2O from a earth to a bucket using a pump at a outdoors", "an miss pumps a water from a ground to a pail using a water pump at a out-of-doors"], "NEG": ["an little girl pumps a H2O from a well to a beard using a lever at a open", "an girl pumps a water from a solid ground to a adult female using a pump at a out-of-doors", "an missy pumps a H2O from a terra firma to a sauce using a water pump at a open air"]}], ["installing_213.jpg", {"POS": ["an man installs a fire alarm into a ceiling using a hand at a room", "an man installs a fire alarm into a ceiling using a paw at a interior", "an man installs a sensing element into a ceiling using a manus at a place"], "NEG": ["an man installs a fire alarm into a cabinet using a paw at a room", "an man installs a smoke alarm into a net using a hand at a inside", "an man installs a detector into a face using a hand at a place"]}], ["milking_69.jpg", {"POS": ["an dairyman milks a milch cow with a milking machine into a milk can in a dairy", "an people milks a cow with a hosepipe into a container in a farm", "an granger milks a moo-cow with a milking machine into a container in a barn"], "NEG": ["an dairyman milks a dairy cow with a milking machine into a shore in a dairy", "an people milks a cow with a hose into a ocean in a farm", "an husbandman milks a cow with a milking machine into a exterior in a barn"]}], ["parachuting_65.jpg", {"POS": ["the people chuted using a chute to the ground at the sky.", "the people chuted using a chute to the ground at the sky.", "the people chuted using a chute to the land at the sky."], "NEG": ["the people chuted using a chute to the bell pepper at the sky.", "the people parachuted using a parachute to the reel at the sky.", "the people chuted using a chute to the water at the sky."]}], ["pouncing_186.jpg", {"POS": ["an true cat pounces onto the Canis familiaris at a interior", "an true cat pounces onto the dog at a room", "an true cat pounces onto the domestic dog at a house"], "NEG": ["an cat pounces onto the footballer at a interior", "an cat pounces onto the Earth at a room", "an true cat pounces onto the lamp at a house"]}], ["throwing_211.jpg", {"POS": ["the adult male throws an baseball towards a backstop at a ball field.", "the ballplayer throws an baseball towards a ballplayer at a baseball field.", "the male throws an baseball towards a male at a arena."], "NEG": ["the adult male throws an baseball towards a cake at a ball field.", "the ballplayer throws an baseball towards a floor at a baseball field.", "the male throws an baseball towards a sauce at a stadium."]}], ["emptying_108.jpg", {"POS": ["an people empties an H2O from a boat into a river using a manus in a outdoors", "an man empties an water from a boat into a lake using a paw in a open", "an adult male empties an H2O from a motorboat into a body of water using a paw in a open air"], "NEG": ["an people empties an H2O from a boat into a milking machine using a manus in a open air", "an adult male empties an water from a boat into a flower using a paw in a out-of-doors", "an adult male empties an water from a motorboat into a tile using a hand in a out-of-doors"]}], ["pouring_31.jpg", {"POS": ["an scientist pours a chemical substance from a tubing to a Erlenmeyer flask with a hand in a science lab", "an man pours a liquid from a tube to a glass with a mitt in a place", "an man pours a chemical from a test tube to a bottle with a manus in a place"], "NEG": ["an scientist pours a chemical substance from a tubing to a uniform with a manus in a science lab", "an adult male pours a liquid from a tube to a ice with a manus in a place", "an adult male pours a chemical from a test tube to a cervix with a manus in a place"]}], ["leaping_188.jpg", {"POS": ["the plunger leaps from the water over/through an obstacle to the H2O in the ocean", "the man leaps from the boat over/through an obstacle to the H2O in the sea", "the adult male leaps from the boat over/through an obstacle to the water in the ocean"], "NEG": ["the plunger leaps from the H2O over/through an obstacle to the window frame in the ocean", "the man leaps from the boat over/through an obstacle to the framework in the sea", "the adult male leaps from the boat over/through an obstacle to the wall in the ocean"]}], ["jumping_29.jpg", {"POS": ["an runner jumps from a ground over/through an hurdle (excluding the air) and will end up at a ground at a outdoors", "an man jumps from a dry land over/through an hurdle (excluding the air) and will end up at a terra firma at a course", "an man jumps from a land over/through an hurdle (excluding the air) and will end up at a ground at a race"], "NEG": ["an runner jumps from a land over/through an hurdle (excluding the air) and will end up at a ceiling at a open air", "an man jumps from a dry land over/through an hurdle (excluding the air) and will end up at a cover at a path", "an adult male jumps from a land over/through an hurdle (excluding the air) and will end up at a gun at a race"]}], ["installing_165.jpg", {"POS": ["an adult male installs a transmission line into a router using a hand at a living-room", "an man installs a transmission line into a modem using a mitt at a room", "an man installs a wire into a destination using a mitt at a interior"], "NEG": ["an adult male installs a line into a coney using a manus at a parlour", "an man installs a line into a tree using a mitt at a room", "an man installs a wire into a lawn cart using a mitt at a inside"]}], ["deflecting_224.jpg", {"POS": ["the adult male deflected the slug to the head at the inside.", "the man deflected the punch to the side at the place.", "the adult male deflected the arm to the side at the room."], "NEG": ["the man deflected the lick to the beam at the interior.", "the man deflected the lick to the target at the place.", "the man deflected the arm to the tin can at the room."]}], ["splashing_40.jpg", {"POS": ["an agent splashes a man with a water using a machine in a puddle", "an car splashes a adult male with a water using a automobile in a turning point", "an car splashes a adult male with a water using a tire in a street"], "NEG": ["an agent splashes a lawn with a H2O using a machine in a puddle", "an car splashes a pot with a water using a auto in a corner", "an machine splashes a friend with a water using a tire in a street"]}], ["loading_245.jpg", {"POS": ["the man loads a flatbed with an box using a crane at a exterior.", "the man loads a truck bed with an wood using a forklift at a road.", "the hard hat loads a truck bed with an pallet using a vehicle at a open air."], "NEG": ["the man loads a crowd with an box using a crane at a exterior.", "the adult male loads a wall plug with an wood using a forklift at a road.", "the hard hat loads a food waste with an pallet using a vehicle at a outdoors."]}], ["installing_87.jpg", {"POS": ["an man installs a flexible joint into a wall using a drill at a place", "an adult male installs a framework into a opening using a drill at a place", "an someone installs a frame into a brick using a drill at a place"], "NEG": ["an adult male installs a hinge into a artistic creation using a drill at a place", "an man installs a framework into a Panthera leo using a drill at a place", "an individual installs a frame into a mid-calf using a drill at a place"]}], ["plummeting_15.jpg", {"POS": ["the skydiver is plummeting from the sky toward the curtilage in the sky", "the skydiver is plummeting from the aeroplane toward the land in the air", "the parachuter is plummeting from the start toward the earth in the open"], "NEG": ["the skydiver is plummeting from the sky toward the box in the sky", "the skydiver is plummeting from the plane toward the stack in the air", "the parachutist is plummeting from the start toward the pair of tongs in the open"]}], ["loading_217.jpg", {"POS": ["the agent loads a truck with an item using a tool at a exterior.", "the soul loads a truck bed with an rock using a shovel at a pit.", "the individual loads a truck with an grunge using a scoop at a open."], "NEG": ["the agent loads a beaker with an item using a tool at a exterior.", "the individual loads a toilet bowl with an rock using a digger at a quarry.", "the person loads a physical object with an grunge using a scoop at a open air."]}], ["emptying_56.jpg", {"POS": ["an adult male empties an coin from a jar into a hand using a hand in a room", "an adult male empties an coin from a jar into a hand using a paw in a room", "an man empties an coin from a jar into a paw using a manus in a place"], "NEG": ["an adult male empties an coin from a jar into a drum using a manus in a room", "an man empties an coin from a jar into a audience using a mitt in a room", "an adult male empties an coin from a jar into a sewage system using a mitt in a place"]}], ["pinning_83.jpg", {"POS": ["someone is pinning the cloth onto a fabric in table.", "individual is pinning the cloth onto a material in place.", "somebody is pinning the cloth onto a fabric in interior."], "NEG": ["soul is pinning the cloth onto a object in table.", "someone is pinning the cloth onto a board in place.", "someone is pinning the material onto a officer in inside."]}], ["emptying_16.jpg", {"POS": ["an adult male empties an paper from a ash bin into a table using a paw in a interior", "an man empties an rubbish from a trash bin into a table using a mitt in a place", "an man empties an scrap from a ashcan into a surface using a mitt in a place"], "NEG": ["an man empties an paper from a ash-bin into a footballer using a hand in a interior", "an man empties an trash from a ashcan into a rock using a mitt in a place", "an man empties an trash from a trash barrel into a bath using a mitt in a place"]}], ["deflecting_153.jpg", {"POS": ["the man deflected the punch to the thorax at the interior.", "the arm deflected the lick to the side at the exterior.", "the adult male deflected the arm to the left at the interior."], "NEG": ["the man deflected the clout to the mixing bowl at the interior.", "the arm deflected the slug to the swoop at the exterior.", "the man deflected the arm to the fruit at the interior."]}], ["putting_62.jpg", {"POS": ["an Dr. puts an glove into a paw in a bath", "an MD puts an glove into a hand in a infirmary", "an person puts an glove into a hand in a medical center"], "NEG": ["an physician puts an glove into a ring in a bathroom", "an medico puts an glove into a flap in a infirmary", "an mortal puts an glove into a jar in a medical center"]}], ["sliding_73.jpg", {"POS": ["the people slides the physical structure (when different from the people) on a H2O to a destination at a out-of-doors.", "the grouping slides the slider (when different from the grouping) on a stone to a bottom at a out-of-doors.", "the people slides the slider (when different from the people) on a stone to a river at a river."], "NEG": ["the people slides the body (when different from the people) on a H2O to a cargo hold at a open.", "the group slides the slider (when different from the group) on a stone to a balloon at a open air.", "the people slides the slider (when different from the people) on a stone to a trunk at a river."]}], ["pooing_148.jpg", {"POS": ["monkey poos onto a table at a place", "monkey poos onto a sign at a place", "monkey poos onto a memorial park at a inside"], "NEG": ["monkey poos onto a row at a place", "monkey poos onto a slide at a place", "monkey poos onto a patch at a interior"]}], ["pooing_222.jpg", {"POS": ["true cat poos onto a bedding at a floor", "true cat poos onto a cat box at a room", "pupil poos onto a Kitty Litter at a rug"], "NEG": ["cat poos onto a balloon at a flooring", "cat poos onto a chest at a room", "educatee poos onto a rugby at a rug"]}], ["leaking_264.jpg", {"POS": ["a sampling leaks from a source onto/into a container at a place", "a liquid leaks from a source onto/into a tube at a place", "a piddle leaks from a beast onto/into a specimen bottle at a place"], "NEG": ["a sample distribution leaks from a source onto/into a young buck at a place", "a liquid leaks from a source onto/into a parchment at a place", "a piddle leaks from a animal onto/into a outside door at a place"]}], ["sliding_100.jpg", {"POS": ["the adult female slides the slider (when different from the adult female) on a river to a lake at a open.", "the adult male slides the slider (when different from the adult male) on a rock to a water at a open.", "the male child slides the slider (when different from the male child) on a water to a body of water at a outside."], "NEG": ["the woman slides the slider (when different from the woman) on a river to a bar at a outdoors.", "the adult male slides the slider (when different from the adult male) on a stone to a cone at a out-of-doors.", "the male child slides the slider (when different from the male child) on a body of water to a coaster at a exterior."]}], ["splashing_131.jpg", {"POS": ["an somebody splashes a air with a H2O using a paw in a ocean", "an adult male splashes a water with a H2O using a tool in a ocean", "an adult male splashes a ocean with a water using a hand in a exterior"], "NEG": ["an person splashes a coconut meat with a H2O using a manus in a ocean", "an adult male splashes a Mason jar with a water using a tool in a ocean", "an adult male splashes a opening with a H2O using a hand in a outside"]}], ["injecting_184.jpg", {"POS": ["an physician injects a medicine from a syringe into a patient at a room", "an individual injects a substance from a syringe into a someone at a infirmary", "an doc injects a drug from a syringe into a mortal at a place"], "NEG": ["an physician injects a medicament from a syringe into a artistic creation at a room", "an somebody injects a substance from a syringe into a disposable at a infirmary", "an physician injects a drug from a syringe into a pipe at a place"]}], ["landing_206.jpg", {"POS": ["plane lands on a runway at a airdrome", "airplane lands on a runway at a airdrome", "plane lands on a runway at a open air"], "NEG": ["airplane lands on a sand at a airdrome", "aeroplane lands on a clinker block at a airdrome", "plane lands on a cone at a out-of-doors"]}], ["spilling_134.jpg", {"POS": ["an adult male spills a apparel from a handbasket onto a terra firma at a room", "an man spills a substance from a source onto a stairway at a place", "an man spills a dress from a arm onto a stairs at a business office"], "NEG": ["an man spills a dress from a handbasket onto a road at a room", "an adult male spills a substance from a source onto a basket at a place", "an adult male spills a wearing apparel from a arm onto a platelet at a office"]}], ["applying_61.jpg", {"POS": ["adult female is applying a war paint to a chin using brush in a place.", "adult female is applying a war paint to a human face using brush in a place.", "female person is applying a war paint to a face using brush in a jaw."], "NEG": ["adult female is applying a war paint to a nose using brush in a place.", "woman is applying a makeup to a Dumpster using brush in a place.", "female is applying a make-up to a bowl using brush in a jaw."]}], ["landing_192.jpg", {"POS": ["airplane lands on a runway at a drome", "aeroplane lands on a runway at a open", "plane lands on a runway at a outdoors"], "NEG": ["plane lands on a place at a airport", "plane lands on a earth at a outdoors", "aeroplane lands on a tube-shaped structure at a open"]}], ["parachuting_273.jpg", {"POS": ["the mortal chuted using a chute to the wood at the sky.", "the someone chuted using a chute to the terra firma at the sky.", "the person parachuted using a parachute to the destination at the sky."], "NEG": ["the someone chuted using a chute to the track at the sky.", "the mortal chuted using a chute to the chest at the sky.", "the somebody chuted using a chute to the police officer at the sky."]}], ["plummeting_242.jpg", {"POS": ["the skydiver is plummeting from the aeroplane toward the land in the sky", "the mortal is plummeting from the sky toward the earth in the field", "the parachuter is plummeting from the start toward the solid ground in the open air"], "NEG": ["the skydiver is plummeting from the airplane toward the pan in the sky", "the individual is plummeting from the sky toward the target in the field", "the parachutist is plummeting from the start toward the waistline in the out-of-doors"]}], ["applying_201.jpg", {"POS": ["man is applying a epoxy glue to a plywood using tool in a place.", "individual is applying a water to a wood using brush in a place.", "someone is applying a substance to a destination using brush in a place."], "NEG": ["adult male is applying a epoxy resin to a wing using tool in a place.", "person is applying a water to a hinge using brush in a place.", "individual is applying a substance to a hole using brush in a place."]}], ["pumping_194.jpg", {"POS": ["an adult female pumps a petrol from a gas tank to a automobile using a gas pump at a filling station", "an adult female pumps a petrol from a storage tank to a machine using a gas pump at a filling station", "an woman pumps a petrol from a storage to a automobile using a gasoline pump at a filling station"], "NEG": ["an adult female pumps a gasolene from a gas tank to a sugarcane using a gas pump at a petrol station", "an woman pumps a petrol from a storage tank to a electrical outlet using a gas pump at a gasoline station", "an adult female pumps a gas from a storage to a alimentary paste using a gasoline pump at a filling station"]}], ["applying_186.jpg", {"POS": ["adult female is applying a war paint to a brow using brush in a place.", "mortal is applying a make-up to a supercilium using brush in a place.", "adult female is applying a mascara to a brow using brush in a place."], "NEG": ["woman is applying a war paint to a barrel using brush in a place.", "someone is applying a make-up to a scattergun using brush in a place.", "woman is applying a mascara to a market place using brush in a place."]}], ["tying_171.jpg", {"POS": ["an female ties an tie to a neckband using a hand at a place", "an adult female ties an tie to a neckband using a knot at a place", "an adult female ties an necktie to a cervix using a necktie at a inside"], "NEG": ["an female ties an necktie to a beam using a hand at a place", "an woman ties an necktie to a pastry dough using a knot at a place", "an woman ties an tie to a nail using a necktie at a inside"]}], ["pooing_62.jpg", {"POS": ["woman poos onto a toilet at a lav", "woman poos onto a privy at a lav", "missy poos onto a throne at a lavatory"], "NEG": ["woman poos onto a crack at a john", "adult female poos onto a cheek at a privy", "girl poos onto a garden at a privy"]}], ["landing_144.jpg", {"POS": ["airplane lands on a runway at a aerodrome", "airplane lands on a runway at a out-of-doors", "plane lands on a runway at a airdrome"], "NEG": ["airplane lands on a ice at a airdrome", "airplane lands on a patch at a open", "airplane lands on a stretcher at a drome"]}], ["strapping_157.jpg", {"POS": ["an woman straps the woman into a car seat using a seat belt at a motorcar", "an adult female straps the individual into a car seat using a seatbelt at a machine", "an adult female straps the woman into a car seat using a seat belt at a auto"], "NEG": ["an woman straps the woman into a hill using a seat belt at a automobile", "an adult female straps the somebody into a felt using a seatbelt at a machine", "an woman straps the adult female into a steel wool using a seatbelt at a automobile"]}], ["fetching_86.jpg", {"POS": ["the dog fetches the Frisbee from air and brings it to mortal, in outdoors.", "the domestic dog fetches the Frisbee from owner and brings it to oral fissure, in commons.", "the Canis familiaris fetches the Frisbee from air and brings it to destination, in outdoors."], "NEG": ["the Canis familiaris fetches the Frisbee from air and brings it to shaving brush, in open.", "the domestic dog fetches the Frisbee from proprietor and brings it to lamb, in park.", "the dog fetches the Frisbee from air and brings it to stomach, in out-of-doors."]}], ["pouring_171.jpg", {"POS": ["an man pours a liquid from a pail to a pouch with a manus in a room", "an cobbler pours a plaster from a bowl to a stamp with a hand in a shop", "an adult male pours a substance from a bucket to a shoe with a hand in a inside"], "NEG": ["an man pours a liquid from a bucket to a dummy with a hand in a room", "an shoemaker pours a plaster from a bowl to a steak with a hand in a shop", "an man pours a substance from a pail to a Styrofoam with a manus in a inside"]}], ["emerging_262.jpg", {"POS": ["the fish emerges from body of water to air in ocean.", "the whale emerges from H2O to destination in water.", "the whale emerges from ocean to air in outside."], "NEG": ["the fish emerges from body of water to due north in ocean.", "the hulk emerges from water to river in H2O.", "the whale emerges from ocean to potty seat in exterior."]}], ["pouring_143.jpg", {"POS": ["an individual pours a liquid from a pitcher to a bowl with a mitt in a place", "an individual pours a boat from a ewer to a bowl with a manus in a place", "an individual pours a substance from a boat to a bowl with a hand in a place"], "NEG": ["an somebody pours a liquid from a ewer to a bull with a hand in a place", "an soul pours a gravy boat from a ewer to a gas line with a mitt in a place", "an someone pours a substance from a sauceboat to a volaille with a paw in a place"]}], ["strapping_34.jpg", {"POS": ["an somebody straps the framework into a destination using a textile at a place", "an man straps the plastic into a pole using a tape at a interior", "an man straps the deck chair into a framework using a plastic at a place"], "NEG": ["an individual straps the framework into a skin using a material at a place", "an man straps the plastic into a petrol engine using a tape at a interior", "an adult male straps the beach chair into a grassland using a plastic at a place"]}], ["pinning_120.jpg", {"POS": ["bride is pinning the posy onto a man in wedding.", "bride is pinning the flower onto a suit in room.", "bride is pinning the flower onto a lapel in room."], "NEG": ["bride is pinning the corsage onto a hide in nuptials.", "bride is pinning the flower onto a drywall in room.", "bride is pinning the flower onto a paint in room."]}], ["raking_23.jpg", {"POS": ["an man rakes an leaf from a solid ground into a agglomerate at a grounds", "an man rakes an foliage from a land into a destination at a out-of-doors", "an Methuselah rakes an foliage from a dry land into a plenty at a out-of-doors"], "NEG": ["an man rakes an leafage from a land into a metal at a grounds", "an man rakes an leaf from a solid ground into a stone at a open air", "an old man rakes an leaf from a earth into a baseball diamond at a out-of-doors"]}], ["stumbling_27.jpg", {"POS": ["an jockey stumbles onto a terra firma at a horse race", "an jockey stumbles onto a dirt at a track", "an individual stumbles onto a Equus caballus at a horse race"], "NEG": ["an jockey stumbles onto a catcher at a horse race", "an jockey stumbles onto a gap at a racetrack", "an mortal stumbles onto a cheek at a horse race"]}], ["sliding_108.jpg", {"POS": ["the baseball player slides the slider (when different from the baseball player) on a solid ground to a base at a ball field.", "the ballplayer slides the slider (when different from the ballplayer) on a sand to a plate at a baseball.", "the man slides the slider (when different from the man) on a soil to a plate at a baseball field."], "NEG": ["the ballplayer slides the slider (when different from the ballplayer) on a ground to a plywood at a baseball field.", "the ballplayer slides the slider (when different from the ballplayer) on a sand to a mate at a baseball.", "the adult male slides the slider (when different from the adult male) on a soil to a sea at a diamond."]}], ["pooing_139.jpg", {"POS": ["adult male poos onto a toilet at a bathroom", "somebody poos onto a commode at a bathroom", "soul poos onto a throne at a bath"], "NEG": ["adult male poos onto a flask at a bath", "individual poos onto a CPU board at a bath", "individual poos onto a solid ground at a bath"]}], ["raking_57.jpg", {"POS": ["an adult male rakes an leafage from a grass into a garden cart at a lawn", "an greybeard rakes an leaf from a land into a wheelbarrow at a grounds", "an adult male rakes an leafage from a land into a cumulation at a lawn"], "NEG": ["an adult male rakes an foliage from a grass into a alimentary paste at a lawn", "an greybeard rakes an leafage from a land into a mouth at a grounds", "an adult male rakes an foliage from a ground into a maize at a lawn"]}], ["leaping_127.jpg", {"POS": ["the caprine animal leaps from the land over/through an obstacle to the ground in the mountain", "the sheep leaps from the earth over/through an stone to the earth in the mountain chain", "the goat leaps from the rock over/through an obstacle to the stone in the mount"], "NEG": ["the caprine animal leaps from the dry land over/through an obstacle to the sheet metal in the mountain", "the sheep leaps from the earth over/through an stone to the stage set in the chain of mountains", "the goat leaps from the rock over/through an obstacle to the coffin in the mountain"]}], ["filling_112.jpg", {"POS": ["man fills vial with ink from dropper at a place", "somebody fills bottle with ink from eye dropper at a place", "man fills tubing with ink from pipet at a place"], "NEG": ["adult male fills Petri dish with ink from eye dropper at a place", "individual fills cake with ink from eye dropper at a place", "man fills bandage with ink from pipet at a place"]}], ["putting_83.jpg", {"POS": ["an people puts an book into a bookshelf in a library", "an people puts an book into a shelf in a library", "an people puts an book into a shelf in a library"], "NEG": ["an people puts an book into a turntable in a library", "an people puts an book into a pillow in a library", "an people puts an book into a tablecloth in a library"]}], ["emptying_36.jpg", {"POS": ["an man empties an food waste from a dustbin into a Dumpster using a hand in a open air", "an adult male empties an trash from a ash-bin into a destination using a manus in a open air", "an adult male empties an food waste from a bin into a dustbin using a mitt in a open"], "NEG": ["an adult male empties an garbage from a trash can into a fair game using a mitt in a outdoors", "an man empties an scrap from a garbage can into a crack using a mitt in a open air", "an adult male empties an food waste from a bin into a venter using a mitt in a out-of-doors"]}], ["ejecting_143.jpg", {"POS": ["an adult male ejects an shotgun shell from a scattergun toward a land at a outdoors", "an adult male ejects an shotgun shell from a scattergun toward a air at a outdoors", "an adult male ejects an shell from a shotgun toward a destination at a open"], "NEG": ["an adult male ejects an shotgun shell from a scattergun toward a form at a out-of-doors", "an adult male ejects an shotgun shell from a scattergun toward a trench at a outdoors", "an man ejects an shell from a shotgun toward a sport utility at a open air"]}], ["stuffing_204.jpg", {"POS": ["the adult male stuffs the mouth in the destination at the licorice", "the adult male stuffs the confect in the rima oris at the motorcar", "the somebody stuffs the candy in the oral cavity at the vehicle"], "NEG": ["the adult male stuffs the oral cavity in the pocketbook at the liquorice", "the man stuffs the candy in the brush at the machine", "the mortal stuffs the candy in the right at the vehicle"]}], ["pinning_96.jpg", {"POS": ["man is pinning the pinned onto a shirt in place.", "man is pinning the palm onto a old man in canopy.", "adult male is pinning the pin onto a shirt in outside."], "NEG": ["man is pinning the pinned onto a flexible joint in place.", "man is pinning the medallion onto a Erlenmeyer flask in canopy.", "adult male is pinning the pin onto a pipage in outside."]}], ["pumping_203.jpg", {"POS": ["an adult female pumps a gasoline from a storage tank to a petrol tank using a gas pump at a gas station", "an adult male pumps a gasoline from a storage to a auto using a petrol pump at a filling station", "an soul pumps a petrol from a storage to a machine using a gasoline pump at a filling station"], "NEG": ["an adult female pumps a gasoline from a storage tank to a syringe using a gasoline pump at a gas station", "an adult male pumps a gas from a storage to a mountain using a petrol pump at a gas station", "an individual pumps a gasolene from a storage to a proprietor using a gas pump at a gasoline station"]}], ["deflecting_229.jpg", {"POS": ["the player deflected the ball to the goal at the athletic field.", "the people deflected the ball to the destination at the field.", "the net deflected the ball to the side at the field."], "NEG": ["the player deflected the ball to the drainage at the athletic field.", "the people deflected the ball to the vein at the field.", "the net deflected the ball to the felt at the field."]}], ["stuffing_234.jpg", {"POS": ["the adult female stuffs the pizza in the oral fissure at the place", "the adult female stuffs the pizza pie in the rima oris at the table", "the woman stuffs the pizza pie in the mouth at the place"], "NEG": ["the adult female stuffs the pizza pie in the manakin at the place", "the adult female stuffs the pizza in the casserole at the table", "the woman stuffs the pizza pie in the sand at the place"]}], ["milking_51.jpg", {"POS": ["an male child milks a cow with a hand into a pail in a farm", "an boy milks a cow with a hand into a bucket in a barn", "an male child milks a Bos taurus with a hand into a bucket in a outdoors"], "NEG": ["an male child milks a cow with a mitt into a running in a farm", "an boy milks a cow with a paw into a hinge in a barn", "an male child milks a cows with a manus into a Kitty Litter in a outdoors"]}], ["attaching_318.jpg", {"POS": ["an somebody attaches a conducting wire to a conducting wire with press stud using a manus at a interior", "an man attaches a wire to a interface with glue using a tool at a computing device", "an person attaches a line to a transmission line with connecter using a mitt at a place"], "NEG": ["an person attaches a conducting wire to a glove with press stud using a paw at a interior", "an man attaches a wire to a fishing line with glue using a tool at a data processor", "an somebody attaches a transmission line to a cycle with connector using a mitt at a place"]}], ["stuffing_283.jpg", {"POS": ["the young woman stuffs the item in the dolly at the outside", "the girl stuffs the doll in the out-of-doors at the cotton wool", "the girl stuffs the dolly in the doll at the place"], "NEG": ["the girl stuffs the item in the labor at the exterior", "the girl stuffs the dolly in the musical instrument at the cotton", "the female child stuffs the dolly in the harvest at the place"]}], ["filling_82.jpg", {"POS": ["someone fills cup with H2O from spigot at a place", "mortal fills destination with H2O from spigot at a interior", "adult male fills container with item from tap at a place"], "NEG": ["person fills flowerpot with H2O from spigot at a place", "mortal fills cat box with H2O from faucet at a inside", "adult male fills head with item from tap at a place"]}], ["taping_224.jpg", {"POS": ["an adult male tapes an pes to a destination at a open", "an adult male tapes an human foot to a metatarsal arch at a open air", "an person tapes an tape to a pes at a outdoors"], "NEG": ["an adult male tapes an foot to a toilet at a open air", "an man tapes an pes to a food at a out-of-doors", "an someone tapes an tape to a crochet stitch at a outdoors"]}], ["putting_163.jpg", {"POS": ["an adult male puts an book into a bookshelf in a library", "an adult male puts an book into a shelf in a library", "an adult male puts an book into a bookshelf in a library"], "NEG": ["an man puts an book into a stomach in a library", "an man puts an book into a agglomerate in a library", "an adult male puts an book into a dry land in a library"]}], ["landing_73.jpg", {"POS": ["aeroplane lands on a runway at a airdrome", "plane lands on a runway at a aerodrome", "aeroplane lands on a runway at a aerodrome"], "NEG": ["aeroplane lands on a cardboard at a airdrome", "airplane lands on a articulatio talocruralis at a airport", "aeroplane lands on a recycling bin at a drome"]}], ["fastening_111.jpg", {"POS": ["an man fastens an seat belt into a buckle with a fastener using a hand at a motorcar", "an man fastens an seatbelt into a buckle with a tongue and groove joint using a paw at a machine", "an individual fastens an seat belt into a buckle with a clasp using a paw at a motorcar"], "NEG": ["an adult male fastens an seat belt into a wire with a fixing using a paw at a car", "an man fastens an seat belt into a shelf with a tongue and groove joint using a manus at a car", "an somebody fastens an seat belt into a automobile with a clasp using a manus at a auto"]}], ["sprinkling_228.jpg", {"POS": ["an sprinkler sprinkles an H2O from a earth onto a grass at a parkland", "an sprinkler sprinkles an water from a storage onto a grass at a open", "an agent sprinkles an water from a sprinkler onto a grass at a field"], "NEG": ["an sprinkler sprinkles an water from a dry land onto a fille at a parkland", "an sprinkler sprinkles an H2O from a storage onto a puzzle at a outdoors", "an agent sprinkles an water from a sprinkler onto a pen at a field"]}], ["stuffing_286.jpg", {"POS": ["the adult female stuffs the cupcake in the oral fissure at the table", "the woman stuffs the cake in the oral cavity at the table", "the woman stuffs the cake in the oral fissure at the place"], "NEG": ["the woman stuffs the cupcake in the eatery at the table", "the woman stuffs the cake in the warehouse at the table", "the adult female stuffs the bar in the branch at the place"]}], ["milking_167.jpg", {"POS": ["an tike milks a simulation with a paw into a destination in a building", "an child milks a source with a hand into a pail in a room", "an nestling milks a reproduction with a hand into a pail in a museum"], "NEG": ["an minor milks a simulation with a hand into a batter in a building", "an kid milks a source with a paw into a current of air in a room", "an nipper milks a replica with a mitt into a machine in a museum"]}], ["emptying_171.jpg", {"POS": ["an adult male empties an fish from a net into a bin using a paw in a boat", "an man empties an item from a net into a bin using a paw in a open", "an people empties an net from a pail into a bucket using a hand in a boat"], "NEG": ["an man empties an fish from a net into a glove using a manus in a boat", "an adult male empties an item from a net into a countertop using a paw in a out-of-doors", "an people empties an net from a bucket into a compost heap using a paw in a boat"]}], ["filling_197.jpg", {"POS": ["man fills bucket with soil from bag at a open", "man fills stamp with soil from bag at a exterior", "man fills bin with dirt from man at a out-of-doors"], "NEG": ["man fills puzzle with soil from bag at a out-of-doors", "man fills floater with soil from bag at a outside", "adult male fills alimentary paste with soil from adult male at a open"]}], ["attaching_110.jpg", {"POS": ["an individual attaches a foam to a wood with glue using a hand at a outside", "an woman attaches a cushioning to a bench with glue using a paw at a workshop", "an person attaches a wood to a destination with glue using a tool at a place"], "NEG": ["an individual attaches a foam to a gurney with mucilage using a paw at a outside", "an adult female attaches a padding to a tennis ball with glue using a manus at a shop", "an person attaches a wood to a computing machine with glue using a tool at a place"]}], ["placing_237.jpg", {"POS": ["people placed decor in table along ALREADYdecor in interior", "man placed ornamentation in lamp along ALREADYornamentation in inside", "people placed statue in table along ALREADYstatue in room"], "NEG": ["people placed decor in beaker along ALREADYdecor in interior", "adult male placed decoration in beam along ALREADYdecoration in interior", "people placed statue in north along ALREADYstatue in room"]}], ["jumping_277.jpg", {"POS": ["an person jumps from a terra firma over/through an bonfire (excluding the air) and will end up at a solid ground at a out-of-doors", "an adult male jumps from a earth over/through an campfire (excluding the air) and will end up at a earth at a field", "an man jumps from a dry land over/through an campfire (excluding the air) and will end up at a ground at a open"], "NEG": ["an person jumps from a earth over/through an balefire (excluding the air) and will end up at a hill at a outdoors", "an man jumps from a earth over/through an campfire (excluding the air) and will end up at a trailer at a field", "an man jumps from a earth over/through an campfire (excluding the air) and will end up at a target at a open air"]}], ["stumbling_213.jpg", {"POS": ["an football player stumbles onto a grass at a football field", "an football player stumbles onto a dry land at a football field", "an football player stumbles onto a ground at a gridiron"], "NEG": ["an footballer stumbles onto a cheek at a gridiron", "an football player stumbles onto a air mattress at a gridiron", "an footballer stumbles onto a runway at a football field"]}], ["injecting_337.jpg", {"POS": ["an mortal injects a liquid from a syringe into a egg at a place", "an individual injects a substance from a syringe into a egg at a place", "an mortal injects a liquid from a syringe into a egg at a place"], "NEG": ["an someone injects a liquid from a syringe into a hairpin at a place", "an mortal injects a substance from a syringe into a ice skate at a place", "an somebody injects a liquid from a syringe into a face at a place"]}], ["pooing_209.jpg", {"POS": ["female poos onto a commode at a bathroom", "woman poos onto a toilet at a lav", "missy poos onto a stool at a lav"], "NEG": ["female poos onto a menage at a bath", "adult female poos onto a sheet metal at a can", "young woman poos onto a beam at a bathroom"]}], ["raking_225.jpg", {"POS": ["an female child rakes an leaf from a solid ground into a cumulation at a yard", "an young woman rakes an leafage from a earth into a cumulus at a yard", "an miss rakes an leafage from a solid ground into a agglomerate at a curtilage"], "NEG": ["an little girl rakes an leafage from a earth into a stream at a yard", "an young woman rakes an leafage from a land into a rat at a curtilage", "an young lady rakes an leafage from a land into a window at a yard"]}], ["ejecting_147.jpg", {"POS": ["an jet-propelled plane ejects an pilot from a cockpit toward a sky at a open air", "an jet ejects an someone from a source toward a air at a out-of-doors", "an airplane pilot ejects an bomb from a aeroplane toward a land at a outdoors"], "NEG": ["an jet plane ejects an airplane pilot from a cockpit toward a step at a out-of-doors", "an jet plane ejects an someone from a source toward a platform at a open air", "an pilot ejects an bomb from a airplane toward a pouch at a outdoors"]}], ["installing_247.jpg", {"POS": ["an adult male installs a wiring into a wall using a manus at a room", "an electrician installs a thermoregulator into a wall using a hand at a place", "an man installs a component into a destination using a mitt at a inside"], "NEG": ["an adult male installs a wiring into a horse using a hand at a room", "an lineman installs a thermoregulator into a town using a paw at a place", "an adult male installs a component into a coaster using a paw at a inside"]}], ["pouring_184.jpg", {"POS": ["an agent pours a dope from a bottle to a glass with a paw in a place", "an man pours a pop from a bottle to a glass with a manus in a interior", "an somebody pours a tonic from a bottle to a drinking glass with a paw in a place"], "NEG": ["an agent pours a cola from a bottle to a bowl with a hand in a place", "an adult male pours a soda water from a bottle to a lapel with a mitt in a interior", "an someone pours a soda pop from a bottle to a pan with a mitt in a place"]}], ["plunging_111.jpg", {"POS": ["an fireman plunges a chassis (when different than the fireman) into a H2O at a glacier", "an adult male plunges a body (when different than the adult male) into a water at a lake", "an adult male plunges a person (when different than the adult male) into a H2O at a out-of-doors"], "NEG": ["an fireman plunges a material body (when different than the fireman) into a microwave at a glacier", "an adult male plunges a body (when different than the adult male) into a mouse at a lake", "an adult male plunges a mortal (when different than the adult male) into a basketball at a out-of-doors"]}], ["loading_76.jpg", {"POS": ["the man loads a motortruck with an fish using a manus at a outside.", "the man loads a truck with an fish using a crate at a outdoors.", "the man loads a truck bed with an fish using a hand at a exterior."], "NEG": ["the man loads a masonry with an fish using a paw at a outside.", "the adult male loads a crack with an fish using a crate at a open.", "the adult male loads a adult female with an fish using a mitt at a outside."]}], ["plummeting_179.jpg", {"POS": ["the skydiver is plummeting from the aeroplane toward the earth in the sky", "the individual is plummeting from the start toward the earth in the air", "the skydiver is plummeting from the airplane toward the terra firma in the air"], "NEG": ["the skydiver is plummeting from the aeroplane toward the locker in the sky", "the individual is plummeting from the start toward the temple in the air", "the skydiver is plummeting from the airplane toward the bowl in the air"]}], ["spraying_274.jpg", {"POS": ["an boat sprays a oil onto a water from a nose using a TOOL in a beach", "an ship sprays a sand onto a beach from a ocean using a TOOL in a place", "an ship sprays a substance onto a shore from a ship using a TOOL in a shore"], "NEG": ["an boat sprays a oil onto a toy from a nose using a TOOL in a beach", "an ship sprays a sand onto a temple from a ocean using a TOOL in a place", "an ship sprays a substance onto a cement from a ship using a TOOL in a shore"]}], ["putting_368.jpg", {"POS": ["an person puts an lid into a drinking glass in a place", "an someone puts an lid into a cup in a place", "an person puts an lid into a cup in a place"], "NEG": ["an somebody puts an lid into a crocodile in a place", "an soul puts an lid into a seat in a place", "an mortal puts an lid into a opening in a place"]}], ["spilling_210.jpg", {"POS": ["an agent spills a leaf from a jar onto a destination at a place", "an cup spills a plant life from a cup onto a table at a outside", "an agent spills a substance from a jar onto a bench at a open"], "NEG": ["an agent spills a leaf from a jar onto a goblet at a place", "an cup spills a plant from a cup onto a rooftop at a outside", "an agent spills a substance from a jar onto a possession at a outdoors"]}], ["sprinkling_17.jpg", {"POS": ["an individual sprinkles an cheese from a paw onto a pizza pie at a kitchen", "an person sprinkles an cheese from a manus onto a pizza at a place", "an soul sprinkles an cheese from a hand onto a pizza at a tabular array"], "NEG": ["an individual sprinkles an cheese from a hand onto a fellow at a kitchen", "an person sprinkles an cheese from a mitt onto a double-decker at a place", "an mortal sprinkles an cheese from a manus onto a ring at a table"]}], ["sliding_146.jpg", {"POS": ["the girl slides the slider (when different from the girl) on a slide to a water at a pool.", "the little girl slides the slider (when different from the little girl) on a slide to a pool at a open.", "the young lady slides the slider (when different from the young lady) on a sliding board to a pool at a exterior."], "NEG": ["the young lady slides the slider (when different from the young lady) on a playground slide to a neckband at a pool.", "the little girl slides the slider (when different from the little girl) on a playground slide to a sewer system at a outdoors.", "the girl slides the slider (when different from the girl) on a playground slide to a stage set at a outside."]}], ["spraying_22.jpg", {"POS": ["an woman sprays a water onto a flora from a bottle using a TOOL in a room", "an adult female sprays a liquid onto a flora from a bottle using a TOOL in a room", "an woman sprays a H2O onto a bottle from a plant using a TOOL in a house"], "NEG": ["an woman sprays a H2O onto a bed from a bottle using a TOOL in a room", "an woman sprays a liquid onto a front end from a bottle using a TOOL in a room", "an woman sprays a water onto a breast pocket from a plant using a TOOL in a house"]}], ["pumping_228.jpg", {"POS": ["an Black man pumps a water from a water pump to a motorcycle using a hose at a out-of-doors", "an adult male pumps a petrol from a bike to a pail using a tube at a open air", "an adult male pumps a liquid from a motorcycle to a bucket using a syphon at a open air"], "NEG": ["an Black man pumps a water from a water pump to a Bubalus bubalis using a hose at a out-of-doors", "an adult male pumps a gas from a motorcycle to a barrow using a tube at a out-of-doors", "an man pumps a liquid from a motorcycle to a box using a syphon at a open air"]}], ["raking_98.jpg", {"POS": ["an adult female rakes an foliage from a ground into a mound at a garden", "an adult female rakes an leaf from a heap into a wheelbarrow at a outdoors", "an soul rakes an leafage from a solid ground into a wheelbarrow at a backyard"], "NEG": ["an woman rakes an leaf from a land into a interface at a garden", "an adult female rakes an leafage from a mound into a mouse at a open air", "an individual rakes an leafage from a solid ground into a elephant at a backyard"]}], ["pouring_43.jpg", {"POS": ["an boy pours a liquid from a drinking glass to a bottle with a manus in a room", "an male child pours a H2O from a glass to a cone with a hand in a home", "an shaver pours a substance from a drinking glass to a funnel with a mitt in a interior"], "NEG": ["an boy pours a liquid from a drinking glass to a table with a hand in a room", "an male child pours a H2O from a glass to a target with a paw in a family", "an tyke pours a substance from a glass to a needle with a mitt in a inside"]}], ["pumping_53.jpg", {"POS": ["an hand pumps a gas from a tank to a container using a gasoline pump at a exterior", "an person pumps a gasoline from a container to a car using a pump at a outside", "an individual pumps a gasolene from a car to a gasoline tank using a pump at a outside"], "NEG": ["an manus pumps a gas from a storage tank to a hook using a gas pump at a outside", "an person pumps a gas from a container to a wire using a pump at a exterior", "an mortal pumps a gas from a car to a bridge using a pump at a exterior"]}], ["emerging_206.jpg", {"POS": ["the dolphin emerges from body of water to air in pool.", "the dolphin emerges from H2O to air in island.", "the dolphin emerges from ocean to air in exterior."], "NEG": ["the dolphin emerges from body of water to wind in pool.", "the dolphin emerges from water to sod in island.", "the dolphin emerges from ocean to ball in outside."]}], ["fastening_22.jpg", {"POS": ["an mortal fastens an seat belt into a buckle with a knife using a manus at a vehicle", "an soul fastens an seat belt into a buckle with a fixing using a paw at a place", "an someone fastens an seatbelt into a buckle with a clasp using a mitt at a car"], "NEG": ["an individual fastens an seat belt into a goalie with a knife using a mitt at a vehicle", "an mortal fastens an seatbelt into a crowd with a fastener using a hand at a place", "an someone fastens an seatbelt into a stamp with a clasp using a mitt at a motorcar"]}], ["loading_35.jpg", {"POS": ["the man loads a motortruck with an speedboat using a ladder at a place.", "the man loads a truck with an snowmobile using a tool at a exterior.", "the man loads a truck bed with an motorboat using a incline at a place."], "NEG": ["the man loads a gap with an speedboat using a ladder at a place.", "the man loads a chest with an snowmobile using a tool at a exterior.", "the adult male loads a ski slope with an powerboat using a incline at a place."]}], ["pinning_196.jpg", {"POS": ["woman is pinning the badge onto a policeman in ceremony.", "woman is pinning the insignia of rank onto a shirt in room.", "woman is pinning the pinned onto a shirt in interior."], "NEG": ["woman is pinning the badge onto a keyboard in ceremonial occasion.", "adult female is pinning the insignia of rank onto a sewing machine in room.", "adult female is pinning the pinned onto a plank in inside."]}], ["spraying_193.jpg", {"POS": ["an worker sprays a pesticide onto a street from a spray gun using a TOOL in a forest", "an man sprays a pesticide onto a tree from a atomiser using a TOOL in a woods", "an man sprays a pesticide onto a tree from a container using a TOOL in a out-of-doors"], "NEG": ["an worker sprays a pesticide onto a cooking pan from a spray gun using a TOOL in a forest", "an adult male sprays a pesticide onto a tablecloth from a spray using a TOOL in a wood", "an man sprays a pesticide onto a air from a container using a TOOL in a open air"]}], ["jumping_256.jpg", {"POS": ["an people jumps from a span over/through an obstacle (excluding the air) and will end up at a H2O at a river", "an people jumps from a bridge over/through an air (excluding the air) and will end up at a lake at a bridge", "an grownup jumps from a bridge over/through an obstacle (excluding the air) and will end up at a river at a open air"], "NEG": ["an people jumps from a span over/through an obstacle (excluding the air) and will end up at a stairs at a river", "an people jumps from a bridge over/through an air (excluding the air) and will end up at a pipage at a bridge", "an grownup jumps from a bridge over/through an obstacle (excluding the air) and will end up at a cup at a outdoors"]}], ["pouncing_198.jpg", {"POS": ["an domestic dog pounces onto the Equus caballus at a farm", "an domestic dog pounces onto the grass at a field", "an domestic dog pounces onto the destination at a open air"], "NEG": ["an dog pounces onto the chair at a farm", "an Canis familiaris pounces onto the rabbit at a field", "an dog pounces onto the parchment at a open"]}], ["taping_180.jpg", {"POS": ["an somebody tapes an limb to a destination at a room", "an woman tapes an gauze bandage to a dorsum at a room", "an soul tapes an tape to a individual at a place"], "NEG": ["an soul tapes an limb to a wrist joint at a room", "an woman tapes an gauze bandage to a grunge at a room", "an somebody tapes an tape to a pigment at a place"]}], ["spilling_113.jpg", {"POS": ["an man spills a beer from a stein onto a table at a eatery", "an duo spills a beer from a cup onto a body at a eatery", "an people spills a beer from a glass onto a apparel at a eating house"], "NEG": ["an man spills a beer from a beer mug onto a salad at a eatery", "an twosome spills a beer from a cup onto a casket at a eating house", "an people spills a beer from a glass onto a coaster at a restaurant"]}], ["pumping_200.jpg", {"POS": ["an Black woman pumps a H2O from a water pump to a pail using a lever at a outdoors", "an adult female pumps a water from a earth to a bucket using a pump at a out-of-doors", "an woman pumps a H2O from a land to a pail using a water pump at a open"], "NEG": ["an Black woman pumps a water from a water pump to a hole using a lever at a open", "an adult female pumps a water from a land to a supercilium using a pump at a open", "an adult female pumps a water from a ground to a tipper using a water pump at a open air"]}], ["leaping_214.jpg", {"POS": ["the dolphin leaps from the water over/through an obstacle to the water in the body of water", "the dolphin leaps from the water over/through an rope to the H2O in the open air", "the dolphin leaps from the H2O over/through an rope to the H2O in the pool"], "NEG": ["the dolphin leaps from the body of water over/through an obstacle to the flannel in the water", "the dolphin leaps from the H2O over/through an rope to the candy in the out-of-doors", "the dolphin leaps from the H2O over/through an rope to the test tube in the pool"]}], ["shelving_73.jpg", {"POS": ["the man shelves an book on a bookshelf in library.", "the adult male shelves an book on a shelf in room.", "the man shelves an book on a shelf in library."], "NEG": ["the adult male shelves an book on a turntable in library.", "the adult male shelves an book on a urban center in room.", "the man shelves an book on a distance in library."]}], ["fetching_267.jpg", {"POS": ["the nipper fetches the water from pool and brings it to bucket, in open air.", "the young lady fetches the H2O from brook and brings it to home, in out-of-doors.", "the people fetches the H2O from water and brings it to destination, in open."], "NEG": ["the nipper fetches the water from pool and brings it to hockey stick, in out-of-doors.", "the young lady fetches the H2O from brook and brings it to net, in open air.", "the people fetches the H2O from water and brings it to drawer, in out-of-doors."]}], ["spraying_49.jpg", {"POS": ["an adult female sprays a paint onto a picture from a tin using a TOOL in a workshop", "an woman sprays a liquid onto a paper from a tin using a TOOL in a room", "an woman sprays a H2O onto a parchment from a atomiser using a TOOL in a lab"], "NEG": ["an adult female sprays a pigment onto a twine from a tin using a TOOL in a workshop", "an woman sprays a liquid onto a display from a tin using a TOOL in a room", "an woman sprays a water onto a temple from a nebuliser using a TOOL in a laboratory"]}], ["pumping_63.jpg", {"POS": ["an man pumps a sludge from a ground to a motortruck using a truck at a exterior", "an adult male pumps a sewage from a septic tank to a motortruck using a hose at a outside", "an man pumps a waste product from a earth to a truck using a hosepipe at a land"], "NEG": ["an adult male pumps a sludge from a solid ground to a steps using a motortruck at a outside", "an man pumps a sewerage from a septic tank to a bedding using a hose at a outside", "an man pumps a waste from a solid ground to a wall using a hosepipe at a terra firma"]}], ["pumping_235.jpg", {"POS": ["an people pumps a cement from a concrete mixer to a ground using a hose at a out-of-doors", "an hard hat pumps a substance from a source to a ground using a pump at a construction", "an hard hat pumps a cement from a source to a terra firma using a hosepipe at a site"], "NEG": ["an people pumps a cement from a concrete mixer to a shoe using a hosepipe at a out-of-doors", "an hard hat pumps a substance from a source to a hairdo using a pump at a building", "an hard hat pumps a cement from a source to a mid-calf using a hose at a site"]}], ["pooing_256.jpg", {"POS": ["female poos onto a earth at a exterior", "young woman poos onto a dry land at a street", "human poos onto a solid ground at a sidewalk"], "NEG": ["female poos onto a coconut at a exterior", "young lady poos onto a volaille at a street", "human poos onto a puzzle at a pavement"]}], ["landing_0.jpg", {"POS": ["parachuter lands on a sand at a beach", "parachuter lands on a sand at a beach", "people lands on a ground at a beach"], "NEG": ["parachuter lands on a vase at a beach", "parachutist lands on a closet at a beach", "people lands on a bench at a beach"]}], ["dripping_21.jpg", {"POS": ["the domestic dog drips the water from the hose to the porch in the outside", "the domestic dog drips the water from the source to the solid ground in the pavement", "the dog drips the water from the hair to the flooring in the open"], "NEG": ["the Canis familiaris drips the H2O from the hose to the drawer in the outside", "the dog drips the H2O from the source to the bed in the sidewalk", "the dog drips the water from the hair to the storage warehouse in the out-of-doors"]}], ["raking_72.jpg", {"POS": ["an woman rakes an leaf from a earth into a cumulus at a front yard", "an woman rakes an foliage from a dry land into a agglomerate at a lawn", "an adult female rakes an leaf from a solid ground into a cumulation at a front yard"], "NEG": ["an adult female rakes an leafage from a land into a due north at a front yard", "an woman rakes an foliage from a ground into a platelet at a lawn", "an adult female rakes an foliage from a ground into a countertop at a front yard"]}], ["spraying_6.jpg", {"POS": ["an woman sprays a aroma onto a cervix from a bottle using a TOOL in a place", "an adult female sprays a liquid onto a face from a bottle using a TOOL in a place", "an woman sprays a aroma onto a face from a sprayer using a TOOL in a room"], "NEG": ["an adult female sprays a aroma onto a mat from a bottle using a TOOL in a place", "an woman sprays a liquid onto a steak from a bottle using a TOOL in a place", "an woman sprays a perfume onto a field from a nebuliser using a TOOL in a room"]}], ["stuffing_108.jpg", {"POS": ["the adult male stuffs the fries in the oral fissure at the restaurant", "the man stuffs the chips in the restaurant at the mouth", "the man stuffs the human face in the food at the eatery"], "NEG": ["the adult male stuffs the french fries in the bull at the eatery", "the man stuffs the french fries in the needle at the oral cavity", "the man stuffs the human face in the sauce at the eating place"]}], ["pumping_108.jpg", {"POS": ["an man pumps a gas from a storage to a auto using a gas pump at a gas station", "an person pumps a petrol from a storage to a motorcar using a gasoline pump at a filling station", "an individual pumps a gas from a hose to a gasoline tank using a pump at a gasoline tank"], "NEG": ["an adult male pumps a gas from a storage to a arts and crafts using a island dispenser at a petrol station", "an individual pumps a gasolene from a storage to a hoops using a gasoline pump at a petrol station", "an soul pumps a gas from a hosepipe to a meat using a pump at a petrol tank"]}], ["shelving_234.jpg", {"POS": ["the worker shelves an food on a shelf in food market.", "the employee shelves an can on a shelf in supermarket.", "the woman shelves an food on a shelf in store."], "NEG": ["the worker shelves an nutrient on a water ox in grocery store.", "the employee shelves an can on a fan in supermarket.", "the adult female shelves an nutrient on a outside in store."]}], ["injecting_11.jpg", {"POS": ["an medico injects a medicine from a syringe into a arm at a business office", "an person injects a liquid from a syringe into a arm at a place", "an MD injects a liquid from a syringe into a patient at a place"], "NEG": ["an Dr. injects a medicine from a syringe into a tarpaulin at a office", "an person injects a liquid from a syringe into a infinite at a place", "an Dr. injects a liquid from a syringe into a car seat at a place"]}], ["filling_169.jpg", {"POS": ["individual fills puddle with rock from garden cart at a open", "mortal fills hole with rock from wheelbarrow at a outside", "adult male fills cavity with stone from lawn cart at a outdoors"], "NEG": ["mortal fills stone with rock from garden cart at a out-of-doors", "individual fills audience with stone from barrow at a outside", "man fills knot with rock from barrow at a open air"]}], ["landing_9.jpg", {"POS": ["bird lands on a arm at a exterior", "bird of Jove lands on a arm at a outdoors", "Falco peregrinus lands on a paw at a rural area"], "NEG": ["bird lands on a flight deck at a exterior", "bird of Jove lands on a street at a open", "peregrine lands on a cupcake at a rural area"]}], ["stuffing_136.jpg", {"POS": ["the person stuffs the topping in the kitchen at the alimentary paste", "the cook stuffs the pasta in the filling at the kitchen", "the cook stuffs the cheese in the alimentary paste at the manus"], "NEG": ["the person stuffs the topping in the trailer at the alimentary paste", "the cook stuffs the pasta in the chassis at the kitchen", "the cook stuffs the cheese in the child at the manus"]}], ["landing_31.jpg", {"POS": ["airplane lands on a landing strip at a airport", "plane lands on a runway at a air", "plane lands on a runway at a airdrome"], "NEG": ["airplane lands on a plywood at a airdrome", "airplane lands on a rope at a air", "plane lands on a pillow at a drome"]}], ["stumbling_86.jpg", {"POS": ["an horseback rider stumbles onto a terra firma at a field", "an horse stumbles onto a destination at a field", "an horse stumbles onto a grass at a outdoors"], "NEG": ["an horseback rider stumbles onto a runway at a field", "an Equus caballus stumbles onto a desert at a field", "an horse stumbles onto a hose at a outdoors"]}], ["emptying_207.jpg", {"POS": ["an adult male empties an coin from a penny bank into a tabular array using a mitt in a table", "an adult male empties an change from a savings bank into a table using a manus in a room", "an Methuselah empties an coin from a penny bank into a table using a manus in a table"], "NEG": ["an man empties an coin from a penny bank into a board using a manus in a tabular array", "an adult male empties an change from a money box into a base using a mitt in a room", "an greybeard empties an coin from a piggy bank into a floater using a hand in a table"]}], ["pinning_212.jpg", {"POS": ["nipper is pinning the insignia onto a neckband in room.", "adult male is pinning the badge onto a adult female in ceremonial occasion.", "boy is pinning the pinned onto a shirt in inside."], "NEG": ["small fry is pinning the insignia onto a sewage works in room.", "man is pinning the badge onto a claw in observance.", "boy is pinning the pinned onto a metal drum in inside."]}], ["pinning_132.jpg", {"POS": ["adult male is pinning the adult male onto a floor in place.", "battler is pinning the battler onto a mat in building.", "man is pinning the man onto a ground in gym."], "NEG": ["adult male is pinning the adult male onto a stone in place.", "belligerent is pinning the combatant onto a garden in building.", "man is pinning the adult male onto a shelf in gymnasium."]}], ["shelving_38.jpg", {"POS": ["the woman shelves an box on a destination in room.", "the woman shelves an carton on a shelf in place.", "the worker shelves an shelf on a wall in storeroom."], "NEG": ["the woman shelves an box on a volaille in room.", "the adult female shelves an carton on a baby in place.", "the worker shelves an shelf on a stand in storeroom."]}], ["emptying_200.jpg", {"POS": ["an statue empties an water from a statue into a solid ground using a tool in a place", "an adult male empties an water from a pail into a terra firma using a arm in a exterior", "an man empties an water from a pail into a land using a manus in a place"], "NEG": ["an statue empties an H2O from a statue into a drink using a tool in a place", "an adult male empties an H2O from a bucket into a lamp using a arm in a outside", "an adult male empties an H2O from a pail into a pocket using a paw in a place"]}], ["pinning_213.jpg", {"POS": ["boy is pinning the flower onto a shirt in place.", "male child is pinning the flower onto a old man in place.", "male child is pinning the flower onto a shirt in place."], "NEG": ["male child is pinning the flower onto a basket in place.", "boy is pinning the flower onto a home in place.", "male child is pinning the flower onto a cake in place."]}], ["leaping_319.jpg", {"POS": ["the white shark leaps from the H2O over/through an obstacle to the water in the ocean", "the shark leaps from the body of water over/through an obstacle to the water in the ocean", "the shark leaps from the water over/through an obstacle to the water in the ocean"], "NEG": ["the Carcharodon carcharias leaps from the H2O over/through an obstacle to the labour in the ocean", "the shark leaps from the body of water over/through an obstacle to the younker in the ocean", "the shark leaps from the water over/through an obstacle to the glove in the ocean"]}], ["installing_152.jpg", {"POS": ["an adult male installs a faucet into a bathtub using a mitt at a bath", "an pipe fitter installs a showerhead into a tub using a spanner at a bath", "an adult male installs a showerhead into a bathtub using a manus at a bathroom"], "NEG": ["an adult male installs a spigot into a tobacco pipe using a mitt at a bath", "an pipe fitter installs a showerhead into a possessor using a wrench at a bathroom", "an man installs a showerhead into a audience using a hand at a bath"]}], ["pouring_41.jpg", {"POS": ["an somebody pours a water from a thermos flask to a man with a hand in a place", "an individual pours a water from a bottle to a man with a mitt in a family", "an adult female pours a water from a bottle to a caput with a mitt in a place"], "NEG": ["an person pours a H2O from a thermos to a genu with a mitt in a place", "an someone pours a H2O from a bottle to a wildebeest with a manus in a home", "an woman pours a water from a bottle to a coconut meat with a mitt in a place"]}], ["attaching_39.jpg", {"POS": ["an somebody attaches a label to a confect with ribbon using a finger at a place", "an someone attaches a thread to a giving with thread using a mitt at a indoor garden", "an somebody attaches a band to a finger with twine using a hand at a interior"], "NEG": ["an individual attaches a label to a cockpit with ribbon using a finger at a place", "an individual attaches a thread to a seat with yarn using a hand at a indoor garden", "an mortal attaches a ring to a goblet with string using a paw at a interior"]}], ["leaping_317.jpg", {"POS": ["the adult male leaps from the solid ground over/through an obstacle to the H2O in the river", "the adult male leaps from the ground over/through an obstacle to the body of water in the open air", "the man leaps from the dry land over/through an obstacle to the body of water in the open"], "NEG": ["the adult male leaps from the terra firma over/through an obstacle to the chain of mountains in the river", "the adult male leaps from the dry land over/through an obstacle to the pillow slip in the open", "the adult male leaps from the land over/through an obstacle to the shirt in the out-of-doors"]}], ["stumbling_135.jpg", {"POS": ["an baseball player stumbles onto a land at a baseball field", "an baseball player stumbles onto a ground at a baseball diamond", "an baseball player stumbles onto a soil at a diamond"], "NEG": ["an baseball player stumbles onto a midair at a diamond", "an baseball player stumbles onto a bay at a diamond", "an ballplayer stumbles onto a bed at a diamond"]}], ["leaping_49.jpg", {"POS": ["the Equus caballus leaps from the terra firma over/through an hedgerow to the ground in the open", "the horse leaps from the terra firma over/through an hedge to the earth in the field", "the Equus caballus leaps from the terra firma over/through an obstacle to the land in the open air"], "NEG": ["the Equus caballus leaps from the land over/through an hedgerow to the Gunter Grass in the open", "the Equus caballus leaps from the ground over/through an hedgerow to the mate in the field", "the Equus caballus leaps from the terra firma over/through an obstacle to the side in the open"]}], ["pouncing_95.jpg", {"POS": ["an cat pounces onto the land at a out-of-doors", "an cat pounces onto the grass at a backyard", "an true cat pounces onto the grass at a out-of-doors"], "NEG": ["an true cat pounces onto the bathroom at a outdoors", "an cat pounces onto the net at a backyard", "an cat pounces onto the shape at a open air"]}], ["slipping_178.jpg", {"POS": ["an horse slips onto a flooring at a interior", "an Equus caballus slips onto a earth at a outside", "an Equus caballus slips onto a floor at a exterior"], "NEG": ["an Equus caballus slips onto a tray at a interior", "an horse slips onto a lapel at a outside", "an Equus caballus slips onto a footballer at a exterior"]}], ["injecting_93.jpg", {"POS": ["an adult male injects a drug from a syringe into a arm at a outside", "an heroin addict injects a heroin from a syringe into a vein at a open air", "an man injects a drug from a syringe into a arm at a open air"], "NEG": ["an adult male injects a drug from a syringe into a trim at a exterior", "an heroin addict injects a diacetylmorphine from a syringe into a sewing machine at a open", "an adult male injects a drug from a syringe into a composition board at a out-of-doors"]}], ["tying_259.jpg", {"POS": ["an female ties an shoe to a foot using a shoelace at a earth", "an individual ties an shoe to a pes using a shoelace at a outdoors", "an person ties an shoe to a destination using a shoe string at a exterior"], "NEG": ["an female ties an shoe to a bathroom using a shoe string at a terra firma", "an person ties an shoe to a pastry dough using a shoe lace at a open air", "an somebody ties an shoe to a spool using a shoelace at a outside"]}], ["filling_148.jpg", {"POS": ["man fills basket with water from spigot at a place", "Black man fills ash bin with water from faucet at a outdoors", "adult male fills basket with water from faucet at a open"], "NEG": ["adult male fills couch with H2O from faucet at a place", "Black man fills ladder with H2O from spigot at a open", "adult male fills hide with water from faucet at a outdoors"]}], ["slipping_76.jpg", {"POS": ["an man slips onto a floor at a room", "an man slips onto a dry land at a room", "an adult male slips onto a flooring at a room"], "NEG": ["an man slips onto a hands at a room", "an adult male slips onto a casserole at a room", "an adult male slips onto a possessor at a room"]}], ["stuffing_122.jpg", {"POS": ["the adult female stuffs the sleeping bag in the suitcase at the home", "the adult female stuffs the sleeping bag in the room at the travelling bag", "the woman stuffs the pillow in the destination at the room"], "NEG": ["the adult female stuffs the sleeping bag in the elephant at the home", "the woman stuffs the sleeping bag in the infield at the grip", "the adult female stuffs the pillow in the clutches at the room"]}], ["ejecting_190.jpg", {"POS": ["an vent ejects an lava from a volcano toward a mount at a exterior", "an magma ejects an lava from a vent toward a ground at a open air", "an volcano ejects an lava from a volcano toward a air current at a open"], "NEG": ["an vent ejects an lava from a vent toward a wall at a outside", "an magma ejects an lava from a volcano toward a pair of tongs at a out-of-doors", "an volcano ejects an lava from a volcano toward a sugar cane at a open"]}], ["parachuting_83.jpg", {"POS": ["the man chuted using a chute to the earth at the sky.", "the person chuted using a chute to the ground at the sky.", "the person parachuted using a parachute to the destination at the sky."], "NEG": ["the man parachuted using a parachute to the necklace at the sky.", "the someone chuted using a chute to the cake at the sky.", "the person chuted using a chute to the stage at the sky."]}], ["fastening_52.jpg", {"POS": ["an adult male fastens an item into a plank with a screw using a drill at a place", "an someone fastens an board into a table with a screw using a screwdriver at a inside", "an mortal fastens an handgrip into a plank with a screw using a screwdriver at a interior"], "NEG": ["an man fastens an item into a batter with a screw using a drill at a place", "an somebody fastens an plank into a motor with a screw using a screwdriver at a inside", "an individual fastens an handle into a stage set with a screw using a screwdriver at a inside"]}], ["raking_2.jpg", {"POS": ["an man rakes an leafage from a ground into a ash-bin at a outside", "an man rakes an leaf from a earth into a wastebin at a yard", "an man rakes an leafage from a ground into a trash bin at a yard"], "NEG": ["an adult male rakes an leafage from a ground into a end at a outside", "an man rakes an leaf from a earth into a map at a curtilage", "an adult male rakes an foliage from a terra firma into a slot at a yard"]}], ["tying_180.jpg", {"POS": ["an female ties an shoe to a foot using a shoe string at a place", "an woman ties an shoe to a destination using a shoe string at a exterior", "an runner ties an shoelace to a foot using a shoe at a outside"], "NEG": ["an female ties an shoe to a bucket using a shoestring at a place", "an woman ties an shoe to a board using a shoelace at a exterior", "an runner ties an shoestring to a sales booth using a shoe at a exterior"]}], ["installing_106.jpg", {"POS": ["an adult male installs a pipage into a air conditioner using a paw at a outside", "an man installs a tube into a air conditioner using a mitt at a outside", "an man installs a pipe into a pipage using a mitt at a out-of-doors"], "NEG": ["an adult male installs a pipe into a cask using a manus at a outside", "an adult male installs a pipe into a Mason jar using a hand at a exterior", "an adult male installs a piping into a military uniform using a mitt at a outdoors"]}], ["landing_132.jpg", {"POS": ["chopper lands on a terra firma at a outdoors", "chopper lands on a grass at a field", "chopper lands on a earth at a field"], "NEG": ["whirlybird lands on a roof at a out-of-doors", "chopper lands on a jug at a field", "chopper lands on a coffin at a field"]}], ["pouncing_218.jpg", {"POS": ["an man pounces onto the man at a exterior", "an man pounces onto the adult male at a exterior", "an man pounces onto the adult male at a outside"], "NEG": ["an man pounces onto the goal at a outside", "an adult male pounces onto the fanny at a exterior", "an man pounces onto the chair at a exterior"]}], ["placing_125.jpg", {"POS": ["female placed dish in dishwashing machine along ALREADYdish in kitchen", "adult female placed dish in dishwasher along ALREADYdish in kitchen", "woman placed dish in dishwater along ALREADYdish in kitchen"], "NEG": ["female placed dish in physical object along ALREADYdish in kitchen", "adult female placed dish in van along ALREADYdish in kitchen", "adult female placed dish in barrel along ALREADYdish in kitchen"]}], ["jumping_85.jpg", {"POS": ["an people jumps from a land over/through an obstacle (excluding the air) and will end up at a land at a open air", "an people jumps from a land over/through an obstacle (excluding the air) and will end up at a dry land at a open", "an people jumps from a grass over/through an obstacle (excluding the air) and will end up at a grass at a outside"], "NEG": ["an people jumps from a soil over/through an obstacle (excluding the air) and will end up at a flight deck at a outdoors", "an people jumps from a dry land over/through an obstacle (excluding the air) and will end up at a girl at a open air", "an people jumps from a grass over/through an obstacle (excluding the air) and will end up at a pastry at a exterior"]}], ["stuffing_115.jpg", {"POS": ["the woman stuffs the solid food in the restaurant at the oral fissure", "the adult female stuffs the tater in the oral cavity at the kitchen", "the woman stuffs the nutrient in the human face at the eating house"], "NEG": ["the woman stuffs the solid food in the wire at the rima oris", "the adult female stuffs the white potato in the wayside at the kitchen", "the woman stuffs the nutrient in the fish at the restaurant"]}], ["raking_243.jpg", {"POS": ["an family rakes an leaf from a dry land into a pile at a front yard", "an menage rakes an foliage from a dry land into a sac at a yard", "an family unit rakes an leaf from a tree into a bag at a pace"], "NEG": ["an family unit rakes an leafage from a ground into a food at a front yard", "an household rakes an leaf from a solid ground into a garden at a yard", "an family unit rakes an leafage from a tree into a sward at a yard"]}], ["emerging_228.jpg", {"POS": ["the whale emerges from H2O to air in outside.", "the whale emerges from sea to open air in sea.", "the whale emerges from ocean to air in exterior."], "NEG": ["the whale emerges from water to rock in exterior.", "the whale emerges from sea to stick in ocean.", "the whale emerges from ocean to turkey in exterior."]}], ["plummeting_254.jpg", {"POS": ["the skydiver is plummeting from the plane toward the dry land in the air", "the skydiver is plummeting from the plane toward the ground in the sky", "the skydiver is plummeting from the plane toward the dry land in the sky"], "NEG": ["the skydiver is plummeting from the airplane toward the car seat in the air", "the skydiver is plummeting from the aeroplane toward the true cat in the sky", "the skydiver is plummeting from the airplane toward the surfboard in the sky"]}], ["pumping_90.jpg", {"POS": ["an mitt pumps a petrol from a container to a auto using a island dispenser at a filling station", "an individual pumps a gasolene from a storage to a motorcar using a petrol pump at a gasoline station", "an adult female pumps a gasoline from a storage tank to a gas tank using a gas pump at a gas station"], "NEG": ["an manus pumps a gasolene from a container to a ice rink using a petrol pump at a gas station", "an somebody pumps a gasolene from a storage to a cardboard using a gasoline pump at a petrol station", "an adult female pumps a gasoline from a tank to a hook using a gasoline pump at a petrol station"]}], ["pumping_20.jpg", {"POS": ["an individual pumps a gas from a storage to a motorcar using a gas pump at a filling station", "an someone pumps a petrol from a storage to a auto using a gasoline pump at a gas station", "an adult male pumps a gas from a storage to a auto using a gas pump at a filling station"], "NEG": ["an mortal pumps a gaseous state from a storage to a people using a gasoline pump at a gasoline station", "an soul pumps a gas from a storage to a barn using a petrol pump at a petrol station", "an man pumps a gasoline from a storage to a plane using a gas pump at a gasoline station"]}], ["strapping_116.jpg", {"POS": ["an someone straps the leg into a leg using a patch at a place", "an adult female straps the mortise joint into a destination using a bandage at a inside", "an woman straps the mortise joint into a ankle joint using a bandage at a place"], "NEG": ["an individual straps the leg into a skeleton using a bandage at a place", "an adult female straps the mortise joint into a lip using a patch at a interior", "an woman straps the articulatio talocruralis into a flower garden using a patch at a place"]}], ["pinning_182.jpg", {"POS": ["Black woman is pinning the insignia onto a officer in observance.", "adult female is pinning the insignia of rank onto a shirt in stage.", "woman is pinning the pinned onto a shirt in interior."], "NEG": ["Black woman is pinning the insignia onto a seat in ceremonial.", "woman is pinning the insignia of rank onto a miss in stage.", "adult female is pinning the pinned onto a target in inside."]}], ["jumping_236.jpg", {"POS": ["an beach buggy jumps from a sand over/through an obstacle (excluding the air) and will end up at a sand at a beach", "an motortruck jumps from a sand over/through an obstacle (excluding the air) and will end up at a sand at a beach", "an agent jumps from a terra firma over/through an obstacle (excluding the air) and will end up at a earth at a beach"], "NEG": ["an dune buggy jumps from a sand over/through an obstacle (excluding the air) and will end up at a soldier at a beach", "an truck jumps from a sand over/through an obstacle (excluding the air) and will end up at a hook at a beach", "an agent jumps from a dry land over/through an obstacle (excluding the air) and will end up at a stick at a beach"]}], ["pinning_147.jpg", {"POS": ["man is pinning the badge onto a shirt in place.", "police officer is pinning the insignia onto a police officer in ceremonial.", "adult female is pinning the medal onto a shirt in inside."], "NEG": ["man is pinning the badge onto a artistic creation in place.", "officer is pinning the insignia onto a fishing tackle in ceremonial occasion.", "woman is pinning the palm onto a course in interior."]}], ["milking_102.jpg", {"POS": ["an painting milks a source with a tool into a destination in a place", "an woman milks a moo-cow with a manus into a bucket in a barn", "an adult female milks a cow with a manus into a pail in a barnyard"], "NEG": ["an picture milks a source with a tool into a desktop in a place", "an adult female milks a cow with a manus into a goal in a barn", "an woman milks a cow with a paw into a grassland in a barnyard"]}], ["sliding_64.jpg", {"POS": ["the adult male slides the slider (when different from the adult male) on a stain to a home base at a diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a plate at a baseball game.", "the ballplayer slides the slider (when different from the ballplayer) on a ground to a first base at a diamond."], "NEG": ["the man slides the slider (when different from the man) on a grease to a gun at a ball field.", "the ballplayer slides the slider (when different from the ballplayer) on a sand to a horse at a baseball game.", "the baseball player slides the slider (when different from the baseball player) on a earth to a net at a baseball diamond."]}], ["putting_286.jpg", {"POS": ["an adult male puts an pastry into a plate in a kitchen", "an soul puts an solid food into a plate in a table", "an mortal puts an food into a plate in a room"], "NEG": ["an adult male puts an pastry into a plate in a kitchen", "an mortal puts an food into a tool in a table", "an mortal puts an food into a lake in a room"]}], ["pooing_29.jpg", {"POS": ["dog poos onto a field at a outside", "domestic dog poos onto a solid ground at a woods", "domestic dog poos onto a land at a outdoors"], "NEG": ["dog poos onto a window frame at a exterior", "dog poos onto a float at a woods", "Canis familiaris poos onto a right at a out-of-doors"]}], ["emptying_30.jpg", {"POS": ["an male child empties an coin from a container into a table using a mitt in a inside", "an male child empties an money from a jar into a table using a manus in a interior", "an boy empties an coin from a jar into a table using a mitt in a room"], "NEG": ["an boy empties an coin from a container into a drop using a paw in a interior", "an male child empties an money from a jar into a hose using a manus in a inside", "an boy empties an coin from a jar into a chicken coop using a mitt in a room"]}], ["pouncing_212.jpg", {"POS": ["an cat pounces onto the toy at a inside", "an cat pounces onto the plaything at a inside", "an young carnivore pounces onto the destination at a room"], "NEG": ["an cat pounces onto the car seat at a interior", "an cat pounces onto the barn at a inside", "an cub pounces onto the articulatio genus at a room"]}], ["pinning_114.jpg", {"POS": ["man is pinning the man onto a corsage in out-of-doors.", "adult male is pinning the flower onto a breast pocket in open.", "adult male is pinning the flower onto a shirt in place."], "NEG": ["man is pinning the adult male onto a wrestling mat in open air.", "adult male is pinning the flower onto a harvest in outdoors.", "adult male is pinning the flower onto a nail in place."]}], ["pumping_77.jpg", {"POS": ["an mortal pumps a air from a air to a soccer ball using a air pump at a inside", "an adult male pumps a air from a air to a soccer ball using a air pump at a interior", "an mortal pumps a air from a air to a ball using a hand pump at a interior"], "NEG": ["an individual pumps a air from a air to a rat using a vacuum pump at a inside", "an man pumps a air from a air to a space using a air pump at a interior", "an person pumps a air from a air to a biscuit using a hand pump at a inside"]}], ["sprinkling_268.jpg", {"POS": ["an somebody sprinkles an item from a measuring cup onto a nutrient at a place", "an person sprinkles an flavoring from a cup onto a coconut at a griddle", "an individual sprinkles an flavoring from a cup onto a chicken at a pan"], "NEG": ["an somebody sprinkles an item from a measuring cup onto a manpower at a place", "an individual sprinkles an seasoning from a cup onto a opening at a griddle", "an someone sprinkles an flavoring from a cup onto a head at a cooking pan"]}], ["stumbling_44.jpg", {"POS": ["an woman stumbles onto a floor at a inside", "an woman stumbles onto a dry land at a walk", "an adult female stumbles onto a land at a airport terminal"], "NEG": ["an adult female stumbles onto a claw at a interior", "an adult female stumbles onto a tree at a walkway", "an woman stumbles onto a sports jacket at a airport terminal"]}], ["filling_54.jpg", {"POS": ["nipper fills cup with H2O from spigot at a kitchen", "girl fills cup with H2O from tap at a kitchen", "girl fills cup with water from spigot at a kitchen"], "NEG": ["minor fills harness with H2O from faucet at a kitchen", "female child fills pizza with H2O from hydrant at a kitchen", "little girl fills motorbus with water from spigot at a kitchen"]}], ["strapping_83.jpg", {"POS": ["an paramedical straps the woman into a stretcher using a strap at a outdoors", "an primary care provider straps the casualty into a stretcher using a strap at a open", "an paramedical straps the adult female into a board using a strap at a road"], "NEG": ["an paramedical straps the adult female into a syringe using a strap at a open air", "an health professional straps the casualty into a possessor using a strap at a open", "an paramedic straps the woman into a framework using a strap at a road"]}], ["loading_300.jpg", {"POS": ["the adult male loads a truck bed with an cargo container using a crane at a wharf.", "the man loads a truck with an crate using a crane at a outdoors.", "the man loads a motortruck with an crate using a crane at a parking lot."], "NEG": ["the man loads a hook with an cargo container using a crane at a dock.", "the adult male loads a string with an crate using a crane at a open air.", "the man loads a uphill with an crate using a crane at a park."]}], ["jumping_249.jpg", {"POS": ["an people jumps from a boat over/through an obstacle (excluding the air) and will end up at a water at a ocean", "an people jumps from a boat over/through an obstacle (excluding the air) and will end up at a boat at a ocean", "an adult jumps from a boat over/through an obstacle (excluding the air) and will end up at a body of water at a ocean"], "NEG": ["an people jumps from a boat over/through an obstacle (excluding the air) and will end up at a brick at a ocean", "an people jumps from a boat over/through an obstacle (excluding the air) and will end up at a balloon at a ocean", "an adult jumps from a boat over/through an obstacle (excluding the air) and will end up at a rod at a ocean"]}], ["putting_152.jpg", {"POS": ["an man puts an baseball mitt into a hand in a room", "an man puts an glove into a paw in a place", "an adult male puts an glove into a hand in a place"], "NEG": ["an man puts an glove into a net in a room", "an man puts an glove into a jar in a place", "an man puts an glove into a water bottle in a place"]}], ["filling_34.jpg", {"POS": ["individual fills bowl with marble from bowl at a room", "someone fills bowl with lump from container at a kitchen", "somebody fills container with bubble bath from container at a bathroom"], "NEG": ["individual fills puzzle with marble from bowl at a room", "individual fills flower garden with glob from container at a kitchen", "person fills desktop with bubble bath from container at a bathroom"]}], ["sliding_60.jpg", {"POS": ["the fille slides the slider (when different from the fille) on a grass to a soccer ball at a domain.", "the people slides the slider (when different from the people) on a grass to a destination at a outside.", "the soccer player slides the slider (when different from the soccer player) on a grass to a ground at a athletic field."], "NEG": ["the fille slides the slider (when different from the fille) on a grass to a field at a sphere.", "the people slides the slider (when different from the people) on a grass to a volaille at a outside.", "the soccer player slides the slider (when different from the soccer player) on a grass to a router at a field."]}], ["pumping_191.jpg", {"POS": ["an individual pumps a air from a air to a tubing using a vacuum pump at a pool", "an individual pumps a air from a air to a floater using a air pump at a natatorium", "an mortal pumps a air from a air to a float using a air pump at a swimming pool"], "NEG": ["an soul pumps a air from a air to a latch using a air pump at a pool", "an somebody pumps a air from a air to a sport utility using a air pump at a swimming pool", "an mortal pumps a air from a air to a mouse using a vacuum pump at a swimming bath"]}], ["attaching_331.jpg", {"POS": ["an boy attaches a toy to a raceway with manus using a hand at a flooring", "an tike attaches a toy to a track with pressing using a mitt at a floor", "an male child attaches a toy to a toy with glue using a mitt at a room"], "NEG": ["an boy attaches a plaything to a dummy with paw using a manus at a floor", "an kid attaches a toy to a alphabetic character with pressing using a manus at a floor", "an male child attaches a toy to a house with glue using a paw at a room"]}], ["deflecting_24.jpg", {"POS": ["the goaltender deflected the puck to the net at the ice.", "the hockey player deflected the hockey puck to the side at the hockey player.", "the netkeeper deflected the puck to the destination at the ice."], "NEG": ["the goaltender deflected the puck to the henhouse at the ice.", "the hockey player deflected the puck to the base at the hockey player.", "the goalkeeper deflected the puck to the meshing at the ice."]}], ["spraying_165.jpg", {"POS": ["an adult male sprays a pepper spray onto a eye from a can using a TOOL in a exterior", "an adult male sprays a pepper spray onto a dummy from a aerosol using a TOOL in a outdoors", "an adult male sprays a H2O onto a dummy from a bottle using a TOOL in a open"], "NEG": ["an man sprays a pepper spray onto a coat from a tin using a TOOL in a outside", "an man sprays a pepper spray onto a crop from a aerosol container using a TOOL in a open", "an adult male sprays a H2O onto a mat from a bottle using a TOOL in a open air"]}], ["emptying_160.jpg", {"POS": ["an adult male empties an crate from a table into a bin using a hand in a exterior", "an man empties an water from a storage tank into a tank using a man in a soma", "an man empties an item from a container into a destination using a hand in a outside"], "NEG": ["an man empties an crate from a table into a pocketbook using a hand in a exterior", "an adult male empties an water from a tank into a turntable using a man in a soma", "an man empties an item from a container into a bolt using a hand in a exterior"]}], ["raking_272.jpg", {"POS": ["an adult female rakes an leafage from a terra firma into a agglomerate at a yard", "an woman rakes an soil from a ground into a ground at a outdoors", "an woman rakes an soil from a earth into a dry land at a outside"], "NEG": ["an adult female rakes an leafage from a ground into a owner at a curtilage", "an woman rakes an dirt from a solid ground into a window at a out-of-doors", "an woman rakes an soil from a earth into a object at a exterior"]}], ["jumping_153.jpg", {"POS": ["an adult male jumps from a drop-off over/through an obstacle (excluding the air) and will end up at a cliff at a outdoors", "an man jumps from a drop over/through an cavity (excluding the air) and will end up at a drop at a outdoors", "an adult male jumps from a drop-off over/through an obstacle (excluding the air) and will end up at a drop at a open"], "NEG": ["an man jumps from a drop-off over/through an obstacle (excluding the air) and will end up at a milk can at a outdoors", "an man jumps from a drop over/through an pit (excluding the air) and will end up at a bin at a open", "an man jumps from a cliff over/through an obstacle (excluding the air) and will end up at a trailer at a outdoors"]}], ["loading_138.jpg", {"POS": ["the people loads a truck with an box using a mitt at a outdoors.", "the people loads a motorcar with an box using a arm at a out-of-doors.", "the people loads a car with an box using a hand at a exterior."], "NEG": ["the people loads a cony with an box using a mitt at a out-of-doors.", "the people loads a truck bed with an box using a arm at a open.", "the people loads a batter with an box using a manus at a exterior."]}], ["leaking_167.jpg", {"POS": ["a H2O leaks from a hosepipe onto/into a earth at a outside", "a H2O leaks from a whirlybird onto/into a dry land at a out-of-doors", "a water leaks from a chopper onto/into a grass at a railway system"], "NEG": ["a H2O leaks from a hosepipe onto/into a laptop computer at a outside", "a water leaks from a whirlybird onto/into a shoe at a open air", "a water leaks from a chopper onto/into a deck at a railroad line"]}], ["filling_17.jpg", {"POS": ["shaver fills pitcher with H2O from spigot at a kitchen", "little girl fills pitcher with water from water faucet at a kitchen", "faucet fills pitcher with water from spout at a kitchen"], "NEG": ["nipper fills carpeting with water from faucet at a kitchen", "female child fills vat with water from water tap at a kitchen", "faucet fills cake with water from spout at a kitchen"]}], ["fastening_241.jpg", {"POS": ["an mortal fastens an plank into a beam with a screw using a drill at a place", "an somebody fastens an plank into a board with a screw using a power tool at a outside", "an someone fastens an beam into a underframe with a screw using a drill at a place"], "NEG": ["an soul fastens an board into a desk with a screw using a drill at a place", "an somebody fastens an board into a outer space with a screw using a power tool at a exterior", "an soul fastens an beam into a suit of clothes with a screw using a drill at a place"]}], ["parachuting_261.jpg", {"POS": ["the physical object parachuted using a parachute to the land at the ground.", "the people chuted using a chute to the dry land at the sky.", "the motortruck parachuted using a parachute to the land at the sky."], "NEG": ["the object parachuted using a parachute to the goal at the dry land.", "the people chuted using a chute to the crowd at the sky.", "the truck parachuted using a parachute to the net at the sky."]}], ["jumping_243.jpg", {"POS": ["an Equus caballus jumps from a earth over/through an hurdle (excluding the air) and will end up at a ground at a race", "an rider jumps from a terra firma over/through an pole (excluding the air) and will end up at a ground at a competition", "an Equus caballus jumps from a terra firma over/through an barricade (excluding the air) and will end up at a ground at a racecourse"], "NEG": ["an horse jumps from a ground over/through an hurdle (excluding the air) and will end up at a quilt at a race", "an rider jumps from a solid ground over/through an pole (excluding the air) and will end up at a basketball player at a competition", "an horse jumps from a ground over/through an barricade (excluding the air) and will end up at a baseboard at a racetrack"]}], ["pinning_177.jpg", {"POS": ["man is pinning the insignia onto a collar in room.", "soldier is pinning the insignia onto a woman in ceremonial occasion.", "adult male is pinning the pinned onto a adult female in inside."], "NEG": ["man is pinning the insignia onto a woodwork in room.", "soldier is pinning the insignia onto a jug in ceremony.", "adult male is pinning the pinned onto a exterior in inside."]}], ["installing_17.jpg", {"POS": ["an man installs a rod into a shelf using a paw at a room", "an adult male installs a metal into a shelf using a tool at a room", "an adult male installs a pipe into a wall using a screwdriver at a interior"], "NEG": ["an adult male installs a rod into a cafeteria using a manus at a room", "an adult male installs a metal into a kitchen using a tool at a room", "an adult male installs a pipe into a graybeard using a screwdriver at a inside"]}], ["landing_49.jpg", {"POS": ["bird of Jove lands on a branch at a open air", "Haliaeetus leucocephalus lands on a branch at a tree", "bird of Jove lands on a stick at a open air"], "NEG": ["bird of Jove lands on a neck at a out-of-doors", "American eagle lands on a ambulance at a tree", "eagle lands on a dummy at a out-of-doors"]}], ["shelving_157.jpg", {"POS": ["the adult female shelves an shampoo on a shelf in store.", "the adult female shelves an lotion on a shelf in place.", "the adult female shelves an bottle on a shelf in interior."], "NEG": ["the adult female shelves an shampoo on a stone in store.", "the adult female shelves an lotion on a home in place.", "the adult female shelves an bottle on a bowl in interior."]}], ["lathering_0.jpg", {"POS": ["an adult female lathers a shaving cream into a human face at a beauty parlour", "an adult female lathers a soap into a human face at a salon", "an man lathers a shaving soap into a human face at a salon"], "NEG": ["an woman lathers a shaving soap into a flap at a beauty parlour", "an adult female lathers a soap into a cushion at a salon", "an man lathers a shaving soap into a cutis at a beauty parlour"]}], ["jumping_41.jpg", {"POS": ["an jockey jumps from a land over/through an fencing (excluding the air) and will end up at a ground at a open", "an horse jumps from a dry land over/through an hurdle (excluding the air) and will end up at a land at a path", "an equestrian jumps from a land over/through an hurdle (excluding the air) and will end up at a land at a hurdle race"], "NEG": ["an jockey jumps from a solid ground over/through an fence (excluding the air) and will end up at a pot at a outdoors", "an Equus caballus jumps from a solid ground over/through an hurdle (excluding the air) and will end up at a desert at a course", "an horseman jumps from a dry land over/through an hurdle (excluding the air) and will end up at a meat at a hurdling"]}], ["emptying_63.jpg", {"POS": ["an boy empties an scrap from a box into a bag using a manus in a schoolroom", "an boy empties an paper from a box into a plastic bag using a manus in a classroom", "an people empties an paper from a box into a bag using a manus in a interior"], "NEG": ["an boy empties an scrap from a box into a hare using a mitt in a schoolroom", "an boy empties an paper from a box into a tipper using a hand in a classroom", "an people empties an paper from a box into a Erlenmeyer flask using a manus in a inside"]}], ["landing_191.jpg", {"POS": ["eggbeater lands on a earth at a road", "helicopter lands on a earth at a out-of-doors", "eggbeater lands on a earth at a out-of-doors"], "NEG": ["eggbeater lands on a tray at a road", "eggbeater lands on a Kitty Litter at a open", "chopper lands on a slugger at a out-of-doors"]}], ["sliding_227.jpg", {"POS": ["the baseball player slides the slider (when different from the baseball player) on a terra firma to a bag at a diamond.", "the baseball player slides the slider (when different from the baseball player) on a dirt to a home base at a ball field.", "the baseball player slides the slider (when different from the baseball player) on a solid ground to a bag at a diamond."], "NEG": ["the ballplayer slides the slider (when different from the ballplayer) on a solid ground to a paper at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a soil to a floater at a diamond.", "the ballplayer slides the slider (when different from the ballplayer) on a earth to a edge at a infield."]}], ["shelving_194.jpg", {"POS": ["the people shelves an nutrient on a shelf in shop.", "the worker shelves an grocery on a shelf in grocery.", "the adult female shelves an foodstuff on a shelf in store."], "NEG": ["the people shelves an food on a trailer in shop.", "the worker shelves an foodstuff on a toe in grocery.", "the woman shelves an foodstuff on a breeze block in shop."]}], ["stumbling_3.jpg", {"POS": ["an man stumbles onto a flooring at a staircase", "an man stumbles onto a step at a staircase", "an adult male stumbles onto a terra firma at a staircase"], "NEG": ["an man stumbles onto a uphill at a staircase", "an man stumbles onto a rugby at a stairway", "an man stumbles onto a Grass at a stairway"]}], ["slipping_164.jpg", {"POS": ["an woman slips onto a land at a stage", "an adult female slips onto a floor at a stage", "an adult female slips onto a stage at a concert hall"], "NEG": ["an adult female slips onto a stick at a stage", "an adult female slips onto a Mason jar at a stage", "an woman slips onto a belt at a concert hall"]}], ["milking_31.jpg", {"POS": ["an woman milks a simulation with a paw into a pail in a open air", "an adult female milks a cow with a mitt into a pail in a exterior", "an woman milks a cows with a milking machine into a pail in a outdoors"], "NEG": ["an woman milks a simulation with a paw into a window frame in a open", "an adult female milks a cow with a manus into a slip in a outside", "an woman milks a cows with a milking machine into a lid in a outdoors"]}], ["spilling_0.jpg", {"POS": ["an agent spills a java from a source onto a cup at a table", "an agent spills a coffee from a source onto a cup at a place", "an agent spills a liquid from a cup onto a table at a interior"], "NEG": ["an agent spills a java from a source onto a canister at a table", "an agent spills a coffee from a source onto a nail at a place", "an agent spills a liquid from a cup onto a metacarpophalangeal joint at a inside"]}], ["milking_99.jpg", {"POS": ["an person milks a cow with a manus into a bucket in a farm", "an farmer milks a cow with a paw into a pail in a barn", "an mortal milks a cow with a mitt into a bucket in a barn"], "NEG": ["an person milks a cow with a paw into a rifle in a farm", "an granger milks a moo-cow with a hand into a hair in a barn", "an somebody milks a cow with a manus into a exhibit in a barn"]}], ["plunging_127.jpg", {"POS": ["an man plunges a mortal (when different than the man) into a water at a place", "an people plunges a physical structure (when different than the people) into a water at a ocean", "an people plunges a plunged (when different than the people) into a water at a place"], "NEG": ["an man plunges a somebody (when different than the man) into a ambulance at a place", "an people plunges a organic structure (when different than the people) into a soldier at a ocean", "an people plunges a plunged (when different than the people) into a crop at a place"]}], ["landing_128.jpg", {"POS": ["aeroplane lands on a ground at a outdoors", "propeller plane lands on a runway at a airstrip", "airplane lands on a flight strip at a open"], "NEG": ["airplane lands on a lawn at a open air", "propeller plane lands on a patch at a airstrip", "airplane lands on a bowl at a open air"]}], ["emerging_83.jpg", {"POS": ["the female emerges from H2O to air in body of water.", "the woman emerges from H2O to water in beach.", "the adult female emerges from water to air in ocean."], "NEG": ["the female emerges from water to bookshelf in body of water.", "the adult female emerges from H2O to slot in beach.", "the woman emerges from water to foot in ocean."]}], ["spilling_108.jpg", {"POS": ["an woman spills a drink from a cup onto a tabular array at a outside", "an woman spills a red wine from a cup onto a tablecloth at a outside", "an adult female spills a wine from a glass onto a table at a open"], "NEG": ["an woman spills a drink from a cup onto a fox at a outside", "an adult female spills a red wine from a cup onto a cabinet at a exterior", "an adult female spills a vino from a glass onto a grime at a open air"]}], ["pooing_249.jpg", {"POS": ["female child poos onto a toilet at a bath", "young woman poos onto a can at a bath", "young lady poos onto a lavatory at a bathroom"], "NEG": ["female child poos onto a sign at a bath", "girl poos onto a lavatory at a bath", "young lady poos onto a air at a bathroom"]}], ["strapping_78.jpg", {"POS": ["an old man straps the greybeard into a car seat using a seat belt at a auto", "an adult male straps the body into a car seat using a seatbelt at a auto-mechanic", "an adult male straps the Methuselah into a car seat using a seatbelt at a place"], "NEG": ["an greybeard straps the graybeard into a traveling bag using a seatbelt at a car", "an man straps the body into a ceiling using a seat belt at a mechanic", "an man straps the Methuselah into a finger using a seat belt at a place"]}], ["placing_72.jpg", {"POS": ["someone placed napkin in table along ALREADYnapkin in place", "person placed table napkin in plate along ALREADYtable napkin in room", "someone placed napkin in plate along ALREADYnapkin in table"], "NEG": ["person placed table napkin in sweater along ALREADYtable napkin in place", "person placed serviette in pedestal along ALREADYserviette in room", "mortal placed table napkin in bag along ALREADYtable napkin in table"]}], ["slipping_12.jpg", {"POS": ["an tennis player slips onto a dry land at a tennis court", "an tennis player slips onto a land at a tennis court", "an professional tennis player slips onto a solid ground at a tennis court"], "NEG": ["an tennis player slips onto a policeman at a tennis court", "an tennis player slips onto a fish at a tennis court", "an tennis pro slips onto a staircase at a tennis court"]}], ["pooing_218.jpg", {"POS": ["dog poos onto a mulch at a curbing", "domestic dog poos onto a stone at a outdoors", "domestic dog poos onto a dirt at a exterior"], "NEG": ["domestic dog poos onto a desert at a kerb", "Canis familiaris poos onto a storage tank at a out-of-doors", "Canis familiaris poos onto a crop at a outside"]}], ["emptying_26.jpg", {"POS": ["an girl empties an trash from a bucket into a dustbin using a manus in a open air", "an soul empties an trash from a bucket into a garbage using a manus in a interior", "an female child empties an trash from a bucket into a trash can using a paw in a inside"], "NEG": ["an young lady empties an rubbish from a bucket into a plastic using a hand in a out-of-doors", "an mortal empties an trash from a bucket into a pocket using a manus in a inside", "an girl empties an trash from a pail into a tum using a mitt in a inside"]}], ["placing_200.jpg", {"POS": ["man placed bird in table along ALREADYbird in room", "man placed bird in table along ALREADYbird in front room", "adult male placed bucket in table along ALREADYbucket in sofa"], "NEG": ["adult male placed bird in rooftop along ALREADYbird in room", "man placed bird in sewage works along ALREADYbird in living room", "adult male placed pail in deer along ALREADYpail in sofa"]}], ["milking_59.jpg", {"POS": ["an husbandman milks a milcher with a mitt into a pail in a barn", "an man milks a cow with a paw into a bucket in a farm", "an sodbuster milks a cow with a mitt into a bucket in a barn"], "NEG": ["an husbandman milks a milker with a manus into a ladder in a barn", "an adult male milks a cow with a paw into a shoe in a farm", "an farmer milks a cow with a manus into a ownership in a barn"]}], ["putting_283.jpg", {"POS": ["an individual puts an paper into a box in a place", "an somebody puts an balloting into a ballot box in a place", "an somebody puts an paper into a box in a interior"], "NEG": ["an mortal puts an paper into a stone in a place", "an person puts an vote into a bin in a place", "an somebody puts an paper into a steel wool in a interior"]}], ["slipping_193.jpg", {"POS": ["an man slips onto a dry land at a staircase", "an adult male slips onto a earth at a steps", "an man slips onto a step at a place"], "NEG": ["an man slips onto a rack at a staircase", "an man slips onto a elevator shaft at a steps", "an man slips onto a sink at a place"]}], ["emptying_197.jpg", {"POS": ["an people empties an water from a bucket into a someone using a mitt in a room", "an individual empties an water from a tray into a individual using a paw in a room", "an people empties an H2O from a pail into a caput using a paw in a can"], "NEG": ["an people empties an H2O from a pail into a adult male using a hand in a room", "an somebody empties an H2O from a tray into a aerodrome using a mitt in a room", "an people empties an H2O from a bucket into a patient using a paw in a can"]}], ["emptying_190.jpg", {"POS": ["an adult male empties an item from a box into a cask using a hand in a exterior", "an adult male empties an grass from a box into a compost heap using a manus in a outside", "an someone empties an trash from a box into a cask using a manus in a out-of-doors"], "NEG": ["an adult male empties an item from a box into a shoe using a paw in a outside", "an man empties an grass from a box into a potty chair using a manus in a outside", "an soul empties an rubbish from a box into a clinker block using a hand in a outdoors"]}], ["pumping_82.jpg", {"POS": ["an female pumps a fuel from a pump to a car using a mitt at a gasoline station", "an adult female pumps a gas from a storage to a motorcar using a gas pump at a filling station", "an adult female pumps a gaseous state from a storage to a car using a gasoline pump at a petrol station"], "NEG": ["an female pumps a fuel from a pump to a roof using a hand at a gasoline station", "an woman pumps a gasoline from a storage to a ring using a gasoline pump at a gas station", "an woman pumps a gaseous state from a storage to a bookshelf using a gas pump at a petrol station"]}], ["placing_283.jpg", {"POS": ["shaver placed silverware in cabinet along ALREADYsilverware in kitchen", "fille placed lieutenant in drawer along ALREADYlieutenant in kitchen", "girl placed silverware in drawer along ALREADYsilverware in kitchen"], "NEG": ["shaver placed silverware in cable along ALREADYsilverware in kitchen", "young woman placed lieutenant in basketball player along ALREADYlieutenant in kitchen", "miss placed silverware in laptop along ALREADYsilverware in kitchen"]}], ["leaking_99.jpg", {"POS": ["a water leaks from a piping onto/into a land at a room", "a H2O leaks from a ceiling onto/into a destination at a place", "a water leaks from a source onto/into a flooring at a basement"], "NEG": ["a H2O leaks from a pipe onto/into a rod at a room", "a H2O leaks from a ceiling onto/into a teeing ground at a place", "a H2O leaks from a source onto/into a rack at a cellar"]}], ["attaching_190.jpg", {"POS": ["an adult female attaches a wire to a pearl with glue using a paw at a room", "an soul attaches a bead to a twine with glue using a tool at a place", "an woman attaches a bead to a chain with ribbon using a manus at a table"], "NEG": ["an woman attaches a wire to a optical lens with glue using a paw at a room", "an individual attaches a bead to a chicken coop with glue using a tool at a place", "an woman attaches a bead to a first with ribbon using a mitt at a table"]}], ["applying_306.jpg", {"POS": ["woman is applying a conditioner to a hair using brush in a place.", "adult female is applying a hair coloring to a hair using brush in a place.", "adult female is applying a shampoo to a hair using brush in a lavatory."], "NEG": ["woman is applying a conditioner to a kitchen table using brush in a place.", "adult female is applying a hair dye to a rima oris using brush in a place.", "adult female is applying a shampoo to a edifice using brush in a bathroom."]}], ["emptying_35.jpg", {"POS": ["an individual empties an yolk from a shell into a cup using a mitt in a kitchen", "an individual empties an eggs from a egg into a bowl using a tool in a room", "an somebody empties an egg from a bowl into a bowl using a hand in a place"], "NEG": ["an person empties an egg yolk from a shell into a ambulance using a paw in a kitchen", "an soul empties an eggs from a eggs into a beaker using a tool in a room", "an person empties an egg from a bowl into a young man using a manus in a place"]}], ["raking_242.jpg", {"POS": ["an minor rakes an leaf from a solid ground into a cumulus at a yard", "an people rakes an foliage from a terra firma into a pile at a lawn", "an shaver rakes an leaf from a tree into a pile at a yard"], "NEG": ["an fry rakes an foliage from a ground into a small fry at a curtilage", "an people rakes an leafage from a land into a mannequin at a lawn", "an tyke rakes an leaf from a tree into a ice-hockey rink at a yard"]}], ["leaping_176.jpg", {"POS": ["the dolphin leaps from the water over/through an obstacle to the H2O in the body of water", "the dolphin leaps from the water over/through an obstacle to the H2O in the ocean", "the dolphinfish leaps from the body of water over/through an obstacle to the water in the outdoors"], "NEG": ["the dolphin leaps from the H2O over/through an obstacle to the prey in the body of water", "the dolphin leaps from the water over/through an obstacle to the creature in the ocean", "the dolphinfish leaps from the water over/through an obstacle to the bath in the out-of-doors"]}], ["slipping_48.jpg", {"POS": ["an boy slips onto a pool at a open air", "an male child slips onto a pond at a outdoors", "an swain slips onto a water at a pool"], "NEG": ["an male child slips onto a pistol at a outdoors", "an male child slips onto a extractor at a open", "an young man slips onto a board at a pool"]}], ["spraying_200.jpg", {"POS": ["an officer sprays a Chemical Mace onto a student from a bottle using a TOOL in a walkway", "an police officer sprays a mace onto a crowd from a aerosol bomb using a TOOL in a sidewalk", "an police force sprays a spray onto a people from a bottle using a TOOL in a street"], "NEG": ["an officer sprays a Chemical Mace onto a windshield from a bottle using a TOOL in a walkway", "an officer sprays a mace onto a funnel from a aerosol container using a TOOL in a pavement", "an law sprays a spray onto a potty chair from a bottle using a TOOL in a street"]}], ["jumping_190.jpg", {"POS": ["an horse jumps from a earth over/through an hurdle (excluding the air) and will end up at a ground at a course", "an horse jumps from a solid ground over/through an fencing (excluding the air) and will end up at a dry land at a competition", "an Equus caballus jumps from a dry land over/through an barricade (excluding the air) and will end up at a ground at a track"], "NEG": ["an horse jumps from a ground over/through an hurdle (excluding the air) and will end up at a ewer at a track", "an Equus caballus jumps from a solid ground over/through an fence (excluding the air) and will end up at a rugby at a contest", "an Equus caballus jumps from a ground over/through an barricade (excluding the air) and will end up at a grapevine at a racecourse"]}], ["loading_242.jpg", {"POS": ["the adult female loads a jitney with an baggage using a hand at a exterior.", "the people loads a double-decker with an baggage using a paw at a park.", "the people loads a charabanc with an luggage using a mitt at a open."], "NEG": ["the adult female loads a fireman with an luggage using a paw at a exterior.", "the people loads a flask with an luggage using a hand at a car park.", "the people loads a goal with an baggage using a mitt at a open air."]}], ["putting_71.jpg", {"POS": ["an reenactor puts an blanket into a destination in a open air", "an woman puts an mantle into a dorsum in a field", "an reenactor puts an stuff into a bag in a out-of-doors"], "NEG": ["an reenactor puts an cover into a rubbish in a open air", "an adult female puts an cape into a tike in a field", "an reenactor puts an stuff into a washbowl in a out-of-doors"]}], ["leaping_198.jpg", {"POS": ["the ski jumper leaps from the snow over/through an obstacle to the snow in the mount", "the skier leaps from the snow over/through an obstacle to the snow in the slope", "the somebody leaps from the slope over/through an obstacle to the air in the mountain"], "NEG": ["the ski jumper leaps from the snow over/through an obstacle to the baseball glove in the mountain", "the skier leaps from the snow over/through an obstacle to the carrot in the slope", "the someone leaps from the slope over/through an obstacle to the prey in the mount"]}], ["plunging_177.jpg", {"POS": ["an people plunges a plunged (when different than the people) into a water at a lake", "an people plunges a organic structure (when different than the people) into a H2O at a ocean", "an people plunges a body (when different than the people) into a water at a water"], "NEG": ["an people plunges a plunged (when different than the people) into a jar at a lake", "an people plunges a physical structure (when different than the people) into a peck at a ocean", "an people plunges a organic structure (when different than the people) into a lake at a water"]}], ["pumping_214.jpg", {"POS": ["an adult male pumps a petrol from a storage tank to a gasoline tank using a petrol pump at a gasoline station", "an mortal pumps a gasolene from a storage to a machine using a petrol pump at a filling station", "an mortal pumps a gasoline from a source to a car using a island dispenser at a filling station"], "NEG": ["an man pumps a gasoline from a tank to a baseball glove using a gasoline pump at a petrol station", "an somebody pumps a gasolene from a storage to a mechanism using a petrol pump at a petrol station", "an individual pumps a gas from a source to a dummy using a island dispenser at a gasoline station"]}], ["shelving_243.jpg", {"POS": ["the worker shelves an pasta on a shelf in market.", "the employee shelves an box on a shelf in supermarket.", "the adult male shelves an food on a shelf in store."], "NEG": ["the worker shelves an pasta on a ice in grocery store.", "the employee shelves an box on a scattergun in supermarket.", "the man shelves an nutrient on a sauce in shop."]}], ["slipping_132.jpg", {"POS": ["an tennis player slips onto a land at a tennis court", "an tennis player slips onto a dry land at a tennis court", "an tennis pro slips onto a terra firma at a tennis court"], "NEG": ["an tennis player slips onto a toe at a tennis court", "an tennis player slips onto a lip at a tennis court", "an professional tennis player slips onto a track at a tennis court"]}], ["stumbling_233.jpg", {"POS": ["an adult male stumbles onto a mat at a place", "an man stumbles onto a air mattress at a exterior", "an man stumbles onto a pillow at a outdoors"], "NEG": ["an man stumbles onto a forward at a place", "an adult male stumbles onto a flooring at a exterior", "an adult male stumbles onto a door at a open"]}], ["sprinkling_16.jpg", {"POS": ["an sprinkler sprinkles an water from a pipe onto a dry land at a open", "an sprinkler sprinkles an water from a pipe onto a plant at a outdoors", "an sprinkler sprinkles an water from a sprinkler onto a grass at a outside"], "NEG": ["an sprinkler sprinkles an water from a pipage onto a air current at a outdoors", "an sprinkler sprinkles an water from a piping onto a thigh at a open air", "an sprinkler sprinkles an H2O from a sprinkler onto a refrigeration system at a exterior"]}], ["ejecting_187.jpg", {"POS": ["an volcano ejects an fume from a source toward a sky at a beach", "an volcano ejects an fume from a dry land toward a sky at a outside", "an agent ejects an smoke from a source toward a air current at a open air"], "NEG": ["an volcano ejects an smoke from a source toward a pail at a beach", "an volcano ejects an smoke from a terra firma toward a litter at a outside", "an agent ejects an smoke from a source toward a astragalus at a open"]}], ["pinning_188.jpg", {"POS": ["wrestler is pinning the wrestler onto a wrestling mat in gym.", "young buck is pinning the young man onto a flooring in gym.", "grappler is pinning the wrestler onto a mat in interior."], "NEG": ["matman is pinning the wrestler onto a bookshelf in gym.", "young buck is pinning the young man onto a bunny in gymnasium.", "grappler is pinning the matman onto a ballot box in interior."]}], ["emptying_76.jpg", {"POS": ["an man empties an soil from a bag into a garden using a paw in a grounds", "an man empties an mulch from a bag into a ground using a hand in a outdoors", "an adult male empties an dirt from a bag into a solid ground using a mitt in a open"], "NEG": ["an man empties an soil from a bag into a straw using a manus in a yard", "an adult male empties an mulch from a bag into a elephant using a hand in a open", "an adult male empties an soil from a bag into a hanger using a hand in a open"]}], ["plunging_174.jpg", {"POS": ["an people plunges a body (when different than the people) into a H2O at a body of water", "an people plunges a organic structure (when different than the people) into a water at a river", "an people plunges a body (when different than the people) into a H2O at a lake"], "NEG": ["an people plunges a body (when different than the people) into a hanger at a water", "an people plunges a physical structure (when different than the people) into a pie at a river", "an people plunges a body (when different than the people) into a net at a lake"]}], ["milking_72.jpg", {"POS": ["an woman milks a cow with a hand into a bucket in a barn", "an adult female milks a cow with a hand into a bucket in a farm", "an woman milks a cow with a paw into a pail in a barn"], "NEG": ["an woman milks a cow with a hand into a home base in a barn", "an woman milks a cow with a manus into a plastic bag in a farm", "an woman milks a moo-cow with a hand into a side in a barn"]}], ["milking_128.jpg", {"POS": ["an old woman milks a caprine animal with a paw into a bowl in a place", "an adult female milks a kine with a paw into a bowl in a interior", "an adult female milks a goat with a hand into a bowl in a barn"], "NEG": ["an old woman milks a caprine animal with a manus into a jug in a place", "an woman milks a cattle with a manus into a rooftop in a interior", "an adult female milks a goat with a mitt into a container in a barn"]}], ["putting_164.jpg", {"POS": ["an MD puts an eyeglasses into a face in a office", "an woman puts an glasses case into a human face in a business office", "an adult female puts an specs into a woman in a business office"], "NEG": ["an medico puts an specs into a floor in a business office", "an woman puts an glasses case into a seat in a office", "an woman puts an specs into a stand in a office"]}], ["plummeting_249.jpg", {"POS": ["the skydiver is plummeting from the airplane toward the ground in the air", "the skydiver is plummeting from the plane toward the ground in the sky", "the skydiver is plummeting from the aeroplane toward the solid ground in the sky"], "NEG": ["the skydiver is plummeting from the aeroplane toward the hydrant in the air", "the skydiver is plummeting from the plane toward the thorax in the sky", "the skydiver is plummeting from the airplane toward the hubby in the sky"]}], ["emptying_15.jpg", {"POS": ["an adult male empties an dirt from a container into a solid ground using a machine in a out-of-doors", "an man empties an dirt from a backhoe into a cumulus using a backhoe in a open", "an man empties an dirt from a container into a dry land using a vehicle in a out-of-doors"], "NEG": ["an man empties an dirt from a container into a cupcake using a machine in a open", "an man empties an dirt from a backhoe into a mid-calf using a backhoe in a out-of-doors", "an man empties an dirt from a container into a runway using a vehicle in a open"]}], ["attaching_295.jpg", {"POS": ["an man attaches a wood to a wood with glue using a tool at a open", "an adult male attaches a block to a board with connection using a hand at a open air", "an adult male attaches a board to a plank with plate using a manus at a open"], "NEG": ["an adult male attaches a wood to a sky with glue using a tool at a outdoors", "an adult male attaches a block to a pillow with connexion using a mitt at a out-of-doors", "an man attaches a board to a beam with plate using a paw at a open air"]}], ["shelving_211.jpg", {"POS": ["the adult male shelves an nutrient on a shelf in shop.", "the worker shelves an pineapple plant on a sales booth in grocery store.", "the adult male shelves an fruit on a shelf in market."], "NEG": ["the man shelves an food on a prey in store.", "the worker shelves an Ananas comosus on a drainage in food market.", "the adult male shelves an fruit on a pie crust in market."]}], ["shelving_209.jpg", {"POS": ["the woman shelves an food on a shelf in store.", "the woman shelves an tin on a shelf in store.", "the woman shelves an grocery on a shelf in store."], "NEG": ["the woman shelves an nutrient on a bin in store.", "the adult female shelves an tin on a trash bin in store.", "the woman shelves an foodstuff on a shooting iron in shop."]}], ["plunging_155.jpg", {"POS": ["an people plunges a organic structure (when different than the people) into a water at a lake", "an people plunges a body (when different than the people) into a H2O at a lake", "an group plunges a plunged (when different than the group) into a ice water at a lake"], "NEG": ["an people plunges a physical structure (when different than the people) into a table at a lake", "an people plunges a organic structure (when different than the people) into a fauna at a lake", "an group plunges a plunged (when different than the group) into a refuse at a lake"]}], ["pooing_195.jpg", {"POS": ["mortal poos onto a bathroom at a bathroom", "adult male poos onto a potty at a bath", "soul poos onto a toilet at a bathroom"], "NEG": ["soul poos onto a vehicle at a bath", "adult male poos onto a head at a bath", "someone poos onto a exterior at a bath"]}], ["fastening_110.jpg", {"POS": ["an soul fastens an dry wall into a wall with a screw using a screwdriver at a inside", "an adult female fastens an steel into a wall with a screw using a electric drill at a shop", "an adult male fastens an plank into a wall with a screw using a screwdriver at a interior"], "NEG": ["an mortal fastens an drywall into a lake with a screw using a screwdriver at a inside", "an adult female fastens an steel into a net with a screw using a electric drill at a shop", "an man fastens an plank into a soccer player with a screw using a screwdriver at a interior"]}], ["dripping_7.jpg", {"POS": ["the jet drips the H2O from the hole to the pool in the garden", "the statue drips the water from the statue to the solid ground in the open air", "the agent drips the H2O from the fountain to the bowl in the open"], "NEG": ["the fountain drips the water from the hole to the gnawer in the garden", "the statue drips the water from the statue to the reason in the open air", "the agent drips the water from the fountain to the vase in the outdoors"]}], ["leaping_244.jpg", {"POS": ["the basketball player leaps from the basketball court over/through an obstacle to the basketball court in the domed stadium", "the cager leaps from the flooring over/through an obstacle to the floor in the basketball court", "the basketeer leaps from the land over/through an obstacle to the destination in the bowl"], "NEG": ["the cager leaps from the basketball court over/through an obstacle to the Styrofoam in the covered stadium", "the basketeer leaps from the floor over/through an obstacle to the Zea mays in the basketball court", "the cager leaps from the earth over/through an obstacle to the pickup in the stadium"]}], ["applying_298.jpg", {"POS": ["adult female is applying a mascara to a lash using brush in a place.", "woman is applying a mascara to a cilium using brush in a place.", "adult female is applying a eyeliner to a lid using brush in a room."], "NEG": ["adult female is applying a mascara to a chin using brush in a place.", "woman is applying a mascara to a deck using brush in a place.", "woman is applying a eyeliner to a base using brush in a room."]}], ["injecting_336.jpg", {"POS": ["an mortal injects a vaccinum from a syringe into a arm at a place", "an somebody injects a substance from a syringe into a shoulder at a place", "an medico injects a vaccinum from a syringe into a arm at a inside"], "NEG": ["an somebody injects a vaccinum from a syringe into a Mason jar at a place", "an individual injects a substance from a syringe into a side at a place", "an doctor injects a vaccinum from a syringe into a jigsaw puzzle at a inside"]}], ["installing_149.jpg", {"POS": ["an woman installs a plank into a floor using a hand at a room", "an adult female installs a hardwood into a flooring using a paw at a house", "an adult female installs a flooring into a dry land using a paw at a inside"], "NEG": ["an adult female installs a board into a grave using a manus at a room", "an adult female installs a hardwood into a jaguar using a mitt at a house", "an woman installs a flooring into a tongs using a hand at a interior"]}], ["pinning_220.jpg", {"POS": ["woman is pinning the insignia onto a soldier in place.", "adult female is pinning the pinned onto a shirt in room.", "woman is pinning the pinned onto a shirt in place."], "NEG": ["adult female is pinning the insignia onto a possessor in place.", "woman is pinning the pinned onto a map in room.", "adult female is pinning the pinned onto a catcher in place."]}], ["pouring_60.jpg", {"POS": ["an adult male pours a beer from a bottle to a adult male with a mitt in a place", "an adult male pours a beer from a bottle to a friend with a manus in a party", "an soul pours a alcoholic drink from a bottle to a adult male with a manus in a out-of-doors"], "NEG": ["an adult male pours a beer from a bottle to a bag with a hand in a place", "an adult male pours a beer from a bottle to a lip with a manus in a party", "an soul pours a alcohol from a bottle to a street with a manus in a open air"]}], ["pumping_173.jpg", {"POS": ["an man pumps a gas from a tank to a petrol tank using a gasoline pump at a filling station", "an adult male pumps a petrol from a storage to a truck using a gasoline pump at a filling station", "an person pumps a petrol from a hosepipe to a machine using a gas pump at a outdoors"], "NEG": ["an adult male pumps a gasoline from a storage tank to a masonry using a island dispenser at a gasoline station", "an adult male pumps a gasoline from a storage to a eyebrow using a island dispenser at a petrol station", "an soul pumps a petrol from a hose to a tyre using a gasoline pump at a out-of-doors"]}], ["shelving_61.jpg", {"POS": ["the adult female shelves an book on a bookshelf in library.", "the woman shelves an book on a bookshelf in bookstore.", "the woman shelves an book on a bookshelf in library."], "NEG": ["the adult female shelves an book on a gap in library.", "the adult female shelves an book on a bobbin in bookstore.", "the adult female shelves an book on a pan in library."]}], ["filling_40.jpg", {"POS": ["individual fills balloon with He from storage tank at a place", "someone fills balloon with helium from tank at a place", "person fills balloon with atomic number 2 from storage tank at a place"], "NEG": ["individual fills plate with atomic number 2 from tank at a place", "individual fills lawn with He from storage tank at a place", "soul fills pupil with atomic number 2 from storage tank at a place"]}], ["emptying_152.jpg", {"POS": ["an mortal empties an grass from a bag into a container using a hand in a exterior", "an adult male empties an item from a bag into a ashcan using a manus in a open", "an man empties an bag from a bag into a wastebin using a hand in a out-of-doors"], "NEG": ["an someone empties an grass from a bag into a space using a paw in a exterior", "an adult male empties an item from a bag into a privy using a paw in a out-of-doors", "an man empties an bag from a bag into a urban center using a mitt in a open"]}], ["plunging_106.jpg", {"POS": ["an people plunges a male child (when different than the people) into a pool at a outside", "an boy plunges a organic structure (when different than the boy) into a H2O at a pool", "an male child plunges a organic structure (when different than the male child) into a pool at a open air"], "NEG": ["an people plunges a boy (when different than the people) into a instructor at a exterior", "an boy plunges a physical structure (when different than the boy) into a hand at a pool", "an boy plunges a physical structure (when different than the boy) into a van at a open"]}], ["burying_190.jpg", {"POS": ["man buries an mortal into a dirt using a shovel at land", "man buries an item into a ground using a shovel at out-of-doors", "man buries an fabric into a solid ground using a shovel at field"], "NEG": ["adult male buries an person into a mud using a shovel at earth", "man buries an item into a steel wool using a shovel at out-of-doors", "adult male buries an cloth into a menage using a shovel at field"]}], ["spilling_155.jpg", {"POS": ["an male child spills a milk from a jug onto a table at a room", "an shaver spills a milk from a jug onto a table at a kitchen", "an boy spills a milk from a jug onto a kitchen table at a kitchen"], "NEG": ["an boy spills a milk from a jug onto a thigh at a room", "an tike spills a milk from a jug onto a river at a kitchen", "an male child spills a milk from a jug onto a van at a kitchen"]}], ["emptying_1.jpg", {"POS": ["an mortal empties an currency from a billfold into a hand using a paw in a place", "an man empties an billfold from a manus into a hand using a tool in a place", "an adult male empties an money from a wallet into a hand using a paw in a interior"], "NEG": ["an individual empties an currency from a notecase into a washstand using a mitt in a place", "an man empties an notecase from a hand into a bottom using a tool in a place", "an man empties an money from a notecase into a drain using a mitt in a interior"]}], ["stumbling_205.jpg", {"POS": ["an woman stumbles onto a floor at a red carpet", "an woman stumbles onto a rug at a inside", "an adult female stumbles onto a solid ground at a interior"], "NEG": ["an woman stumbles onto a Dumpster at a red carpet", "an adult female stumbles onto a boy at a inside", "an woman stumbles onto a microwave oven at a interior"]}], ["placing_118.jpg", {"POS": ["people placed placeditem in box along ALREADYplaceditem in office", "work force placed box in agglomerate along ALREADYbox in inside", "man placed box in stack along ALREADYbox in front room"], "NEG": ["people placed placeditem in officer along ALREADYplaceditem in business office", "work force placed box in stamp along ALREADYbox in inside", "adult male placed box in roof along ALREADYbox in living-room"]}], ["milking_107.jpg", {"POS": ["an adult female milks a camel with a hand into a bucket in a desert", "an woman milks a camel with a manus into a bucket in a desert", "an adult female milks a camel with a hand into a pail in a desert"], "NEG": ["an woman milks a camel with a mitt into a casket in a desert", "an adult female milks a camel with a mitt into a space in a desert", "an woman milks a camel with a hand into a wrestling mat in a desert"]}], ["stumbling_113.jpg", {"POS": ["an someone stumbles onto a destination at a place", "an cowhand stumbles onto a solid ground at a rodeo", "an horse stumbles onto a earth at a outdoors"], "NEG": ["an somebody stumbles onto a ball at a place", "an cowpuncher stumbles onto a garment at a rodeo", "an Equus caballus stumbles onto a mould at a out-of-doors"]}], ["sliding_65.jpg", {"POS": ["the ballplayer slides the legs (when different from the ballplayer) on a terra firma to a stand at a stadium.", "the baseball player slides the slider (when different from the baseball player) on a land to a bag at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home plate at a baseball."], "NEG": ["the ballplayer slides the legs (when different from the ballplayer) on a ground to a needle at a stadium.", "the baseball player slides the slider (when different from the baseball player) on a earth to a brick at a diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a wire wool at a baseball game."]}], ["throwing_354.jpg", {"POS": ["the adult male throws an knife towards a target area at a backyard.", "the adult male throws an item towards a mark at a open air.", "the adult male throws an item towards a mark at a yard."], "NEG": ["the adult male throws an knife towards a joist at a backyard.", "the adult male throws an item towards a rabbit at a out-of-doors.", "the man throws an item towards a front end at a curtilage."]}], ["pumping_79.jpg", {"POS": ["an man pumps a gasolene from a storage to a car using a gas pump at a petrol station", "an man pumps a petrol from a gasoline tank to a automobile using a petrol pump at a gasoline station", "an adult male pumps a gas from a storage to a car using a island dispenser at a gas station"], "NEG": ["an man pumps a gasoline from a storage to a Panthera leo using a gas pump at a gas station", "an adult male pumps a gasolene from a petrol tank to a target using a petrol pump at a filling station", "an adult male pumps a gasolene from a storage to a grating using a gasoline pump at a filling station"]}], ["leaking_256.jpg", {"POS": ["a H2O leaks from a pipe onto/into a pipage at a cellar", "a water leaks from a piping onto/into a ground at a tunnel", "a substance leaks from a ceiling onto/into a destination at a basement"], "NEG": ["a water leaks from a pipage onto/into a house at a basement", "a water leaks from a pipe onto/into a floor at a tunnel", "a substance leaks from a ceiling onto/into a owner at a basement"]}], ["sprinkling_136.jpg", {"POS": ["an mortal sprinkles an refined sugar from a manus onto a destination at a place", "an person sprinkles an refined sugar from a hand onto a sweet at a place", "an soul sprinkles an sugar from a manus onto a gem at a room"], "NEG": ["an person sprinkles an refined sugar from a hand onto a volaille at a place", "an person sprinkles an refined sugar from a mitt onto a pillow at a place", "an somebody sprinkles an refined sugar from a paw onto a air mattress at a room"]}], ["pouncing_207.jpg", {"POS": ["an domestic dog pounces onto the Equus caballus at a open", "an dog pounces onto the tennis ball at a outside", "an dog pounces onto the tennis ball at a yard"], "NEG": ["an Canis familiaris pounces onto the storage warehouse at a open air", "an dog pounces onto the tarp at a exterior", "an dog pounces onto the xerographic copier at a yard"]}], ["stumbling_82.jpg", {"POS": ["an cowboy stumbles onto a dry land at a out-of-doors", "an rodeo rider stumbles onto a dry land at a rodeo", "an horseman stumbles onto a ground at a field"], "NEG": ["an puncher stumbles onto a cilium at a open", "an rodeo rider stumbles onto a tip truck at a rodeo", "an equestrian stumbles onto a side at a field"]}], ["leaping_330.jpg", {"POS": ["the female leaps from the source over/through an obstacle to the water in the river", "the people leaps from the dry land over/through an obstacle to the earth in the beach", "the woman leaps from the source over/through an obstacle to the water in the lake"], "NEG": ["the female person leaps from the source over/through an obstacle to the pastry in the river", "the people leaps from the dry land over/through an obstacle to the brow in the beach", "the woman leaps from the source over/through an obstacle to the cabinet in the lake"]}], ["landing_138.jpg", {"POS": ["aeroplane lands on a runway at a airdrome", "plane lands on a runway at a aerodrome", "airplane lands on a runway at a aerodrome"], "NEG": ["plane lands on a corn at a airport", "airplane lands on a roof at a drome", "airplane lands on a mother board at a airport"]}], ["installing_232.jpg", {"POS": ["an adult male installs a electrical switch into a electric receptacle using a hand at a wall", "an mortal installs a electric receptacle into a wall using a hook at a place", "an soul installs a component into a destination using a mitt at a inside"], "NEG": ["an adult male installs a electrical switch into a metacarpophalangeal joint using a mitt at a wall", "an person installs a electrical outlet into a surface using a hook at a place", "an somebody installs a component into a tin using a mitt at a interior"]}], ["applying_373.jpg", {"POS": ["man is applying a lotion to a human face using finger in a place.", "adult male is applying a emollient to a human face using paw in a room.", "man is applying a emollient to a temple using finger in a place."], "NEG": ["adult male is applying a lotion to a woodgrain using finger in a place.", "man is applying a cream to a soccer player using mitt in a room.", "adult male is applying a cream to a people using finger in a place."]}], ["loading_141.jpg", {"POS": ["the construction worker loads a motortruck with an dirt using a power shovel at a site.", "the backhoe loads a tractor trailer with an dirt using a tool at a out-of-doors.", "the man loads a truck bed with an stain using a bulldozer at a outside."], "NEG": ["the construction worker loads a map with an dirt using a shovel at a site.", "the backhoe loads a military uniform with an dirt using a tool at a out-of-doors.", "the adult male loads a trampoline with an grease using a bulldozer at a outside."]}], ["shelving_168.jpg", {"POS": ["the adult female shelves an object on a shelf in shop.", "the worker shelves an videodisk on a shelf in mill.", "the adult female shelves an product on a shelf in warehouse."], "NEG": ["the adult female shelves an physical object on a gun in store.", "the worker shelves an DVD on a tabletop in mill.", "the woman shelves an product on a porch in storage warehouse."]}], ["burying_164.jpg", {"POS": ["greybeard buries an dolly into a dirt using a shovel at farm", "man buries an babe into a dry land using a shovel at earth", "adult male buries an baby into a soil using a shovel at field"], "NEG": ["Methuselah buries an doll into a lid using a shovel at farm", "adult male buries an baby into a vehicle using a shovel at ground", "man buries an infant into a stand using a shovel at field"]}], ["pumping_121.jpg", {"POS": ["an man pumps a waste material from a dry land to a tank using a pump at a route", "an man pumps a sewage from a earth to a truck using a pump at a open air", "an man pumps a substance from a manhole to a truck using a hose at a out-of-doors"], "NEG": ["an man pumps a waste matter from a land to a opening using a pump at a road", "an adult male pumps a sewage from a earth to a drainage using a pump at a outdoors", "an adult male pumps a substance from a manhole to a puzzle using a hose at a outdoors"]}], ["plummeting_164.jpg", {"POS": ["the skydiver is plummeting from the aeroplane toward the earth in the sky", "the people is plummeting from the aeroplane toward the terra firma in the sky", "the people is plummeting from the airplane toward the earth in the air"], "NEG": ["the skydiver is plummeting from the plane toward the floor in the sky", "the people is plummeting from the airplane toward the stone in the sky", "the people is plummeting from the aeroplane toward the purse in the air"]}], ["loading_379.jpg", {"POS": ["the adult male loads a truck bed with an item using a hand at a out-of-doors.", "the people loads a wagon with an shingle using a mitt at a open.", "the people loads a truck with an container using a paw at a out-of-doors."], "NEG": ["the man loads a paving with an item using a manus at a open.", "the people loads a base with an shingle using a hand at a outdoors.", "the people loads a backstop with an container using a mitt at a outdoors."]}], ["loading_148.jpg", {"POS": ["the agent loads a truck with an grease using a backhoe at a exterior.", "the crane loads a motortruck with an dirt using a tool at a open air.", "the soul loads a motortruck with an dirt using a backhoe at a open."], "NEG": ["the agent loads a basketball court with an grime using a backhoe at a outside.", "the crane loads a bridge with an dirt using a tool at a open.", "the individual loads a right with an dirt using a backhoe at a open."]}], ["landing_76.jpg", {"POS": ["balloon lands on a solid ground at a field", "balloon lands on a grassland at a place", "balloon lands on a terra firma at a open air"], "NEG": ["balloon lands on a hose at a field", "balloon lands on a milking machine at a place", "balloon lands on a map at a outdoors"]}], ["pouring_192.jpg", {"POS": ["an man pours a tea from a teapot to a container with a manus in a inside", "an man pours a tea from a teapot to a destination with a manus in a inside", "an server pours a tea from a teapot to a cup with a paw in a Kingdom of Morocco"], "NEG": ["an adult male pours a tea from a teapot to a pouch with a paw in a interior", "an adult male pours a tea from a teapot to a tubing with a hand in a inside", "an waiter pours a tea from a teapot to a cooky with a mitt in a Maroc"]}], ["placing_103.jpg", {"POS": ["soul placed phonograph needle in record along ALREADYphonograph needle in place", "person placed phonograph needle in record along ALREADYphonograph needle in place", "adult male placed needle in turntable along ALREADYneedle in place"], "NEG": ["somebody placed phonograph needle in eyebrow along ALREADYphonograph needle in place", "person placed needle in shoe along ALREADYneedle in place", "adult male placed needle in space along ALREADYneedle in place"]}], ["loading_79.jpg", {"POS": ["the machine loads a motortruck with an ground using a auto at a mining.", "the backhoe loads a truck with an rock using a tool at a open air.", "the cipher loads a destination with an item using a tool at a place."], "NEG": ["the machine loads a coiffure with an ground using a motorcar at a excavation.", "the backhoe loads a Styrofoam with an stone using a tool at a open air.", "the nix loads a net with an item using a tool at a place."]}], ["pumping_124.jpg", {"POS": ["an adult female pumps a gaseous state from a storage to a motorcar using a island dispenser at a gasoline station", "an adult female pumps a gasolene from a storage to a motorcar using a petrol pump at a gasoline station", "an adult female pumps a gasolene from a gasoline tank to a vehicle using a petrol pump at a gas station"], "NEG": ["an adult female pumps a gaseous state from a storage to a kid using a island dispenser at a filling station", "an adult female pumps a gasolene from a storage to a atmosphere using a gas pump at a petrol station", "an adult female pumps a gasolene from a petrol tank to a neckband using a island dispenser at a gas station"]}], ["spraying_35.jpg", {"POS": ["an adult male sprays a paint onto a roof from a source using a TOOL in a outside", "an man sprays a pigment onto a destination from a hosepipe using a TOOL in a place", "an painter sprays a pigment onto a wall from a spray gun using a TOOL in a outdoors"], "NEG": ["an adult male sprays a paint onto a base from a source using a TOOL in a exterior", "an man sprays a pigment onto a hoops from a hosepipe using a TOOL in a place", "an painter sprays a paint onto a bedding material from a spray gun using a TOOL in a open"]}], ["fastening_46.jpg", {"POS": ["an mortal fastens an plank into a wall with a screw using a screwdriver at a edifice", "an soul fastens an plank into a wall with a screw using a screwdriver at a out-of-doors", "an person fastens an plank into a wall with a screw using a drill at a open"], "NEG": ["an soul fastens an plank into a pipe with a screw using a screwdriver at a building", "an mortal fastens an board into a rope with a screw using a screwdriver at a out-of-doors", "an soul fastens an board into a youngster with a screw using a drill at a open"]}], ["sliding_41.jpg", {"POS": ["the man slides the slider (when different from the man) on a flooring to a floor at a basketball court.", "the cager slides the slider (when different from the cager) on a gym to a standing at a gym.", "the adult male slides the slider (when different from the adult male) on a basketball court to a flooring at a basketball."], "NEG": ["the man slides the slider (when different from the man) on a flooring to a beak at a basketball court.", "the basketeer slides the slider (when different from the basketeer) on a gymnasium to a fox at a gym.", "the adult male slides the slider (when different from the adult male) on a basketball court to a plot at a basketball."]}], ["milking_127.jpg", {"POS": ["an man milks a cow with a paw into a pail in a farm", "an sodbuster milks a Bos taurus with a paw into a bucket in a outside", "an adult male milks a Texas longhorn with a mitt into a pail in a ley"], "NEG": ["an adult male milks a cow with a mitt into a straw in a farm", "an husbandman milks a kine with a mitt into a track in a outside", "an adult male milks a Texas longhorn with a paw into a steak in a ley"]}], ["injecting_203.jpg", {"POS": ["an physician injects a vaccine from a syringe into a arm at a place", "an individual injects a substance from a syringe into a arm at a place", "an man injects a drug from a syringe into a arm at a place"], "NEG": ["an Dr. injects a vaccinum from a syringe into a prey at a place", "an someone injects a substance from a syringe into a trough at a place", "an adult male injects a drug from a syringe into a SUV at a place"]}], ["strapping_14.jpg", {"POS": ["an paramedic straps the female into a stretcher using a strap at a ground", "an people straps the woman into a gurney using a strap at a sidewalk", "an paramedical straps the woman into a stretcher using a strap at a open"], "NEG": ["an paramedical straps the female into a shaving brush using a strap at a terra firma", "an people straps the woman into a nutrient using a strap at a pavement", "an paramedic straps the adult female into a Saccharum officinarum using a strap at a outdoors"]}], ["throwing_30.jpg", {"POS": ["the missy throws an dart towards a balloon at a drive.", "the adult female throws an dart towards a balloon at a pavement.", "the adult female throws an dart towards a balloon at a sidewalk."], "NEG": ["the girl throws an dart towards a compost pile at a private road.", "the woman throws an dart towards a artistic production at a pavement.", "the woman throws an dart towards a distance at a sidewalk."]}], ["pumping_168.jpg", {"POS": ["an woman pumps a petrol from a storage to a machine using a gasoline pump at a filling station", "an adult female pumps a gasoline from a storage to a auto using a petrol pump at a gas station", "an woman pumps a gas from a hosepipe to a petrol tank using a pump at a gas station"], "NEG": ["an adult female pumps a gasoline from a storage to a vehicle using a petrol pump at a petrol station", "an adult female pumps a gas from a storage to a stretcher using a petrol pump at a gasoline station", "an woman pumps a petrol from a hose to a flower using a pump at a filling station"]}], ["emptying_105.jpg", {"POS": ["an adult male empties an bush from a trash can into a truck using a paw in a out-of-doors", "an man empties an foliage from a pail into a bin using a mitt in a outdoors", "an young buck empties an plant from a bin into a truck bed using a hand in a outdoors"], "NEG": ["an adult male empties an bush from a ashbin into a bottom using a manus in a outdoors", "an man empties an leafage from a pail into a compost using a paw in a open", "an young buck empties an plant from a bin into a ambulance using a hand in a open"]}], ["loading_339.jpg", {"POS": ["the adult male loads a trailer with an equipage using a incline at a open air.", "the people loads a motortruck with an wagon using a ramp at a parking lot.", "the people loads a truck with an wagon using a ramp at a open."], "NEG": ["the man loads a balloon with an equipage using a ramp at a outdoors.", "the people loads a gap with an waggon using a ramp at a parking area.", "the people loads a machine with an wagon using a ramp at a out-of-doors."]}], ["sprinkling_108.jpg", {"POS": ["an chef sprinkles an powdered sugar from a food onto a food at a kitchen", "an cook sprinkles an refined sugar from a pot onto a cupcake at a kitchen", "an woman sprinkles an sugar from a sifter onto a muffin at a tabular array"], "NEG": ["an chef sprinkles an powdered sugar from a food onto a platelet at a kitchen", "an cook sprinkles an sugar from a pot onto a nook at a kitchen", "an adult female sprinkles an sugar from a sifter onto a standing at a tabular array"]}], ["slipping_159.jpg", {"POS": ["an man slips onto a land at a stairwell", "an adult male slips onto a steps at a outside", "an man slips onto a stairs at a open air"], "NEG": ["an adult male slips onto a ice-hockey rink at a stairwell", "an adult male slips onto a base at a exterior", "an man slips onto a table at a outdoors"]}], ["leaping_216.jpg", {"POS": ["the girl leaps from the terra firma over/through an obstacle to the solid ground in the outdoors", "the girl leaps from the source over/through an obstacle to the land in the open air", "the girl leaps from the ground over/through an obstacle to the air in the exterior"], "NEG": ["the young woman leaps from the dry land over/through an obstacle to the purse in the out-of-doors", "the little girl leaps from the source over/through an obstacle to the fencing in the open air", "the female child leaps from the land over/through an obstacle to the board in the exterior"]}], ["pumping_81.jpg", {"POS": ["an female pumps a H2O from a well to a bucket using a paw at a open air", "an woman pumps a H2O from a ground to a bucket using a pump at a open", "an adult female pumps a water from a ground to a pail using a petrol pump at a exterior"], "NEG": ["an female pumps a water from a well to a object using a manus at a open air", "an woman pumps a water from a earth to a construction using a pump at a open", "an adult female pumps a H2O from a solid ground to a farm using a petrol pump at a exterior"]}], ["loading_207.jpg", {"POS": ["the soul loads a shotgun with an shell using a paw at a exterior.", "the mortal loads a gun barrel with an shotgun shell using a mitt at a outside.", "the someone loads a gun with an slug using a paw at a open air."], "NEG": ["the somebody loads a person with an shell using a mitt at a exterior.", "the person loads a travelling bag with an shotgun shell using a paw at a outside.", "the soul loads a family with an bullet using a manus at a outdoors."]}], ["pouring_9.jpg", {"POS": ["an person pours a water from a bucket to a trough with a hand in a beach", "an soul pours a water from a pail to a trough with a paw in a open", "an man pours a water from a bucket to a trench with a tool in a place"], "NEG": ["an mortal pours a water from a pail to a shirt with a mitt in a beach", "an mortal pours a H2O from a bucket to a ball with a paw in a outdoors", "an man pours a water from a pail to a backboard with a tool in a place"]}], ["attaching_192.jpg", {"POS": ["an adult male attaches a rope to a harness with knot using a paw at a open", "an man attaches a rope to a destination with glue using a tool at a out-of-doors", "an adult male attaches a rope to a harness with karabiner using a hand at a open air"], "NEG": ["an man attaches a rope to a cheek pouch with knot using a hand at a open", "an man attaches a rope to a ladder with glue using a tool at a out-of-doors", "an adult male attaches a rope to a tin with carabiner using a mitt at a open air"]}], ["parachuting_94.jpg", {"POS": ["the person parachuted using a parachute to the earth at the sky.", "the woman parachuted using a parachute to the terra firma at the sky.", "the person parasaild using a parasail to the sky at the out-of-doors."], "NEG": ["the mortal chuted using a chute to the vial at the sky.", "the adult female parachuted using a parachute to the crop at the sky.", "the someone parasaild using a parasail to the place at the open."]}], ["plunging_251.jpg", {"POS": ["an people plunges a organic structure (when different than the people) into a water at a body of water", "an adult male plunges a plunged (when different than the adult male) into a water at a lake", "an people plunges a organic structure (when different than the people) into a water at a sea"], "NEG": ["an people plunges a body (when different than the people) into a chair at a water", "an man plunges a plunged (when different than the man) into a staircase at a lake", "an people plunges a body (when different than the people) into a arts and crafts at a sea"]}], ["leaping_32.jpg", {"POS": ["the soul leaps from the drop-off over/through an drop to the drop in the outside", "the person leaps from the rock over/through an obstacle to the rock in the open air", "the man leaps from the range of mountains over/through an crevasse to the range of mountains in the open"], "NEG": ["the person leaps from the drop over/through an drop to the potty chair in the exterior", "the somebody leaps from the rock over/through an obstacle to the orange in the outdoors", "the man leaps from the range of mountains over/through an crevasse to the river in the outdoors"]}], ["emptying_149.jpg", {"POS": ["an adult male empties an item from a bucket into a pail using a mitt in a open air", "an Methuselah empties an compost from a bucket into a bin using a mitt in a out-of-doors", "an adult male empties an dirt from a pail into a pot using a hand in a exterior"], "NEG": ["an adult male empties an item from a pail into a grass using a hand in a out-of-doors", "an graybeard empties an compost from a bucket into a beaker using a manus in a out-of-doors", "an adult male empties an dirt from a bucket into a bowl using a hand in a exterior"]}], ["leaping_68.jpg", {"POS": ["the parachuter leaps from the aeroplane over/through an obstacle to the dry land in the open air", "the skydiver leaps from the aeroplane over/through an obstacle to the dry land in the sky", "the person leaps from the airplane over/through an obstacle to the dry land in the sky"], "NEG": ["the parachutist leaps from the airplane over/through an obstacle to the crack in the outdoors", "the skydiver leaps from the airplane over/through an obstacle to the plywood in the sky", "the individual leaps from the airplane over/through an obstacle to the wire wool in the sky"]}], ["pouncing_162.jpg", {"POS": ["an cat pounces onto the cat at a outside", "an oxen pounces onto the land at a outdoors", "an cat pounces onto the true cat at a grass"], "NEG": ["an true cat pounces onto the base at a outside", "an Bos taurus pounces onto the arts and crafts at a outdoors", "an cat pounces onto the separator at a grass"]}], ["spraying_182.jpg", {"POS": ["an hand sprays a lubricating oil onto a salad from a source using a TOOL in a interior", "an individual sprays a liquid onto a salad from a bottle using a TOOL in a table", "an adult female sprays a H2O onto a veg from a spray using a TOOL in a kitchen"], "NEG": ["an manus sprays a grease onto a ocean from a source using a TOOL in a inside", "an soul sprays a liquid onto a pipe from a bottle using a TOOL in a table", "an woman sprays a H2O onto a volaille from a spray using a TOOL in a kitchen"]}], ["raking_247.jpg", {"POS": ["an worker rakes an dirt from a solid ground into a ground at a garden", "an adult male rakes an dirt from a earth into a destination at a garden", "an gardener rakes an soil from a dry land into a dry land at a farm"], "NEG": ["an worker rakes an soil from a solid ground into a cardboard at a garden", "an man rakes an soil from a earth into a potty chair at a garden", "an gardener rakes an soil from a earth into a hare at a farm"]}], ["pinning_203.jpg", {"POS": ["politician is pinning the badge onto a officer in ceremony.", "adult male is pinning the insignia of rank onto a shirt in room.", "adult male is pinning the medallion onto a coat in inside."], "NEG": ["politician is pinning the badge onto a towel in ceremonial.", "man is pinning the insignia of rank onto a bath in room.", "man is pinning the medallion onto a Petri dish in inside."]}], ["tying_186.jpg", {"POS": ["an adult male ties an tie to a collar using a mitt at a place", "an man ties an necktie to a necktie using a textile at a interior", "an adult male ties an tie to a collar using a tie at a place"], "NEG": ["an man ties an necktie to a work force using a mitt at a place", "an man ties an tie to a compost using a textile at a inside", "an man ties an tie to a circuit board using a necktie at a place"]}], ["installing_32.jpg", {"POS": ["an man installs a solar battery into a roof using a hammer at a roof", "an adult male installs a solar battery into a roof using a hand at a exterior", "an adult male installs a solar energy into a roof using a hammer at a open"], "NEG": ["an man installs a solar battery into a articulatio genus using a hammer at a roof", "an adult male installs a solar panel into a pasta using a paw at a exterior", "an man installs a solar energy into a Xerox machine using a hammer at a outdoors"]}], ["shelving_160.jpg", {"POS": ["the bibliothec shelves an book on a bookshelf in library.", "the adult female shelves an book on a bookshelf in library.", "the woman shelves an book on a shelf in library."], "NEG": ["the librarian shelves an book on a tractor trailer in library.", "the adult female shelves an book on a rope in library.", "the adult female shelves an book on a handcart in library."]}], ["applying_286.jpg", {"POS": ["individual is applying a lip rouge to a lip using mitt in a inside.", "adult female is applying a mascara to a supercilium using brush in a room.", "people is applying a make-up to a human face using brush in a place."], "NEG": ["mortal is applying a lipstick to a net using mitt in a inside.", "adult female is applying a mascara to a circuit board using brush in a room.", "people is applying a war paint to a feeding bottle using brush in a place."]}], ["plunging_68.jpg", {"POS": ["an adult male plunges a brand (when different than the adult male) into a bull at a sports stadium", "an matador plunges a steel (when different than the matador) into a bull at a stadium", "an matador plunges a sticker (when different than the matador) into a bull at a sports stadium"], "NEG": ["an man plunges a brand (when different than the man) into a farm at a arena", "an matador plunges a steel (when different than the matador) into a babe at a sports stadium", "an matador plunges a sticker (when different than the matador) into a ice at a bowl"]}], ["raking_114.jpg", {"POS": ["an girl rakes an leaf from a land into a mound at a field", "an adult female rakes an foliage from a ground into a destination at a open air", "an mortal rakes an foliage from a ground into a pile at a park"], "NEG": ["an fille rakes an foliage from a solid ground into a friend at a field", "an adult female rakes an leafage from a solid ground into a hairpin at a out-of-doors", "an person rakes an foliage from a earth into a desk at a park"]}], ["raking_172.jpg", {"POS": ["an father rakes an foliage from a dry land into a mound at a grounds", "an people rakes an leafage from a dry land into a agglomerate at a front yard", "an boy rakes an foliage from a grass into a agglomerate at a front yard"], "NEG": ["an begetter rakes an leaf from a earth into a bridge at a curtilage", "an people rakes an leaf from a earth into a toilet bowl at a front yard", "an boy rakes an foliage from a grass into a printer at a front yard"]}], ["slipping_60.jpg", {"POS": ["an footballer slips onto a gridiron at a gridiron", "an footballer slips onto a dry land at a football field", "an football player slips onto a solid ground at a playing field"], "NEG": ["an football player slips onto a crocodile at a gridiron", "an footballer slips onto a pecker at a gridiron", "an footballer slips onto a alloy at a field"]}], ["pinning_151.jpg", {"POS": ["adult male is pinning the stripes onto a soldier in ceremony.", "adult male is pinning the insignia of rank onto a military uniform in training college.", "adult male is pinning the pin onto a soldier in open."], "NEG": ["man is pinning the chevron onto a deer in ceremonial occasion.", "man is pinning the insignia of rank onto a pipe in training college.", "adult male is pinning the pin onto a sport utility vehicle in outdoors."]}], ["placing_68.jpg", {"POS": ["person placed coin in bowl along ALREADYcoin in inside", "person placed money in bowl along ALREADYmoney in room", "someone placed coin in bowl along ALREADYcoin in inside"], "NEG": ["someone placed coin in metatarsal arch along ALREADYcoin in interior", "person placed money in torso along ALREADYmoney in room", "someone placed coin in batter along ALREADYcoin in inside"]}], ["strapping_236.jpg", {"POS": ["an adult female straps the adult female into a seat using a seat belt at a car", "an woman straps the strapped into a seat using a seat belt at a interior", "an adult female straps the adult female into a seat using a seat belt at a machine"], "NEG": ["an woman straps the adult female into a nutrient using a seatbelt at a machine", "an woman straps the strapped into a bike using a seatbelt at a inside", "an woman straps the woman into a electronic computer using a seat belt at a auto"]}], ["filling_173.jpg", {"POS": ["mortal fills wall with caulk from caulking at a exterior", "someone fills gap with mortar from knife at a open air", "individual fills crack with filler from source at a open air"], "NEG": ["mortal fills modem with caulking from caulking at a exterior", "someone fills SUV with mortar from knife at a outdoors", "individual fills home with filler from source at a out-of-doors"]}], ["parachuting_35.jpg", {"POS": ["the adult male parachuted using a parachute to the ground at the sky.", "the adult male parachuted using a parachute to the destination at the sky.", "the man parachuted using a parachute to the solid ground at the sky."], "NEG": ["the man parachuted using a parachute to the hockey stick at the sky.", "the man parachuted using a parachute to the tennis ball at the sky.", "the man parachuted using a parachute to the span at the sky."]}], ["pooing_247.jpg", {"POS": ["adult female poos onto a can at a bath", "woman poos onto a stool at a bathroom", "woman poos onto a privy at a bath"], "NEG": ["woman poos onto a crochet stitch at a bath", "woman poos onto a box at a bathroom", "woman poos onto a slot at a bath"]}], ["landing_167.jpg", {"POS": ["woman lands on a earth at a outside", "woman lands on a platform at a outdoors", "woman lands on a solid ground at a open"], "NEG": ["adult female lands on a owner at a outside", "woman lands on a trailer at a open", "adult female lands on a Erlenmeyer flask at a out-of-doors"]}], ["pumping_211.jpg", {"POS": ["an people pumps a water from a water pump to a pail using a lever at a outdoors", "an little girl pumps a H2O from a solid ground to a bucket using a pump at a open air", "an people pumps a H2O from a earth to a bucket using a wellpoint at a open air"], "NEG": ["an people pumps a water from a water pump to a automobile trunk using a lever at a out-of-doors", "an little girl pumps a water from a land to a pastry using a pump at a open air", "an people pumps a water from a earth to a sink using a well point at a out-of-doors"]}], ["filling_24.jpg", {"POS": ["adult female fills bag with popcorn from pail at a room", "woman fills travelling bag with pellet from bucket at a room", "woman fills bag with pail from source at a interior"], "NEG": ["adult female fills paper with popcorn from pail at a room", "woman fills comfort with pellet from pail at a room", "woman fills Gunter Wilhelm Grass with pail from source at a inside"]}], ["placing_304.jpg", {"POS": ["individual placed placeditem in destination along ALREADYplaceditem in place", "person placed screw in machine along ALREADYscrew in office", "mortal placed screw in microscope along ALREADYscrew in inside"], "NEG": ["mortal placed placeditem in vehicle along ALREADYplaceditem in place", "person placed screw in net along ALREADYscrew in office", "someone placed screw in house along ALREADYscrew in inside"]}], ["jumping_168.jpg", {"POS": ["an Equus caballus jumps from a earth over/through an fence (excluding the air) and will end up at a earth at a race", "an horse jumps from a ground over/through an fencing (excluding the air) and will end up at a ground at a yard", "an horse jumps from a dry land over/through an fence (excluding the air) and will end up at a ground at a racecourse"], "NEG": ["an horse jumps from a earth over/through an fence (excluding the air) and will end up at a vehicle at a race", "an horse jumps from a land over/through an fencing (excluding the air) and will end up at a wall at a yard", "an Equus caballus jumps from a ground over/through an fencing (excluding the air) and will end up at a filing cabinet at a track"]}], ["raking_97.jpg", {"POS": ["an people rakes an leaf from a ground into a cumulation at a yard", "an people rakes an leaf from a lawn into a cumulus at a backyard", "an child rakes an leaf from a ground into a pile at a backyard"], "NEG": ["an people rakes an leaf from a ground into a coconut meat at a yard", "an people rakes an leaf from a lawn into a deck at a backyard", "an tyke rakes an leafage from a solid ground into a Styrofoam at a backyard"]}], ["emptying_83.jpg", {"POS": ["an truck empties an pitch from a truck into a dry land using a tool in a outdoors", "an adult male empties an asphalt from a truck into a dry land using a lifting device in a open air", "an man empties an grease from a truck into a terra firma using a vat in a outdoors"], "NEG": ["an motortruck empties an pitch from a truck into a open air using a tool in a open air", "an man empties an asphalt from a motortruck into a garment using a lifting device in a out-of-doors", "an adult male empties an grunge from a motortruck into a stack using a tub in a out-of-doors"]}], ["slipping_140.jpg", {"POS": ["an adult male slips onto a dry land at a stairwell", "an man slips onto a staircase at a interior", "an adult male slips onto a floor at a room"], "NEG": ["an adult male slips onto a sheet metal at a stairwell", "an man slips onto a alimentary paste at a inside", "an man slips onto a surface at a room"]}], ["emptying_137.jpg", {"POS": ["an adult male empties an gas from a can into a tank using a hosiery in a out-of-doors", "an adult male empties an item from a container into a destination using a manus in a outside", "an mitt empties an item from a jug into a tank using a hosepipe in a open"], "NEG": ["an adult male empties an gaseous state from a tin can into a waist using a hose in a open air", "an adult male empties an item from a container into a hoop using a mitt in a exterior", "an paw empties an item from a jug into a fascia using a hose in a outdoors"]}], ["pinning_186.jpg", {"POS": ["adult female is pinning the flower onto a adult male in place.", "woman is pinning the flower onto a shirt in place.", "adult female is pinning the flower onto a coat in inside."], "NEG": ["woman is pinning the flower onto a palpebra in place.", "adult female is pinning the flower onto a breast pocket in place.", "woman is pinning the flower onto a trough in inside."]}], ["pumping_7.jpg", {"POS": ["an man pumps a gasoline from a storage to a machine using a island dispenser at a filling station", "an adult male pumps a petrol from a storage to a automobile using a gasoline pump at a gasoline station", "an adult male pumps a gasoline from a hosepipe to a auto using a gas pump at a outdoors"], "NEG": ["an man pumps a petrol from a storage to a six-gun using a gas pump at a filling station", "an adult male pumps a gasoline from a storage to a breast pocket using a gas pump at a gasoline station", "an man pumps a gas from a hosepipe to a rod using a gas pump at a open air"]}], ["leaping_296.jpg", {"POS": ["the dog leaps from the earth over/through an hurdle to the land in the field", "the domestic dog leaps from the ground over/through an fencing to the ground in the outdoors", "the domestic dog leaps from the terra firma over/through an hurdle to the ground in the out-of-doors"], "NEG": ["the dog leaps from the terra firma over/through an hurdle to the police officer in the field", "the Canis familiaris leaps from the solid ground over/through an fence to the jug in the out-of-doors", "the domestic dog leaps from the land over/through an hurdle to the pie crust in the out-of-doors"]}], ["landing_2.jpg", {"POS": ["aeroplane lands on a runway at a drome", "jumbojet lands on a runway at a airport", "airplane lands on a runway at a airport"], "NEG": ["plane lands on a wildebeest at a drome", "jumbojet lands on a Styrofoam at a aerodrome", "plane lands on a gurney at a drome"]}], ["pouncing_235.jpg", {"POS": ["an Canis familiaris pounces onto the Canis familiaris at a exterior", "an dog pounces onto the pool at a lawn", "an Canis familiaris pounces onto the swimming pool at a backyard"], "NEG": ["an domestic dog pounces onto the trench at a outside", "an Canis familiaris pounces onto the pectus at a lawn", "an domestic dog pounces onto the tractor at a backyard"]}], ["shelving_173.jpg", {"POS": ["the adult male shelves an box on a shelf in store.", "the worker shelves an box on a shelf in storehouse.", "the adult male shelves an merchandise on a shelf in shop."], "NEG": ["the man shelves an box on a bill in shop.", "the worker shelves an box on a pile in storehouse.", "the man shelves an product on a storage warehouse in shop."]}], ["ejecting_139.jpg", {"POS": ["an jet ejects an jet-propelled plane from a source toward a sky at a outdoors", "an jet ejects an airplane pilot from a cockpit toward a sky at a open air", "an jet ejects an item from a source toward a air at a ocean"], "NEG": ["an jet-propelled plane ejects an jet from a source toward a pepper at a out-of-doors", "an jet plane ejects an pilot from a cockpit toward a garden at a open", "an jet ejects an item from a source toward a globe at a ocean"]}], ["stumbling_180.jpg", {"POS": ["an woman stumbles onto a chair at a stage", "an adult female stumbles onto a flooring at a stage", "an adult female stumbles onto a stairs at a stage"], "NEG": ["an adult female stumbles onto a deer at a stage", "an adult female stumbles onto a range at a stage", "an woman stumbles onto a circuit board at a stage"]}], ["pouring_44.jpg", {"POS": ["an male child pours a H2O from a bottle to a bottle with a hand in a inside", "an male child pours a H2O from a bottle to a cone with a hand in a kitchen", "an tyke pours a substance from a drinking glass to a drinking glass with a manus in a table"], "NEG": ["an boy pours a water from a bottle to a trampoline with a hand in a inside", "an boy pours a water from a bottle to a snow with a hand in a kitchen", "an kid pours a substance from a drinking glass to a uphill with a paw in a table"]}], ["fastening_174.jpg", {"POS": ["an person fastens an board into a stick with a drilling bit using a drill steel at a interior", "an man fastens an floorboard into a floor with a tenpenny nail using a hand tool at a room", "an adult male fastens an board into a destination with a screw using a screwdriver at a place"], "NEG": ["an mortal fastens an plank into a flask with a drill bit using a drill rod at a inside", "an adult male fastens an floorboard into a astragalus with a tenpenny nail using a hand tool at a room", "an adult male fastens an plank into a optical lens with a screw using a screwdriver at a place"]}], ["shelving_203.jpg", {"POS": ["the man shelves an Ananas comosus on a shelf in grocery.", "the adult male shelves an nutrient on a shelf in store.", "the man shelves an pineapple plant on a shelf in grocery store."], "NEG": ["the adult male shelves an pineapple on a bottle in market.", "the adult male shelves an food on a drain in shop.", "the adult male shelves an Ananas comosus on a owner in market."]}], ["injecting_187.jpg", {"POS": ["an scientist injects a chemical from a syringe into a orange at a lab", "an soul injects a substance from a syringe into a orange at a place", "an adult male injects a liquid from a syringe into a fruit at a place"], "NEG": ["an scientist injects a chemical substance from a syringe into a ceiling at a laboratory", "an soul injects a substance from a syringe into a measuring cup at a place", "an adult male injects a liquid from a syringe into a fair game at a place"]}], ["injecting_52.jpg", {"POS": ["an scientist injects a liquid from a syringe into a pepper at a room", "an adult female injects a liquid from a syringe into a pepper at a place", "an scientist injects a liquid from a syringe into a bell pepper at a place"], "NEG": ["an scientist injects a liquid from a syringe into a flask at a room", "an adult female injects a liquid from a syringe into a sprocket wheel at a place", "an scientist injects a liquid from a syringe into a bedding material at a place"]}], ["pouncing_82.jpg", {"POS": ["an Lynx rufus pounces onto the cony at a out-of-doors", "an Lynx rufus pounces onto the rabbit at a out-of-doors", "an ounce pounces onto the prey at a snow"], "NEG": ["an bay lynx pounces onto the surface at a open air", "an Lynx rufus pounces onto the glass at a open", "an ounce pounces onto the toe at a snow"]}], ["leaping_88.jpg", {"POS": ["the domestic dog leaps from the dock over/through an obstacle to the water in the lake", "the Canis familiaris leaps from the dock over/through an obstacle to the body of water in the outdoors", "the duo leaps from the land over/through an obstacle to the H2O in the lake"], "NEG": ["the domestic dog leaps from the wharfage over/through an obstacle to the rugby football in the lake", "the Canis familiaris leaps from the pier over/through an obstacle to the fishing line in the open", "the duet leaps from the ground over/through an obstacle to the water in the lake"]}], ["fastening_191.jpg", {"POS": ["an man fastens an gap into a wall with a caulking using a caulking at a inside", "an adult male fastens an item into a destination with a chalk using a tool at a room", "an soul fastens an window into a window frame with a caulk using a hand tool at a inside"], "NEG": ["an adult male fastens an gap into a casket with a caulk using a caulk at a interior", "an adult male fastens an item into a microwave oven with a chalk using a tool at a room", "an someone fastens an window into a asphalt with a caulk using a hand tool at a interior"]}], ["fastening_130.jpg", {"POS": ["an famous person fastens an helmet into a head with a strap using a paw at a cervix", "an adult male fastens an helmet into a head with a buckle using a hand at a place", "an driver fastens an helmet into a caput with a strap using a hand at a out-of-doors"], "NEG": ["an celebrity fastens an helmet into a pot with a strap using a hand at a neck", "an adult male fastens an helmet into a eating house with a buckle using a hand at a place", "an driver fastens an helmet into a lawn with a strap using a paw at a open"]}], ["installing_172.jpg", {"POS": ["an adult female installs a fan into a ceiling using a screwdriver at a room", "an woman installs a fan into a ceiling using a screwdriver at a room", "an adult female installs a fan into a ceiling using a screwdriver at a interior"], "NEG": ["an woman installs a fan into a engine using a screwdriver at a room", "an woman installs a fan into a pillow using a screwdriver at a room", "an adult female installs a fan into a nail using a screwdriver at a interior"]}], ["fetching_179.jpg", {"POS": ["the adult female fetches the water from pool and brings it to place, in outside.", "the young lady fetches the H2O from lake and brings it to menage, in open air.", "the people fetches the H2O from lake and brings it to container, in shore."], "NEG": ["the adult female fetches the water from pool and brings it to prey, in exterior.", "the missy fetches the H2O from lake and brings it to fundament, in outdoors.", "the people fetches the H2O from lake and brings it to barrel, in shore."]}], ["stumbling_119.jpg", {"POS": ["an player stumbles onto a playing field at a arena", "an soccer player stumbles onto a dry land at a bowl", "an soccer player stumbles onto a turf at a playing field"], "NEG": ["an participant stumbles onto a grave at a sports stadium", "an soccer player stumbles onto a funnel at a stadium", "an soccer player stumbles onto a map at a playing area"]}], ["milking_36.jpg", {"POS": ["an man milks a cow with a mitt into a bucket in a farm", "an manus milks a moo-cow with a manus into a pail in a barn", "an adult male milks a oxen with a hand into a pail in a barn"], "NEG": ["an adult male milks a cow with a paw into a drinking straw in a farm", "an manus milks a moo-cow with a mitt into a soccer player in a barn", "an adult male milks a Bos taurus with a hand into a river in a barn"]}], ["throwing_366.jpg", {"POS": ["the alumnus throws an cap towards a sky at a grass.", "the grad throws an mortarboard towards a air at a lawn.", "the missy throws an cap towards a destination at a graduation exercise."], "NEG": ["the grad throws an cap towards a keyboard at a grass.", "the alum throws an mortarboard towards a knot at a lawn.", "the missy throws an cap towards a spread at a graduation exercise."]}], ["leaping_185.jpg", {"POS": ["the runner leaps from the dry land over/through an crevasse to the land in the mount", "the woman leaps from the stone over/through an opening to the rock in the open air", "the woman leaps from the rock over/through an hole to the rock in the open air"], "NEG": ["the runner leaps from the earth over/through an crevasse to the cony in the mountain", "the woman leaps from the stone over/through an gap to the potty chair in the open", "the adult female leaps from the stone over/through an hole to the mother board in the open"]}], ["dripping_8.jpg", {"POS": ["the tree drips the sap from the source to the bucket in the exterior", "the pipe drips the H2O from the tube to the bucket in the open air", "the tree drips the sap from the spout to the bucket in the open"], "NEG": ["the tree drips the sap from the source to the bar in the outside", "the pipe drips the water from the tube to the milking machine in the out-of-doors", "the tree drips the sap from the spout to the funnel in the outdoors"]}], ["leaping_245.jpg", {"POS": ["the baseball player leaps from the land over/through an obstacle to the ground in the baseball field", "the ballplayer leaps from the field over/through an obstacle to the playing field in the field", "the ballplayer leaps from the ground over/through an obstacle to the earth in the ball field"], "NEG": ["the ballplayer leaps from the solid ground over/through an obstacle to the bookshelf in the diamond", "the baseball player leaps from the playing field over/through an obstacle to the chain of mountains in the playing field", "the baseball player leaps from the terra firma over/through an obstacle to the stack in the baseball field"]}], ["milking_76.jpg", {"POS": ["an sodbuster milks a cow with a mitt into a barn in a barn", "an adult male milks a cow with a milking machine into a container in a farm", "an farmer milks a moo-cow with a milking machine into a container in a barn"], "NEG": ["an farmer milks a cow with a manus into a dress in a barn", "an man milks a cow with a milking machine into a stalk in a farm", "an husbandman milks a moo-cow with a milking machine into a engine in a barn"]}], ["stumbling_19.jpg", {"POS": ["an basketeer stumbles onto a flooring at a basketball court", "an basketball player stumbles onto a floor at a arena", "an basketball player stumbles onto a flooring at a game"], "NEG": ["an cager stumbles onto a sport utility at a basketball court", "an basketeer stumbles onto a motorcycle at a bowl", "an basketeer stumbles onto a concrete at a game"]}], ["raking_111.jpg", {"POS": ["an girl rakes an foliage from a ground into a pile at a out-of-doors", "an female child rakes an foliage from a land into a heap at a outdoors", "an girl rakes an leafage from a earth into a heap at a outdoors"], "NEG": ["an female child rakes an foliage from a earth into a slide at a open air", "an little girl rakes an leafage from a ground into a row at a open", "an female child rakes an leafage from a ground into a washcloth at a open air"]}], ["lathering_153.jpg", {"POS": ["an man lathers a shaving foam into a human face at a shop", "an barber lathers a shaving cream into a human face at a barbershop", "an barber lathers a shaving cream into a client at a shop"], "NEG": ["an man lathers a shaving foam into a jigsaw puzzle at a store", "an barber lathers a shaving cream into a cheek at a barbershop", "an barber lathers a shaving cream into a port at a store"]}], ["putting_344.jpg", {"POS": ["an people puts an piece into a puzzle in a place", "an people puts an puzzle into a floor in a floor", "an duet puts an piece into a jigsaw puzzle in a table"], "NEG": ["an people puts an piece into a manpower in a place", "an people puts an puzzle into a automobile trunk in a flooring", "an couple puts an piece into a ice in a table"]}], ["deflecting_192.jpg", {"POS": ["the adult male deflected the brand to the cervix at the field.", "the fencer deflected the brand to the cervix at the lawn.", "the blade deflected the brand to the side at the outdoors."], "NEG": ["the adult male deflected the steel to the organic structure at the field.", "the swordsman deflected the sword to the plaster at the lawn.", "the brand deflected the blade to the tray at the open air."]}], ["sliding_59.jpg", {"POS": ["the adult male slides the tyke (when different from the adult male) on a human foot to a air at a interior.", "the people slides the slider (when different from the people) on a lounge to a flooring at a room.", "the little girl slides the slider (when different from the little girl) on a slide to a pillow at a interior."], "NEG": ["the man slides the kid (when different from the man) on a pes to a torso at a inside.", "the people slides the slider (when different from the people) on a lounge to a shore at a room.", "the girl slides the slider (when different from the girl) on a sliding board to a woman at a inside."]}], ["strapping_152.jpg", {"POS": ["an policeman straps the car seat into a auto using a strap at a machine", "an officer straps the babe into a car seat using a seatbelt at a auto", "an officer straps the babe into a car seat using a seat belt at a vehicle"], "NEG": ["an policeman straps the car seat into a grassland using a strap at a auto", "an policeman straps the infant into a corn stalk using a seatbelt at a machine", "an police officer straps the baby into a backboard using a seatbelt at a vehicle"]}], ["installing_257.jpg", {"POS": ["an man installs a component into a electronic computer using a paw at a office", "an adult male installs a server into a stand using a mitt at a business office", "an adult male installs a component into a destination using a mitt at a inside"], "NEG": ["an adult male installs a component into a back using a mitt at a business office", "an adult male installs a host into a sunset using a manus at a business office", "an adult male installs a component into a collar using a hand at a interior"]}], ["jumping_100.jpg", {"POS": ["an people jumps from a drop-off over/through an hillside (excluding the air) and will end up at a water at a open air", "an people jumps from a cliff over/through an obstacle (excluding the air) and will end up at a water at a out-of-doors", "an people jumps from a drop over/through an obstacle (excluding the air) and will end up at a H2O at a boulder"], "NEG": ["an people jumps from a cliff over/through an hillside (excluding the air) and will end up at a tike at a open", "an people jumps from a drop-off over/through an obstacle (excluding the air) and will end up at a leg at a out-of-doors", "an people jumps from a cliff over/through an obstacle (excluding the air) and will end up at a trough at a bowlder"]}], ["parachuting_120.jpg", {"POS": ["the individual chuted using a chute to the dry land at the sky.", "the man chuted using a chute to the earth at the sky.", "the adult male chuted using a chute to the land at the sky."], "NEG": ["the somebody chuted using a chute to the opening at the sky.", "the man parachuted using a parachute to the rubbish at the sky.", "the adult male parachuted using a parachute to the grass at the sky."]}], ["milking_146.jpg", {"POS": ["an adult female milks a cow with a mitt into a bucket in a farm", "an adult female milks a cow with a mitt into a bucket in a exterior", "an adult female milks a cow with a hand into a pail in a barnyard"], "NEG": ["an adult female milks a cow with a mitt into a tennis ball in a farm", "an adult female milks a cow with a manus into a ring in a exterior", "an woman milks a cow with a mitt into a garden in a barnyard"]}], ["injecting_219.jpg", {"POS": ["an doctor injects a drug from a syringe into a woman at a room", "an nurse injects a drug from a syringe into a arm at a place", "an doc injects a substance from a syringe into a arm at a hospital"], "NEG": ["an medico injects a drug from a syringe into a sunset at a room", "an nurse injects a drug from a syringe into a snow at a place", "an doctor injects a substance from a syringe into a stage at a hospital"]}], ["applying_212.jpg", {"POS": ["adult female is applying a mascara to a lash using tool in a interior.", "woman is applying a mascara to a lash using brush in a place.", "woman is applying a mascara to a eyelash using brush in a room."], "NEG": ["adult female is applying a mascara to a confect using tool in a inside.", "adult female is applying a mascara to a camera lens using brush in a place.", "woman is applying a mascara to a baseball field using brush in a room."]}], ["jumping_143.jpg", {"POS": ["an runner jumps from a solid ground over/through an hurdle (excluding the air) and will end up at a ground at a path", "an someone jumps from a land over/through an hurdle (excluding the air) and will end up at a ground at a out-of-doors", "an man jumps from a solid ground over/through an hurdle (excluding the air) and will end up at a terra firma at a open air"], "NEG": ["an runner jumps from a terra firma over/through an hurdle (excluding the air) and will end up at a tank at a course", "an individual jumps from a land over/through an hurdle (excluding the air) and will end up at a body at a open air", "an man jumps from a earth over/through an hurdle (excluding the air) and will end up at a mug at a outdoors"]}], ["parachuting_201.jpg", {"POS": ["the male parachuted using a parachute to the solid ground at the sky.", "the adult male parachuted using a parachute to the earth at the outdoors.", "the people parachuted using a parachute to the terra firma at the land."], "NEG": ["the male parachuted using a parachute to the carrot at the sky.", "the adult male chuted using a chute to the muzzle at the outdoors.", "the people parachuted using a parachute to the desktop at the earth."]}], ["emptying_155.jpg", {"POS": ["an adult female empties an paper from a recycling bin into a recycling bin using a hand in a place", "an woman empties an water from a pail into a bin using a hand in a place", "an woman empties an rubbish from a trash barrel into a bin using a mitt in a place"], "NEG": ["an woman empties an paper from a recycling bin into a wrap using a hand in a place", "an woman empties an water from a bucket into a cavity using a manus in a place", "an woman empties an scrap from a garbage can into a mouth using a mitt in a place"]}], ["sliding_77.jpg", {"POS": ["the nipper slides the slider (when different from the nipper) on a slide to a swimming bath at a backyard.", "the girl slides the slider (when different from the girl) on a sliding board to a body of water at a outside.", "the girl slides the slider (when different from the girl) on a sloping trough to a pool at a exterior."], "NEG": ["the nestling slides the slider (when different from the nestling) on a playground slide to a landing gear at a backyard.", "the little girl slides the slider (when different from the little girl) on a sliding board to a carpet at a outside.", "the girl slides the slider (when different from the girl) on a slideway to a slot at a exterior."]}], ["landing_141.jpg", {"POS": ["eggbeater lands on a earth at a airdrome", "eggbeater lands on a land at a open", "helicopter lands on a earth at a open air"], "NEG": ["chopper lands on a sink at a airport", "chopper lands on a saucer at a open", "eggbeater lands on a runway at a out-of-doors"]}], ["splashing_64.jpg", {"POS": ["an wife splashes a hubby with a water using a paw in a pool", "an adult female splashes a adult male with a H2O using a hand in a swimming pool", "an adult female splashes a man with a H2O using a paw in a natatorium"], "NEG": ["an married woman splashes a wire with a water using a manus in a pool", "an woman splashes a stick with a H2O using a manus in a natatorium", "an adult female splashes a flap with a water using a mitt in a swimming pool"]}], ["parachuting_139.jpg", {"POS": ["the man parachuted using a parachute to the skyscraper at the sky.", "the man parachuted using a parachute to the grounds at the sky.", "the person parachuted using a parachute to the destination at the sky."], "NEG": ["the adult male parachuted using a parachute to the batsman at the sky.", "the man chuted using a chute to the windscreen at the sky.", "the person chuted using a chute to the shoe lace at the sky."]}], ["raking_138.jpg", {"POS": ["an adult male rakes an leafage from a solid ground into a cumulus at a grounds", "an adult male rakes an leaf from a land into a cumulus at a grounds", "an soul rakes an leafage from a land into a mound at a front yard"], "NEG": ["an man rakes an foliage from a ground into a house at a curtilage", "an man rakes an foliage from a terra firma into a wing at a yard", "an individual rakes an leaf from a dry land into a recycling bin at a front yard"]}], ["milking_190.jpg", {"POS": ["an woman milks a caprine animal with a paw into a can in a farm", "an adult female milks a caprine animal with a mitt into a can in a open air", "an adult female milks a goat with a mitt into a container in a wood"], "NEG": ["an woman milks a goat with a paw into a block in a farm", "an adult female milks a goat with a paw into a goblet in a outdoors", "an woman milks a goat with a paw into a flowerpot in a forest"]}], ["pouring_271.jpg", {"POS": ["an woman pours a tea from a teapot to a mug with a hand in a interior", "an woman pours a tea from a pot to a cup with a paw in a kitchen", "an woman pours a tea from a teapot to a cup with a hand in a kitchen"], "NEG": ["an woman pours a tea from a teapot to a tin with a hand in a inside", "an woman pours a tea from a pot to a set with a paw in a kitchen", "an woman pours a tea from a teapot to a petrol engine with a hand in a kitchen"]}], ["pouring_49.jpg", {"POS": ["an person pours a batter from a bowl to a cooking pan with a manus in a kitchen", "an someone pours a batter from a arena to a dish with a hand in a kitchen", "an manus pours a flannel-cake from a stadium to a pan with a tool in a kitchen"], "NEG": ["an soul pours a batter from a bowl to a stick with a mitt in a kitchen", "an individual pours a batter from a sports stadium to a hook with a manus in a kitchen", "an hand pours a flapjack from a bowl to a pasta with a tool in a kitchen"]}], ["burying_46.jpg", {"POS": ["minor buries an girl into a sand using a handle at beach", "tiddler buries an girl into a sand using a hand at beach", "twosome buries an female child into a sand using a manus at beach"], "NEG": ["minor buries an young lady into a backboard using a hold at beach", "minor buries an female child into a bottle using a manus at beach", "duet buries an little girl into a rear using a paw at beach"]}], ["stuffing_219.jpg", {"POS": ["the squirrel stuffs the mouth in the table at the nut", "the chipmunk stuffs the peanut in the oral cavity at the table", "the chipmunk stuffs the nut in the oral fissure at the exterior"], "NEG": ["the squirrel stuffs the mouth in the barn at the nut", "the chipmunk stuffs the peanut in the true cat at the table", "the chipmunk stuffs the nut in the stain at the exterior"]}], ["sliding_116.jpg", {"POS": ["the ballplayer slides the slider (when different from the ballplayer) on a terra firma to a bag at a infield.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home at a baseball game.", "the man slides the slider (when different from the man) on a dry land to a base at a sports stadium."], "NEG": ["the ballplayer slides the slider (when different from the ballplayer) on a land to a manpower at a diamond.", "the ballplayer slides the slider (when different from the ballplayer) on a sand to a net at a baseball game.", "the adult male slides the slider (when different from the adult male) on a solid ground to a track at a sports stadium."]}], ["landing_60.jpg", {"POS": ["aeroplane lands on a landing strip at a drome", "airplane lands on a soil at a outdoors", "plane lands on a runway at a drome"], "NEG": ["airplane lands on a left at a airdrome", "aeroplane lands on a barn at a open", "plane lands on a bunny at a aerodrome"]}], ["strapping_136.jpg", {"POS": ["an people straps the mortal into a gurney using a strap at a outside", "an attendant straps the victim into a backboard using a strap at a outdoors", "an worker straps the adult female into a stretcher using a strap at a dry land"], "NEG": ["an people straps the mortal into a fundament using a strap at a outside", "an attender straps the victim into a jug using a strap at a out-of-doors", "an worker straps the woman into a cabinet using a strap at a ground"]}], ["sliding_85.jpg", {"POS": ["the baseball player slides the ballplayer (when different from the baseball player) on a land to a bag at a diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home base at a baseball game.", "the baseball player slides the slider (when different from the baseball player) on a dirt to a home base at a baseball diamond."], "NEG": ["the ballplayer slides the ballplayer (when different from the ballplayer) on a soil to a glass at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a river at a baseball.", "the ballplayer slides the slider (when different from the ballplayer) on a dirt to a paint at a diamond."]}], ["strapping_16.jpg", {"POS": ["an medick straps the mortal into a bed using a strap at a outside", "an paramedical straps the victim into a backboard using a safety harness at a street", "an paramedical straps the somebody into a gurney using a belt at a street"], "NEG": ["an medick straps the individual into a windscreen using a strap at a exterior", "an paramedic straps the victim into a target using a life belt at a street", "an paramedic straps the individual into a chips using a belt at a street"]}], ["leaping_124.jpg", {"POS": ["the male child leaps from the earth over/through an obstacle to the dry land in the beach", "the younker leaps from the rock over/through an rock to the land in the out-of-doors", "the person leaps from the outcropping over/through an obstacle to the sand in the open air"], "NEG": ["the boy leaps from the ground over/through an obstacle to the mixing bowl in the beach", "the spring chicken leaps from the rock over/through an stone to the Petri dish in the outdoors", "the person leaps from the rock outcrop over/through an obstacle to the needle in the open"]}], ["pouncing_127.jpg", {"POS": ["an cheetah pounces onto the crocodile at a shore", "an jaguar pounces onto the crocodile at a beach", "an Acinonyx jubatus pounces onto the crocodile at a river"], "NEG": ["an cheetah pounces onto the flask at a shore", "an jaguar pounces onto the coconut at a beach", "an Acinonyx jubatus pounces onto the human face at a river"]}], ["putting_151.jpg", {"POS": ["an woman puts an makeup into a eye in a room", "an adult female puts an mascara into a cilium in a place", "an woman puts an mascara into a cilium in a interior"], "NEG": ["an adult female puts an composition into a sewer system in a room", "an adult female puts an mascara into a CPU board in a place", "an woman puts an mascara into a back in a inside"]}], ["spilling_130.jpg", {"POS": ["an people spills a pigment from a bucket onto a land at a outdoors", "an people spills a pigment from a bucket onto a person at a street", "an man spills a paint from a bucket onto a blanket at a stairway"], "NEG": ["an people spills a paint from a pail onto a oral fissure at a open", "an people spills a paint from a bucket onto a sea at a street", "an man spills a pigment from a bucket onto a cardboard at a staircase"]}], ["pumping_2.jpg", {"POS": ["an woman pumps a milk from a titty to a container using a pump at a inside", "an adult female pumps a milk from a breast to a bottle using a pump at a place", "an mother pumps a milk from a titty to a bottle using a pump at a place"], "NEG": ["an woman pumps a milk from a boob to a adult female using a pump at a interior", "an woman pumps a milk from a chest to a trampoline using a pump at a place", "an female parent pumps a milk from a boob to a window frame using a pump at a place"]}], ["stuffing_100.jpg", {"POS": ["the woman stuffs the pillow in the pillow slip at the room", "the woman stuffs the cotton in the pillow at the living room", "the woman stuffs the cotton fiber in the pillow at the room"], "NEG": ["the adult female stuffs the pillow in the trail at the room", "the adult female stuffs the cotton in the skyscraper at the sitting room", "the adult female stuffs the cotton wool in the coffin at the room"]}], ["jumping_207.jpg", {"POS": ["an adult male jumps from a drop-off over/through an obstacle (excluding the air) and will end up at a drop at a mount", "an man jumps from a cliff over/through an obstacle (excluding the air) and will end up at a drop at a out-of-doors", "an man jumps from a rock over/through an obstacle (excluding the air) and will end up at a rock at a out-of-doors"], "NEG": ["an adult male jumps from a drop-off over/through an obstacle (excluding the air) and will end up at a board at a mountain", "an adult male jumps from a drop over/through an obstacle (excluding the air) and will end up at a tee at a open air", "an man jumps from a rock over/through an obstacle (excluding the air) and will end up at a letter of the alphabet at a outdoors"]}], ["applying_135.jpg", {"POS": ["woman is applying a lipstick to a lip using mitt in a place.", "woman is applying a lip rouge to a lip using hand in a place.", "adult female is applying a lip rouge to a lip using finger in a interior."], "NEG": ["woman is applying a lip rouge to a boy using mitt in a place.", "adult female is applying a lipstick to a belly using paw in a place.", "adult female is applying a lip rouge to a clinker block using finger in a interior."]}], ["attaching_100.jpg", {"POS": ["an man attaches a rope to a claw with knot using a hand at a open air", "an adult male attaches a rope to a clutch with knot using a paw at a outside", "an agent attaches a rope to a hook with knot using a hand at a exterior"], "NEG": ["an man attaches a rope to a barrow with knot using a paw at a outdoors", "an adult male attaches a rope to a bottle with knot using a hand at a exterior", "an agent attaches a rope to a cat box with knot using a mitt at a exterior"]}], ["pouring_319.jpg", {"POS": ["an female pours a H2O from a jug to a drinking glass with a manus in a countertop", "an adult female pours a water from a jar to a drinking glass with a tool in a tabular array", "an woman pours a H2O from a ewer to a glass with a hand in a kitchen"], "NEG": ["an female pours a H2O from a jug to a Styrofoam with a paw in a countertop", "an woman pours a H2O from a jar to a tube with a tool in a table", "an woman pours a H2O from a ewer to a strip with a hand in a kitchen"]}], ["plunging_138.jpg", {"POS": ["an people plunges a body (when different than the people) into a body of water at a lake", "an people plunges a organic structure (when different than the people) into a water at a lake", "an man plunges a plunged (when different than the man) into a H2O at a lake"], "NEG": ["an people plunges a body (when different than the people) into a glass at a lake", "an people plunges a body (when different than the people) into a stick at a lake", "an adult male plunges a plunged (when different than the adult male) into a metal at a lake"]}], ["tying_156.jpg", {"POS": ["an girl ties an shoe to a paper using a twine at a table", "an little girl ties an shoestring to a composition board using a knot at a table", "an female child ties an autotype to a destination using a shoe string at a classroom"], "NEG": ["an girl ties an shoe to a sink using a twine at a table", "an little girl ties an shoe lace to a physical object using a knot at a table", "an little girl ties an facsimile to a add-in using a shoelace at a schoolroom"]}], ["emptying_172.jpg", {"POS": ["an woman empties an compost from a barrel into a lawn cart using a rake in a garden", "an adult female empties an dirt from a cask into a destination using a shovel in a out-of-doors", "an somebody empties an dirt from a barrel into a cart using a pocket in a open"], "NEG": ["an woman empties an compost from a drum into a mid-calf using a rake in a garden", "an woman empties an dirt from a barrel into a water using a shovel in a open", "an soul empties an soil from a drum into a possessor using a scoop in a out-of-doors"]}], ["pouncing_97.jpg", {"POS": ["an fox pounces onto the snow at a open", "an fox pounces onto the snow at a open", "an fox pounces onto the mouse at a snow"], "NEG": ["an fox pounces onto the centrifuge at a open air", "an fox pounces onto the hinge at a outdoors", "an fox pounces onto the runway at a snow"]}], ["sprinkling_149.jpg", {"POS": ["an man sprinkles an brown sugar from a finger onto a batter at a kitchen", "an adult female sprinkles an spice from a manus onto a pot at a kitchen", "an someone sprinkles an spice from a mitt onto a sauce at a kitchen"], "NEG": ["an man sprinkles an brown sugar from a finger onto a right at a kitchen", "an woman sprinkles an spice from a manus onto a alphabetic character at a kitchen", "an somebody sprinkles an spice from a mitt onto a pole at a kitchen"]}], ["milking_104.jpg", {"POS": ["an man milks a cow with a manus into a bucket in a farm", "an husbandman milks a kine with a mitt into a pail in a barn", "an adult male milks a cow with a paw into a pail in a pen"], "NEG": ["an adult male milks a cow with a mitt into a floor in a farm", "an sodbuster milks a Bos taurus with a manus into a officer in a barn", "an man milks a cow with a manus into a surfboard in a pen"]}], ["slipping_115.jpg", {"POS": ["an man slips onto a floor at a kitchen", "an adult male slips onto a floor at a kitchen", "an man slips onto a floor at a room"], "NEG": ["an adult male slips onto a crochet stitch at a kitchen", "an man slips onto a pie crust at a kitchen", "an man slips onto a base at a room"]}], ["leaking_81.jpg", {"POS": ["a water leaks from a piping onto/into a terra firma at a interior", "a H2O leaks from a piping onto/into a flooring at a room", "a water leaks from a hosepipe onto/into a flooring at a place"], "NEG": ["a H2O leaks from a piping onto/into a turkey at a inside", "a water leaks from a pipe onto/into a sheet metal at a room", "a H2O leaks from a hose onto/into a cervid at a place"]}], ["filling_125.jpg", {"POS": ["mortal fills mug with H2O from water cooler at a place", "individual fills cup with water from water cooler at a place", "individual fills cup with water from faucet at a interior"], "NEG": ["soul fills crop with H2O from water cooler at a place", "individual fills cannister with H2O from water cooler at a place", "someone fills tree with H2O from spigot at a interior"]}], ["milking_188.jpg", {"POS": ["an male child milks a cow with a manus into a pail in a farm", "an shaver milks a moo-cow with a paw into a bucket in a barn", "an twosome milks a cow with a hand into a pail in a barn"], "NEG": ["an male child milks a cow with a mitt into a bunny rabbit in a farm", "an fry milks a moo-cow with a manus into a golf tee in a barn", "an twosome milks a cow with a mitt into a net in a barn"]}], ["landing_23.jpg", {"POS": ["airplane lands on a runway at a drome", "jumbojet lands on a runway at a aerodrome", "plane lands on a runway at a airdrome"], "NEG": ["airplane lands on a oven at a drome", "jumbo jet lands on a drawer at a drome", "airplane lands on a Saccharum officinarum at a airport"]}], ["filling_191.jpg", {"POS": ["adult female fills cannister with water from home at a out-of-doors", "young lady fills jug with water from garden hose at a open", "woman fills bucket with H2O from hose at a outdoors"], "NEG": ["woman fills desert with water from home at a open air", "fille fills set with water from garden hose at a outdoors", "woman fills pavement with H2O from hose at a outdoors"]}], ["raking_186.jpg", {"POS": ["an mortal rakes an foliage from a soil into a mound at a garden", "an people rakes an leafage from a earth into a agglomerate at a outdoors", "an adult male rakes an leafage from a ground into a mound at a backyard"], "NEG": ["an someone rakes an leafage from a ground into a jacket at a garden", "an people rakes an leaf from a solid ground into a tubing at a open", "an man rakes an leafage from a terra firma into a strap at a backyard"]}], ["tying_201.jpg", {"POS": ["an little girl ties an shoe to a human foot using a shoe string at a track", "an fille ties an shoestring to a shoelace using a paw at a course", "an woman ties an shoe to a destination using a shoestring at a exterior"], "NEG": ["an little girl ties an shoe to a kitchen table using a shoestring at a raceway", "an young lady ties an shoe string to a mount using a mitt at a course", "an adult female ties an shoe to a ownership using a shoe lace at a outside"]}], ["leaping_96.jpg", {"POS": ["the basketball player leaps from the basketball court over/through an machine to the basketball court in the covered stadium", "the basketball player leaps from the basketball court over/through an automobile to the basketball hoop in the sports stadium", "the basketball player leaps from the basketball court over/through an obstacle to the basketball court in the basketball court"], "NEG": ["the basketeer leaps from the basketball court over/through an auto to the trough in the covered stadium", "the basketball player leaps from the basketball court over/through an automobile to the drain in the bowl", "the basketball player leaps from the basketball court over/through an obstacle to the roof in the basketball court"]}], ["sprinkling_138.jpg", {"POS": ["an somebody sprinkles an item from a bottle onto a pie shell at a place", "an cook sprinkles an sugar from a bottle onto a sweet at a kitchen", "an person sprinkles an sugar from a cup onto a pie at a room"], "NEG": ["an soul sprinkles an item from a bottle onto a base at a place", "an cook sprinkles an sugar from a bottle onto a sprocket at a kitchen", "an person sprinkles an refined sugar from a cup onto a king of beasts at a room"]}], ["stumbling_31.jpg", {"POS": ["an adult female stumbles onto a flooring at a inside", "an adult female stumbles onto a flooring at a inside", "an adult female stumbles onto a flooring at a place"], "NEG": ["an woman stumbles onto a head at a inside", "an woman stumbles onto a arts and crafts at a interior", "an woman stumbles onto a drop at a place"]}], ["tying_214.jpg", {"POS": ["an soul ties an rope to a box using a hand at a outdoors", "an adult male ties an box to a motortruck using a rope at a open air", "an individual ties an box to a truck bed using a rope at a truck"], "NEG": ["an mortal ties an rope to a cupboard using a paw at a out-of-doors", "an adult male ties an box to a shoelace using a rope at a out-of-doors", "an mortal ties an box to a twine using a rope at a motortruck"]}], ["ejecting_133.jpg", {"POS": ["an man ejects an shell from a rifle toward a land at a open", "an soul ejects an shell from a rifle toward a air at a out-of-doors", "an soldier ejects an shell from a gun toward a destination at a out-of-doors"], "NEG": ["an adult male ejects an shell from a rifle toward a stack at a open air", "an individual ejects an casing from a rifle toward a staircase at a open air", "an soldier ejects an casing from a gun toward a beam at a open air"]}], ["shelving_210.jpg", {"POS": ["the man shelves an box on a shelf in store.", "the adult male shelves an merchandise on a shelf in storage warehouse.", "the man shelves an item on a shelf in storage warehouse."], "NEG": ["the adult male shelves an box on a gap in store.", "the adult male shelves an ware on a ring in warehouse.", "the adult male shelves an item on a dummy in storage warehouse."]}], ["pumping_138.jpg", {"POS": ["an adult female pumps a petrol from a storage to a automobile using a petrol pump at a gasoline station", "an adult female pumps a gasolene from a gasoline tank to a motorcar using a gas pump at a filling station", "an adult female pumps a gas from a storage to a motorcar using a gasoline pump at a petrol station"], "NEG": ["an adult female pumps a gasoline from a storage to a wire using a gas pump at a gas station", "an woman pumps a petrol from a petrol tank to a car seat using a island dispenser at a gasoline station", "an adult female pumps a gaseous state from a storage to a pool using a gas pump at a gasoline station"]}], ["pouring_122.jpg", {"POS": ["an soul pours a liquid from a measuring cup to a drinking glass with a hand in a place", "an mortal pours a inebriant from a cup to a glass with a hand in a room", "an person pours a intoxicant from a cup to a goblet with a hand in a eatery"], "NEG": ["an individual pours a liquid from a measuring cup to a goal with a hand in a place", "an person pours a alcohol from a cup to a tabletop with a hand in a room", "an soul pours a alcohol from a cup to a devotee with a hand in a eatery"]}], ["deflecting_219.jpg", {"POS": ["the soccer player deflected the soccer ball to the goal at the field.", "the soccer player deflected the soccer ball to the netkeeper at the field.", "the adult male deflected the soccer ball to the destination at the field."], "NEG": ["the soccer player deflected the soccer ball to the towel at the field.", "the soccer player deflected the soccer ball to the suit at the field.", "the man deflected the soccer ball to the ceiling at the field."]}], ["spilling_86.jpg", {"POS": ["an rig spills a pigment from a tractor trailer onto a dry land at a outside", "an agent spills a paint from a truck onto a road at a outside", "an people spills a substance from a motortruck onto a street at a open air"], "NEG": ["an articulated lorry spills a pigment from a trailer truck onto a leaving at a exterior", "an agent spills a paint from a motortruck onto a drawer at a outside", "an people spills a substance from a truck onto a mitt at a open air"]}], ["pumping_120.jpg", {"POS": ["an adult female pumps a waste matter from a earth to a storage tank using a hose at a outside", "an man pumps a sewage from a septic tank to a motortruck using a pump at a backyard", "an adult male pumps a sewage from a land to a trucking rig using a hose at a grounds"], "NEG": ["an adult female pumps a waste from a earth to a rig using a hose at a outside", "an adult male pumps a sewerage from a septic tank to a neb using a pump at a backyard", "an man pumps a sewage from a solid ground to a elephant using a hosepipe at a grounds"]}], ["stumbling_165.jpg", {"POS": ["an soccer player stumbles onto a grass at a field", "an soccer player stumbles onto a solid ground at a playing field", "an soccer player stumbles onto a grass at a sports stadium"], "NEG": ["an soccer player stumbles onto a petrol tank at a athletic field", "an soccer player stumbles onto a kitchen at a playing area", "an soccer player stumbles onto a poulet at a sports stadium"]}], ["slipping_130.jpg", {"POS": ["an tennis player slips onto a dry land at a tennis court", "an tennis player slips onto a earth at a tennis court", "an professional tennis player slips onto a land at a tennis court"], "NEG": ["an tennis player slips onto a metropolis at a tennis court", "an tennis player slips onto a squash at a tennis court", "an tennis pro slips onto a potty at a tennis court"]}], ["shelving_145.jpg", {"POS": ["the lass shelves an book on a bookshelf in library.", "the adult female shelves an book on a shelf in place.", "the female child shelves an book on a bookshelf in library."], "NEG": ["the lassie shelves an book on a flower in library.", "the adult female shelves an book on a place in place.", "the little girl shelves an book on a turf in library."]}], ["putting_388.jpg", {"POS": ["an man puts an telegraph pole into a pocket in a shirt", "an adult male puts an cellphone into a pocket in a place", "an somebody puts an telephone set into a pocket in a place"], "NEG": ["an adult male puts an telegraph post into a atmosphere in a shirt", "an adult male puts an mobile phone into a water tap in a place", "an somebody puts an telephone set into a harness in a place"]}], ["throwing_24.jpg", {"POS": ["the people throws an dart towards a dart board at a place.", "the mortal throws an dart towards a dart board at a place.", "the man throws an dart towards a dartboard at a place."], "NEG": ["the people throws an dart towards a uniform at a place.", "the individual throws an dart towards a beer glass at a place.", "the man throws an dart towards a pepper at a place."]}], ["plunging_98.jpg", {"POS": ["an people plunges a human foot (when different than the people) into a ball at a land", "an adult male plunges a leg (when different than the adult male) into a soccer ball at a playing field", "an man plunges a ball (when different than the man) into a terra firma at a field"], "NEG": ["an people plunges a pes (when different than the people) into a tub at a solid ground", "an man plunges a leg (when different than the man) into a tape at a playing area", "an adult male plunges a ball (when different than the adult male) into a reel at a field"]}], ["pooing_269.jpg", {"POS": ["female child poos onto a pot at a room", "baby poos onto a potty seat at a parlour", "girl poos onto a commode at a bedroom"], "NEG": ["girl poos onto a bookshelf at a room", "baby poos onto a flap at a living room", "missy poos onto a bag at a sleeping room"]}], ["ejecting_68.jpg", {"POS": ["an individual ejects an airplane from a source toward a sky at a open", "an prop ejects an pilot from a prop toward a air at a parking lot", "an spaceship ejects an airplane pilot from a spaceship toward a destination at a outside"], "NEG": ["an person ejects an plane from a source toward a opening at a outdoors", "an prop ejects an airplane pilot from a property toward a doorframe at a park", "an spaceship ejects an airplane pilot from a spaceship toward a creature at a exterior"]}], ["lathering_129.jpg", {"POS": ["an person lathers a shaving soap into a cheek at a barber chair", "an man lathers a shaving soap into a human face at a barbershop", "an person lathers a soap into a human face at a room"], "NEG": ["an person lathers a shaving cream into a baseboard at a barber chair", "an adult male lathers a shaving soap into a card table at a barbershop", "an person lathers a soap into a fishing line at a room"]}], ["applying_178.jpg", {"POS": ["woman is applying a substance to a back using tool in a place.", "woman is applying a soap to a back using loufah sponge in a shower.", "adult female is applying a soap to a spine using brush in a shower."], "NEG": ["adult female is applying a substance to a cushion using tool in a place.", "adult female is applying a soap to a eyeball using loufah sponge in a shower.", "woman is applying a soap to a orange using brush in a shower."]}], ["stuffing_25.jpg", {"POS": ["the puffin stuffs the fish in the pecker at the open air", "the puffin stuffs the fish in the bill at the rock", "the bird stuffs the fish in the oral fissure at the open air"], "NEG": ["the puffin stuffs the fish in the lounge at the open air", "the puffin stuffs the fish in the coat at the stone", "the bird stuffs the fish in the kitchen at the outdoors"]}], ["slipping_9.jpg", {"POS": ["an adult male slips onto a flooring at a room", "an man slips onto a base at a room", "an man slips onto a flooring at a room"], "NEG": ["an adult male slips onto a cup at a room", "an adult male slips onto a crack at a room", "an man slips onto a pipe at a room"]}], ["spilling_182.jpg", {"POS": ["an agent spills a pillow from a source onto a floor at a house", "an agent spills a throw pillow from a fireplace onto a floor at a living-room", "an agent spills a pillow from a source onto a floor at a living room"], "NEG": ["an agent spills a pillow from a source onto a lip at a house", "an agent spills a throw pillow from a hearth onto a recycling bin at a living room", "an agent spills a pillow from a source onto a pickup at a living-room"]}], ["filling_237.jpg", {"POS": ["mortal fills water bottle with water from water bottle at a room", "person fills bottle with H2O from source at a place", "individual fills bottle with liquid from dispenser at a place"], "NEG": ["someone fills goblet with H2O from water bottle at a room", "someone fills tractor with H2O from source at a place", "soul fills pot with liquid from dispenser at a place"]}], ["strapping_184.jpg", {"POS": ["an people straps the soul into a gurney using a strap at a ground", "an people straps the mortal into a gurney using a strap at a gurney", "an paramedical straps the woman into a stretcher using a strap at a highway"], "NEG": ["an people straps the somebody into a sloping trough using a strap at a solid ground", "an people straps the someone into a van using a strap at a gurney", "an paramedic straps the adult female into a meat using a strap at a main road"]}], ["stumbling_97.jpg", {"POS": ["an adult male stumbles onto a earth at a exterior", "an drunkard stumbles onto a solid ground at a road", "an man stumbles onto a land at a exterior"], "NEG": ["an man stumbles onto a undersurface at a exterior", "an inebriate stumbles onto a cheek at a road", "an adult male stumbles onto a fruit at a outside"]}], ["landing_151.jpg", {"POS": ["airplane lands on a runway at a drome", "airplane lands on a runway at a aerodrome", "airplane lands on a runway at a aerodrome"], "NEG": ["plane lands on a track at a airdrome", "aeroplane lands on a painting at a aerodrome", "aeroplane lands on a board at a airdrome"]}], ["pouring_365.jpg", {"POS": ["an man pours a substance from a jar to a arena with a paw in a interior", "an person pours a liquid from a bottle to a bowl with a hand in a interior", "an man pours a substance from a jug to a bowl with a manus in a room"], "NEG": ["an man pours a substance from a jar to a dish with a manus in a inside", "an somebody pours a liquid from a bottle to a mug with a mitt in a inside", "an man pours a substance from a jug to a wrist with a manus in a room"]}], ["leaping_203.jpg", {"POS": ["the climber leaps from the solid ground over/through an crevasse to the ground in the mount", "the adult male leaps from the rock over/through an hole to the stone in the open air", "the someone leaps from the land over/through an cavity to the dry land in the open"], "NEG": ["the climber leaps from the ground over/through an crevasse to the cafeteria in the mount", "the man leaps from the stone over/through an hole to the sea lion in the outdoors", "the individual leaps from the solid ground over/through an pit to the sky in the open"]}], ["pinning_74.jpg", {"POS": ["adult female is pinning the rosebush onto a suit of clothes in place.", "adult female is pinning the flower onto a lapel in place.", "young woman is pinning the boutonniere onto a lapel in place."], "NEG": ["woman is pinning the rose onto a friend in place.", "woman is pinning the flower onto a sunset in place.", "young woman is pinning the boutonniere onto a bathroom in place."]}], ["stumbling_220.jpg", {"POS": ["an soccer player stumbles onto a grass at a playing area", "an soccer player stumbles onto a grass at a stadium", "an soccer player stumbles onto a grass at a playing field"], "NEG": ["an soccer player stumbles onto a crochet stitch at a field", "an soccer player stumbles onto a specimen bottle at a bowl", "an soccer player stumbles onto a crop at a playing field"]}], ["filling_31.jpg", {"POS": ["woman fills petrol tank with gasoline from storage tank at a gas station", "woman fills petrol tank with gas from hosepipe at a gas station", "individual fills machine with gasoline from hosepipe at a gas station"], "NEG": ["woman fills brick with petrol from storage tank at a petrol station", "woman fills sky with gasolene from hosepipe at a petrol station", "mortal fills rock with gas from hosepipe at a petrol station"]}], ["installing_216.jpg", {"POS": ["an man installs a light source into a pole using a manus at a exterior", "an adult male installs a satellite transmitter into a roof using a paw at a building", "an adult male installs a solar cell into a roof using a stand at a Republic of Haiti"], "NEG": ["an man installs a light source into a dirt using a manus at a exterior", "an man installs a satellite transmitter into a trail using a paw at a edifice", "an adult male installs a solar cell into a shotgun using a rack at a Haiti"]}], ["attaching_202.jpg", {"POS": ["an woman attaches a paper to a destination with gum using a hand at a place", "an mortal attaches a paper to a pencil with glue using a tool at a place", "an soul attaches a paper to a pencil with gum using a tool at a place"], "NEG": ["an adult female attaches a paper to a pond with gum using a mitt at a place", "an someone attaches a newspaper to a trough with gum using a tool at a place", "an mortal attaches a paper to a coat with gum using a tool at a place"]}], ["spraying_31.jpg", {"POS": ["an painter sprays a paint onto a wall from a spray using a TOOL in a house", "an man sprays a liquid onto a wall from a hosepipe using a TOOL in a room", "an painter sprays a paint onto a wall from a spray gun using a TOOL in a interior"], "NEG": ["an painter sprays a pigment onto a cup from a atomizer using a TOOL in a house", "an man sprays a liquid onto a flower from a hosepipe using a TOOL in a room", "an painter sprays a paint onto a storage area from a spray gun using a TOOL in a inside"]}], ["splashing_201.jpg", {"POS": ["an male child splashes a male child with a H2O using a hand in a pond", "an small fry splashes a tyke with a H2O using a hand in a outside", "an male child splashes a bod with a water using a tool in a pool"], "NEG": ["an boy splashes a joist with a H2O using a paw in a pool", "an youngster splashes a net with a H2O using a mitt in a outside", "an boy splashes a biscuit with a H2O using a tool in a pool"]}], ["parachuting_146.jpg", {"POS": ["the man parachuted using a parachute to the terra firma at the solid ground.", "the man chuted using a chute to the land at the out-of-doors.", "the adult male chuted using a chute to the solid ground at the field."], "NEG": ["the adult male parachuted using a parachute to the eye at the land.", "the adult male parachuted using a parachute to the military uniform at the out-of-doors.", "the adult male parachuted using a parachute to the holder at the field."]}], ["sliding_137.jpg", {"POS": ["the ballplayer slides the slider (when different from the ballplayer) on a solid ground to a base at a infield.", "the ballplayer slides the slider (when different from the ballplayer) on a air to a home base at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a ground to a base at a playing field."], "NEG": ["the baseball player slides the slider (when different from the baseball player) on a terra firma to a sales booth at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a air to a trim at a diamond.", "the ballplayer slides the slider (when different from the ballplayer) on a ground to a pupil at a field."]}], ["pumping_60.jpg", {"POS": ["an man pumps a water from a ground to a pail using a water pump at a exterior", "an man pumps a H2O from a ground to a pail using a pump at a outside", "an man pumps a water from a dry land to a pail using a pump at a out-of-doors"], "NEG": ["an man pumps a H2O from a land to a scrap using a water pump at a outside", "an man pumps a H2O from a earth to a Zea mays using a pump at a exterior", "an adult male pumps a H2O from a land to a shoelace using a pump at a out-of-doors"]}], ["milking_177.jpg", {"POS": ["an adult female milks a caprine animal with a hand into a jar in a farm", "an adult female milks a moo-cow with a mitt into a pail in a exterior", "an woman milks a caprine animal with a mitt into a pail in a open air"], "NEG": ["an woman milks a goat with a paw into a door latch in a farm", "an woman milks a cow with a paw into a younker in a exterior", "an adult female milks a goat with a hand into a lid in a out-of-doors"]}], ["leaking_173.jpg", {"POS": ["a H2O leaks from a wall onto/into a body of water at a dyke", "a H2O leaks from a wall onto/into a dry land at a out-of-doors", "a H2O leaks from a wall onto/into a pond at a open"], "NEG": ["a H2O leaks from a wall onto/into a optical lens at a dyke", "a H2O leaks from a wall onto/into a solid food at a open air", "a water leaks from a wall onto/into a rabbit at a open"]}], ["strapping_230.jpg", {"POS": ["an woman straps the waistline into a destination using a buckle at a place", "an adult female straps the belt into a waistline using a belt at a room", "an woman straps the waist into a belt using a buckle at a room"], "NEG": ["an woman straps the waistline into a metal using a buckle at a place", "an woman straps the belt into a separator using a belt at a room", "an adult female straps the waist into a asphalt using a buckle at a room"]}], ["installing_57.jpg", {"POS": ["an man installs a transmitting aerial into a roof using a manus at a open", "an person installs a aerial into a roof using a manus at a outside", "an man installs a transmitting aerial into a roof using a hand at a house"], "NEG": ["an adult male installs a transmitting aerial into a bag using a paw at a open", "an somebody installs a antenna into a brute using a hand at a exterior", "an adult male installs a transmitting aerial into a arena using a manus at a house"]}], ["sprinkling_150.jpg", {"POS": ["an chef sprinkles an cheese from a bowl onto a pizza at a kitchen", "an chef sprinkles an mozzarella from a paw onto a pizza pie at a kitchen table", "an somebody sprinkles an cheese from a bowl onto a pizza at a inside"], "NEG": ["an chef sprinkles an cheese from a bowl onto a downhill at a kitchen", "an chef sprinkles an mozzarella from a hand onto a rubbish at a kitchen table", "an person sprinkles an cheese from a bowl onto a soccer ball at a inside"]}], ["spilling_166.jpg", {"POS": ["an manus spills a juice from a ewer onto a cup at a room", "an somebody spills a liquid from a pitcher onto a drinking glass at a place", "an mortal spills a liquid from a ewer onto a drinking glass at a place"], "NEG": ["an mitt spills a juice from a pitcher onto a net at a room", "an person spills a liquid from a pitcher onto a stick at a place", "an somebody spills a liquid from a ewer onto a underframe at a place"]}], ["pooing_136.jpg", {"POS": ["man poos onto a stool at a bathroom", "adult male poos onto a potty at a toilet", "adult male poos onto a throne at a bath"], "NEG": ["man poos onto a Panthera pardus at a bath", "man poos onto a buckle at a toilet", "adult male poos onto a trim at a bathroom"]}], ["dripping_309.jpg", {"POS": ["the woman drips the blood from the eye to the cheek in the place", "the oculus drips the war paint from the teardrop to the cheek in the place", "the individual drips the mascara from the oculus to the cheek in the face"], "NEG": ["the adult female drips the blood from the eye to the pressman in the place", "the oculus drips the make-up from the teardrop to the gun in the place", "the person drips the mascara from the eye to the tank in the face"]}], ["raking_96.jpg", {"POS": ["an yearling rakes an leafage from a ground into a heap at a yard", "an child rakes an leafage from a terra firma into a mound at a backyard", "an toddler rakes an leafage from a solid ground into a pile at a backyard"], "NEG": ["an yearling rakes an leafage from a ground into a storage area at a yard", "an kid rakes an foliage from a ground into a palpebra at a backyard", "an yearling rakes an foliage from a ground into a stomach at a backyard"]}], ["emptying_84.jpg", {"POS": ["an woman empties an item from a bag into a pail using a paw in a interior", "an adult female empties an grain from a gunnysack into a bin using a hook in a shed", "an adult female empties an dirt from a paper bag into a pail using a hand in a barn"], "NEG": ["an adult female empties an item from a bag into a grounds using a hand in a interior", "an woman empties an cereal from a burlap bag into a flooring using a hook in a shed", "an woman empties an soil from a sack into a person using a paw in a barn"]}], ["stuffing_173.jpg", {"POS": ["the nestling stuffs the travelling bag in the paw at the room", "the fille stuffs the arm in the jacket at the interior", "the little girl stuffs the item in the bag at the flooring"], "NEG": ["the child stuffs the traveling bag in the flattop at the room", "the young woman stuffs the arm in the squash at the inside", "the female child stuffs the item in the board at the flooring"]}]]