[["putting_126.jpg", {"POS": ["an adult female puts an lip rouge into a lip in a bedchamber", "an woman puts an lip rouge into a lip in a inside", "an woman puts an lip rouge into a lip in a table"], "NEG": ["an adult female puts an lipstick into a soccer player in a chamber", "an woman puts an lipstick into a tyre in a interior", "an adult female puts an lipstick into a plot of land in a table"]}], ["pumping_170.jpg", {"POS": ["an adult male pumps a water from a water pump to a paw using a lever at a park", "an adult male pumps a H2O from a solid ground to a paw using a pump at a out-of-doors", "an man pumps a water from a solid ground to a mitt using a pump at a outdoors"], "NEG": ["an adult male pumps a H2O from a water pump to a forward using a lever at a green", "an man pumps a water from a land to a pillow using a pump at a open air", "an adult male pumps a water from a earth to a puzzle using a pump at a out-of-doors"]}], ["sliding_153.jpg", {"POS": ["the baseball player slides the slider (when different from the baseball player) on a dry land to a bag at a diamond.", "the baseball player slides the slider (when different from the baseball player) on a filth to a platelet at a ball field.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home plate at a baseball."], "NEG": ["the baseball player slides the slider (when different from the baseball player) on a earth to a tin at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a stain to a coney at a baseball field.", "the ballplayer slides the slider (when different from the ballplayer) on a sand to a rugby at a baseball game."]}], ["pooing_9.jpg", {"POS": ["adult male poos onto a john at a comfort station", "adult male poos onto a can at a bathroom", "adult male poos onto a can at a can"], "NEG": ["man poos onto a downhill at a comfort station", "adult male poos onto a grate at a bathroom", "man poos onto a purse at a bathroom"]}], ["milking_69.jpg", {"POS": ["an dairyman milks a milch cow with a milking machine into a milk can in a dairy", "an people milks a cow with a hosepipe into a container in a farm", "an granger milks a moo-cow with a milking machine into a container in a barn"], "NEG": ["an dairyman milks a dairy cow with a milking machine into a shore in a dairy", "an people milks a cow with a hose into a ocean in a farm", "an husbandman milks a cow with a milking machine into a exterior in a barn"]}], ["putting_67.jpg", {"POS": ["an man puts an seatbelt into a thorax in a auto", "an man puts an seat belt into a physical structure in a auto", "an man puts an seat belt into a body in a machine"], "NEG": ["an adult male puts an seatbelt into a pastry in a motorcar", "an man puts an seatbelt into a block in a machine", "an man puts an seatbelt into a coat in a car"]}], ["throwing_211.jpg", {"POS": ["the adult male throws an baseball towards a backstop at a ball field.", "the ballplayer throws an baseball towards a ballplayer at a baseball field.", "the male throws an baseball towards a male at a arena."], "NEG": ["the adult male throws an baseball towards a cake at a ball field.", "the ballplayer throws an baseball towards a floor at a baseball field.", "the male throws an baseball towards a sauce at a stadium."]}], ["leaping_11.jpg", {"POS": ["the woman leaps from the land over/through an obstacle to the solid ground in the beach", "the adult female leaps from the sand over/through an sand to the sand in the beach", "the woman leaps from the earth over/through an obstacle to the earth in the beach"], "NEG": ["the adult female leaps from the earth over/through an obstacle to the block in the beach", "the woman leaps from the sand over/through an sand to the microscope in the beach", "the woman leaps from the solid ground over/through an obstacle to the gym mat in the beach"]}], ["deflecting_224.jpg", {"POS": ["the adult male deflected the slug to the head at the inside.", "the man deflected the punch to the side at the place.", "the adult male deflected the arm to the side at the room."], "NEG": ["the man deflected the lick to the beam at the interior.", "the man deflected the lick to the target at the place.", "the man deflected the arm to the tin can at the room."]}], ["deflecting_153.jpg", {"POS": ["the man deflected the punch to the thorax at the interior.", "the arm deflected the lick to the side at the exterior.", "the adult male deflected the arm to the left at the interior."], "NEG": ["the man deflected the clout to the mixing bowl at the interior.", "the arm deflected the slug to the swoop at the exterior.", "the man deflected the arm to the fruit at the interior."]}], ["milking_78.jpg", {"POS": ["an husbandman milks a cow with a hand into a bowl in a exterior", "an adult male milks a cow with a hand into a bowl in a outdoors", "an adult male milks a moo-cow with a paw into a pail in a outside"], "NEG": ["an farmer milks a cow with a hand into a goal in a outside", "an man milks a cow with a manus into a rope in a open air", "an adult male milks a moo-cow with a paw into a potty chair in a exterior"]}], ["applying_186.jpg", {"POS": ["adult female is applying a war paint to a brow using brush in a place.", "mortal is applying a make-up to a supercilium using brush in a place.", "adult female is applying a mascara to a brow using brush in a place."], "NEG": ["woman is applying a war paint to a barrel using brush in a place.", "someone is applying a make-up to a scattergun using brush in a place.", "woman is applying a mascara to a market place using brush in a place."]}], ["milking_139.jpg", {"POS": ["an man milks a camel with a manus into a bowl in a desert", "an adult male milks a camel with a manus into a bowl in a outside", "an man milks a camel with a paw into a bowl in a desert"], "NEG": ["an man milks a camel with a paw into a plywood in a desert", "an man milks a camel with a paw into a router in a outside", "an adult male milks a camel with a mitt into a wall in a desert"]}], ["milking_8.jpg", {"POS": ["an adult female milks a cow with a hand into a bucket in a open air", "an woman milks a kine with a hand into a pail in a exterior", "an woman milks a kine with a manus into a bucket in a open"], "NEG": ["an woman milks a cow with a hand into a tablecloth in a outdoors", "an adult female milks a Bos taurus with a manus into a netkeeper in a exterior", "an adult female milks a cattle with a mitt into a desktop in a outdoors"]}], ["strapping_34.jpg", {"POS": ["an somebody straps the framework into a destination using a textile at a place", "an man straps the plastic into a pole using a tape at a interior", "an man straps the deck chair into a framework using a plastic at a place"], "NEG": ["an individual straps the framework into a skin using a material at a place", "an man straps the plastic into a petrol engine using a tape at a interior", "an adult male straps the beach chair into a grassland using a plastic at a place"]}], ["raking_23.jpg", {"POS": ["an man rakes an leaf from a solid ground into a agglomerate at a grounds", "an man rakes an foliage from a land into a destination at a out-of-doors", "an Methuselah rakes an foliage from a dry land into a plenty at a out-of-doors"], "NEG": ["an man rakes an leafage from a land into a metal at a grounds", "an man rakes an leaf from a solid ground into a stone at a open air", "an old man rakes an leaf from a earth into a baseball diamond at a out-of-doors"]}], ["sliding_108.jpg", {"POS": ["the baseball player slides the slider (when different from the baseball player) on a solid ground to a base at a ball field.", "the ballplayer slides the slider (when different from the ballplayer) on a sand to a plate at a baseball.", "the man slides the slider (when different from the man) on a soil to a plate at a baseball field."], "NEG": ["the ballplayer slides the slider (when different from the ballplayer) on a ground to a plywood at a baseball field.", "the ballplayer slides the slider (when different from the ballplayer) on a sand to a mate at a baseball.", "the adult male slides the slider (when different from the adult male) on a soil to a sea at a diamond."]}], ["placing_213.jpg", {"POS": ["man placed placeditem in destination along ALREADYplaceditem in outside", "man placed putty in cinder block along ALREADYputty in open", "man placed grout in brick along ALREADYgrout in exterior"], "NEG": ["adult male placed placeditem in pie along ALREADYplaceditem in outside", "man placed putty in artistic creation along ALREADYputty in out-of-doors", "man placed grout in separator along ALREADYgrout in outside"]}], ["putting_83.jpg", {"POS": ["an people puts an book into a bookshelf in a library", "an people puts an book into a shelf in a library", "an people puts an book into a shelf in a library"], "NEG": ["an people puts an book into a turntable in a library", "an people puts an book into a pillow in a library", "an people puts an book into a tablecloth in a library"]}], ["stuffing_293.jpg", {"POS": ["the adult male stuffs the rima oris in the outdoors at the hamburger", "the man stuffs the hamburger in the oral fissure at the oral fissure", "the man stuffs the beefburger in the oral cavity at the exterior"], "NEG": ["the man stuffs the rima oris in the tile at the beefburger", "the man stuffs the hamburger in the cart at the oral fissure", "the man stuffs the hamburger in the forward at the exterior"]}], ["stuffing_204.jpg", {"POS": ["the adult male stuffs the mouth in the destination at the licorice", "the adult male stuffs the confect in the rima oris at the motorcar", "the somebody stuffs the candy in the oral cavity at the vehicle"], "NEG": ["the adult male stuffs the oral cavity in the pocketbook at the liquorice", "the man stuffs the candy in the brush at the machine", "the mortal stuffs the candy in the right at the vehicle"]}], ["stuffing_234.jpg", {"POS": ["the adult female stuffs the pizza in the oral fissure at the place", "the adult female stuffs the pizza pie in the rima oris at the table", "the woman stuffs the pizza pie in the mouth at the place"], "NEG": ["the adult female stuffs the pizza pie in the manakin at the place", "the adult female stuffs the pizza in the casserole at the table", "the woman stuffs the pizza pie in the sand at the place"]}], ["landing_34.jpg", {"POS": ["bird lands on a arm at a desert", "bird lands on a glove at a out-of-doors", "peregrine falcon lands on a hand at a field"], "NEG": ["bird lands on a trampoline at a desert", "bird lands on a microwave oven at a out-of-doors", "Falco peregrinus lands on a motortruck at a field"]}], ["taping_224.jpg", {"POS": ["an adult male tapes an pes to a destination at a open", "an adult male tapes an human foot to a metatarsal arch at a open air", "an person tapes an tape to a pes at a outdoors"], "NEG": ["an adult male tapes an foot to a toilet at a open air", "an man tapes an pes to a food at a out-of-doors", "an someone tapes an tape to a crochet stitch at a outdoors"]}], ["deflecting_191.jpg", {"POS": ["the man deflected the biff to the head at the interior.", "the instructor deflected the arm to the face at the gymnasium.", "the arm deflected the lick to the side at the interior."], "NEG": ["the man deflected the biff to the drum at the interior.", "the instructor deflected the arm to the window frame at the gymnasium.", "the arm deflected the lick to the breast pocket at the interior."]}], ["milking_167.jpg", {"POS": ["an tike milks a simulation with a paw into a destination in a building", "an child milks a source with a hand into a pail in a room", "an nestling milks a reproduction with a hand into a pail in a museum"], "NEG": ["an minor milks a simulation with a hand into a batter in a building", "an kid milks a source with a paw into a current of air in a room", "an nipper milks a replica with a mitt into a machine in a museum"]}], ["sliding_236.jpg", {"POS": ["the small fry slides the slider (when different from the small fry) on a slide to a land at a outside.", "the boy slides the slider (when different from the boy) on a playground slide to a bottom at a playground slide.", "the boy slides the slider (when different from the boy) on a slideway to a undersurface at a playground."], "NEG": ["the nestling slides the slider (when different from the nestling) on a slide to a beach at a outside.", "the boy slides the slider (when different from the boy) on a slide to a arts and crafts at a slide.", "the boy slides the slider (when different from the boy) on a sloping trough to a right at a playground."]}], ["milking_163.jpg", {"POS": ["an Black man milks a cow with a paw into a bucket in a farm", "an mitt milks a cow with a paw into a pail in a barn", "an adult male milks a cow with a manus into a pail in a open"], "NEG": ["an Black man milks a cow with a mitt into a leopard in a farm", "an paw milks a moo-cow with a mitt into a coaster in a barn", "an man milks a cow with a hand into a henhouse in a open air"]}], ["fastening_22.jpg", {"POS": ["an mortal fastens an seat belt into a buckle with a knife using a manus at a vehicle", "an soul fastens an seat belt into a buckle with a fixing using a paw at a place", "an someone fastens an seatbelt into a buckle with a clasp using a mitt at a car"], "NEG": ["an individual fastens an seat belt into a goalie with a knife using a mitt at a vehicle", "an mortal fastens an seatbelt into a crowd with a fastener using a hand at a place", "an someone fastens an seatbelt into a stamp with a clasp using a mitt at a motorcar"]}], ["milking_27.jpg", {"POS": ["an child milks a moo-cow with a manus into a pail in a fair", "an tike milks a simulation with a paw into a pail in a building", "an farmer milks a moo-cow with a paw into a pail in a barn"], "NEG": ["an child milks a moo-cow with a manus into a air in a fair", "an kid milks a model with a mitt into a tube in a edifice", "an farmer milks a moo-cow with a hand into a frypan in a barn"]}], ["stuffing_266.jpg", {"POS": ["the squirrel stuffs the oral fissure in the out-of-doors at the nut", "the squirrel stuffs the peanut in the oral fissure at the exterior", "the chipmunk stuffs the nut in the mouth at the outside"], "NEG": ["the squirrel stuffs the oral cavity in the branch at the nut", "the squirrel stuffs the peanut in the route at the exterior", "the chipmunk stuffs the nut in the hubby at the outside"]}], ["pumping_63.jpg", {"POS": ["an man pumps a sludge from a ground to a motortruck using a truck at a exterior", "an adult male pumps a sewage from a septic tank to a motortruck using a hose at a outside", "an man pumps a waste product from a earth to a truck using a hosepipe at a land"], "NEG": ["an adult male pumps a sludge from a solid ground to a steps using a motortruck at a outside", "an man pumps a sewerage from a septic tank to a bedding using a hose at a outside", "an man pumps a waste from a solid ground to a wall using a hosepipe at a terra firma"]}], ["applying_10.jpg", {"POS": ["adult female is applying a lip rouge to a lip using mitt in a interior.", "adult female is applying a lip rouge to a mouth using manus in a place.", "woman is applying a lipstick to a lip using lipstick in a place."], "NEG": ["adult female is applying a lipstick to a surface using manus in a inside.", "adult female is applying a lip rouge to a gym mat using manus in a place.", "woman is applying a lip rouge to a lover using lipstick in a place."]}], ["milking_102.jpg", {"POS": ["an painting milks a source with a tool into a destination in a place", "an woman milks a moo-cow with a manus into a bucket in a barn", "an adult female milks a cow with a manus into a pail in a barnyard"], "NEG": ["an picture milks a source with a tool into a desktop in a place", "an adult female milks a cow with a manus into a goal in a barn", "an woman milks a cow with a paw into a grassland in a barnyard"]}], ["milking_103.jpg", {"POS": ["an woman milks a cow with a mitt into a bucket in a outdoors", "an adult female milks a oxen with a manus into a bucket in a exterior", "an woman milks a cow with a paw into a pail in a barnyard"], "NEG": ["an woman milks a cow with a manus into a router in a out-of-doors", "an woman milks a Bos taurus with a hand into a surface in a exterior", "an woman milks a cow with a hand into a finger in a barnyard"]}], ["milking_209.jpg", {"POS": ["an sodbuster milks a moo-cow with a mitt into a bucket in a farm", "an adult female milks a moo-cow with a mitt into a pail in a open", "an adult female milks a cow with a paw into a bucket in a field"], "NEG": ["an farmer milks a moo-cow with a mitt into a file in a farm", "an woman milks a cow with a hand into a field in a open air", "an adult female milks a cow with a manus into a wire in a field"]}], ["filling_54.jpg", {"POS": ["nipper fills cup with H2O from spigot at a kitchen", "girl fills cup with H2O from tap at a kitchen", "girl fills cup with water from spigot at a kitchen"], "NEG": ["minor fills harness with H2O from faucet at a kitchen", "female child fills pizza with H2O from hydrant at a kitchen", "little girl fills motorbus with water from spigot at a kitchen"]}], ["pouring_175.jpg", {"POS": ["an barman pours a spirits from a bottle to a shot glass with a paw in a bar", "an individual pours a alcoholic drink from a bottle to a pony with a paw in a interior", "an bartender pours a spirits from a bottle to a glass with a spout in a bar"], "NEG": ["an barman pours a hard drink from a bottle to a sweet with a manus in a ginmill", "an someone pours a alcohol from a bottle to a cup with a paw in a inside", "an mixologist pours a strong drink from a bottle to a photographic camera with a spout in a bar"]}], ["sliding_60.jpg", {"POS": ["the fille slides the slider (when different from the fille) on a grass to a soccer ball at a domain.", "the people slides the slider (when different from the people) on a grass to a destination at a outside.", "the soccer player slides the slider (when different from the soccer player) on a grass to a ground at a athletic field."], "NEG": ["the fille slides the slider (when different from the fille) on a grass to a field at a sphere.", "the people slides the slider (when different from the people) on a grass to a volaille at a outside.", "the soccer player slides the slider (when different from the soccer player) on a grass to a router at a field."]}], ["stuffing_209.jpg", {"POS": ["the woman stuffs the food in the rima oris at the interior", "the adult female stuffs the rima oris in the destination at the poulet", "the adult female stuffs the home fries in the mouth at the table"], "NEG": ["the adult female stuffs the food in the base at the interior", "the adult female stuffs the rima oris in the midair at the chicken", "the woman stuffs the home-fried potatoes in the place at the table"]}], ["stuffing_328.jpg", {"POS": ["the squirrel stuffs the rima oris in the open at the nut", "the chipmunk stuffs the peanut in the mouth at the terrace", "the chipmunk stuffs the nut in the mouth at the outside"], "NEG": ["the squirrel stuffs the mouth in the hockey stick at the nut", "the chipmunk stuffs the peanut in the knee joint at the patio", "the chipmunk stuffs the nut in the pocket at the outside"]}], ["landing_49.jpg", {"POS": ["bird of Jove lands on a branch at a open air", "Haliaeetus leucocephalus lands on a branch at a tree", "bird of Jove lands on a stick at a open air"], "NEG": ["bird of Jove lands on a neck at a out-of-doors", "American eagle lands on a ambulance at a tree", "eagle lands on a dummy at a out-of-doors"]}], ["lathering_0.jpg", {"POS": ["an adult female lathers a shaving cream into a human face at a beauty parlour", "an adult female lathers a soap into a human face at a salon", "an man lathers a shaving soap into a human face at a salon"], "NEG": ["an woman lathers a shaving soap into a flap at a beauty parlour", "an adult female lathers a soap into a cushion at a salon", "an man lathers a shaving soap into a cutis at a beauty parlour"]}], ["applying_370.jpg", {"POS": ["man is applying a eye-drop to a optic using container in a place.", "adult male is applying a water to a oculus using dropper in a room.", "man is applying a eyedrop to a eyeball using dropper in a place."], "NEG": ["man is applying a eyedrop to a runway using container in a place.", "man is applying a water to a unknown using dropper in a room.", "adult male is applying a eyedrop to a bull using eye dropper in a place."]}], ["fastening_87.jpg", {"POS": ["an lady fastens an glove into a paw with a elastic using a hand at a out-of-doors", "an person fastens an glove into a manus with a Velcro using a manus at a open air", "an someone fastens an baseball mitt into a manus with a strap using a hand at a outdoors"], "NEG": ["an lady fastens an glove into a back with a elastic using a mitt at a outdoors", "an soul fastens an glove into a clutches with a Velcro using a hand at a open", "an person fastens an baseball glove into a shotgun with a strap using a manus at a outdoors"]}], ["stuffing_160.jpg", {"POS": ["the boy stuffs the item in the mouth at the table", "the male child stuffs the nutrient in the mouth at the table", "the man stuffs the nutrient in the mouth at the place"], "NEG": ["the boy stuffs the item in the animal at the table", "the male child stuffs the food in the audience at the table", "the adult male stuffs the nutrient in the pot at the place"]}], ["throwing_207.jpg", {"POS": ["the basketball player throws an basketball towards a basketball hoop at a basketball court.", "the girl throws an basketball towards a basketball hoop at a gym.", "the female throws an basketball game towards a basketball game at a arena."], "NEG": ["the cager throws an basketball towards a tongs at a basketball court.", "the missy throws an basketball towards a grip at a gym.", "the female throws an basketball game towards a sewage works at a stadium."]}], ["putting_102.jpg", {"POS": ["an ballerina puts an shoelace into a astragal in a stage", "an adult female puts an shoe into a foot in a studio", "an woman puts an bauble into a hand in a inside"], "NEG": ["an danseuse puts an shoe string into a due north in a stage", "an adult female puts an shoe into a turkey in a studio", "an woman puts an gaud into a lion in a interior"]}], ["sliding_244.jpg", {"POS": ["the ballplayer slides the slider (when different from the ballplayer) on a ground to a stand at a field.", "the baseball player slides the slider (when different from the baseball player) on a earth to a base at a diamond.", "the ballplayer slides the slider (when different from the ballplayer) on a earth to a home plate at a baseball diamond."], "NEG": ["the baseball player slides the slider (when different from the baseball player) on a earth to a building at a field.", "the baseball player slides the slider (when different from the baseball player) on a terra firma to a steak at a ball field.", "the baseball player slides the slider (when different from the baseball player) on a earth to a suitcase at a infield."]}], ["stuffing_193.jpg", {"POS": ["the infant stuffs the nutrient in the rima oris at the inside", "the boy stuffs the nutrient in the mouth at the bedchamber", "the babe stuffs the food in the oral fissure at the place"], "NEG": ["the baby stuffs the food in the compost heap at the inside", "the male child stuffs the nutrient in the bar at the bedchamber", "the infant stuffs the nutrient in the cupboard at the place"]}], ["milking_59.jpg", {"POS": ["an husbandman milks a milcher with a mitt into a pail in a barn", "an man milks a cow with a paw into a bucket in a farm", "an sodbuster milks a cow with a mitt into a bucket in a barn"], "NEG": ["an husbandman milks a milker with a manus into a ladder in a barn", "an adult male milks a cow with a paw into a shoe in a farm", "an farmer milks a cow with a manus into a ownership in a barn"]}], ["putting_71.jpg", {"POS": ["an reenactor puts an blanket into a destination in a open air", "an woman puts an mantle into a dorsum in a field", "an reenactor puts an stuff into a bag in a out-of-doors"], "NEG": ["an reenactor puts an cover into a rubbish in a open air", "an adult female puts an cape into a tike in a field", "an reenactor puts an stuff into a washbowl in a out-of-doors"]}], ["attaching_228.jpg", {"POS": ["an person attaches a strap to a landing gear with eyelet using a manus at a exterior", "an man attaches a rope to a wheel with glue using a tool at a open air", "an paw attaches a rope to a hook with claw using a glove at a outdoors"], "NEG": ["an soul attaches a strap to a rugger with loop using a paw at a exterior", "an man attaches a rope to a pair of tongs with glue using a tool at a open air", "an hand attaches a rope to a gun with claw using a glove at a out-of-doors"]}], ["raking_69.jpg", {"POS": ["an male child rakes an leaf from a solid ground into a heap at a curtilage", "an people rakes an leaf from a land into a pile at a open", "an someone rakes an leaf from a terra firma into a heap at a yard"], "NEG": ["an boy rakes an leafage from a ground into a bottom at a grounds", "an people rakes an foliage from a dry land into a heap at a open air", "an someone rakes an leaf from a earth into a distance at a yard"]}], ["fetching_136.jpg", {"POS": ["the Black woman fetches the H2O from pipe and brings it to house, in open.", "the duo fetches the water from faucet and brings it to jug, in town.", "the people fetches the H2O from pump and brings it to container, in settlement."], "NEG": ["the Black woman fetches the water from pipe and brings it to patch, in open air.", "the duo fetches the water from faucet and brings it to cable, in town.", "the people fetches the water from pump and brings it to case, in small town."]}], ["placing_22.jpg", {"POS": ["someone placed golf ball in golf tee along ALREADYgolf ball in ground", "adult male placed golf ball in golf tee along ALREADYgolf ball in exterior", "linksman placed golf ball in golf tee along ALREADYgolf ball in outdoors"], "NEG": ["someone placed golf ball in bathtub along ALREADYgolf ball in ground", "adult male placed golf ball in flap along ALREADYgolf ball in exterior", "golfer placed golf ball in crop along ALREADYgolf ball in outdoors"]}], ["applying_298.jpg", {"POS": ["adult female is applying a mascara to a lash using brush in a place.", "woman is applying a mascara to a cilium using brush in a place.", "adult female is applying a eyeliner to a lid using brush in a room."], "NEG": ["adult female is applying a mascara to a chin using brush in a place.", "woman is applying a mascara to a deck using brush in a place.", "woman is applying a eyeliner to a base using brush in a room."]}], ["sprinkling_259.jpg", {"POS": ["an chef sprinkles an salt from a manus onto a plate at a inside", "an chef sprinkles an flavoring from a hand onto a nutrient at a kitchen", "an adult male sprinkles an seasoning from a hand onto a plate at a kitchen"], "NEG": ["an chef sprinkles an salt from a manus onto a ballplayer at a inside", "an chef sprinkles an seasoning from a paw onto a pectus at a kitchen", "an man sprinkles an seasoning from a manus onto a rooftop at a kitchen"]}], ["throwing_385.jpg", {"POS": ["the coach throws an baseball towards a catcher at a baseball field.", "the manager throws an baseball towards a catcher at a ball field.", "the man throws an baseball towards a backstop at a baseball field."], "NEG": ["the manager throws an baseball towards a flexible joint at a ball field.", "the handler throws an baseball towards a suit of clothes at a baseball field.", "the adult male throws an baseball towards a fish at a ball field."]}], ["milking_101.jpg", {"POS": ["an adult male milks a cow with a manus into a pail in a out-of-doors", "an sodbuster milks a cow with a manus into a pail in a exterior", "an adult male milks a cow with a manus into a bucket in a out-of-doors"], "NEG": ["an man milks a cow with a manus into a truck bed in a open", "an husbandman milks a cow with a manus into a woman in a exterior", "an adult male milks a cow with a hand into a tarp in a outdoors"]}], ["placing_101.jpg", {"POS": ["man placed flag in tomb along ALREADYflag in memorial park", "soldier placed flag in tomb along ALREADYflag in necropolis", "soldier placed flag in grave along ALREADYflag in cemetery"], "NEG": ["man placed flag in toilet along ALREADYflag in burial site", "soldier placed flag in bunny rabbit along ALREADYflag in graveyard", "soldier placed flag in natatorium along ALREADYflag in graveyard"]}], ["sliding_31.jpg", {"POS": ["the adult male slides the man (when different from the adult male) on a land to a destination at a stadium.", "the baseball player slides the slider (when different from the baseball player) on a ground to a foundation at a athletic field.", "the baseball player slides the ballplayer (when different from the baseball player) on a sand to a home plate at a baseball."], "NEG": ["the man slides the man (when different from the man) on a solid ground to a bucket at a bowl.", "the ballplayer slides the slider (when different from the ballplayer) on a ground to a hoof at a playing field.", "the ballplayer slides the baseball player (when different from the ballplayer) on a sand to a fuselage at a baseball."]}], ["stuffing_165.jpg", {"POS": ["the someone stuffs the grape in the oral fissure at the interior", "the man stuffs the grape in the mouth at the room", "the somebody stuffs the olive in the room at the rima oris"], "NEG": ["the individual stuffs the grape in the unknown quantity at the interior", "the man stuffs the grape in the rope at the room", "the someone stuffs the European olive tree in the lawn at the mouth"]}], ["milking_107.jpg", {"POS": ["an adult female milks a camel with a hand into a bucket in a desert", "an woman milks a camel with a manus into a bucket in a desert", "an adult female milks a camel with a hand into a pail in a desert"], "NEG": ["an woman milks a camel with a mitt into a casket in a desert", "an adult female milks a camel with a mitt into a space in a desert", "an woman milks a camel with a hand into a wrestling mat in a desert"]}], ["sliding_65.jpg", {"POS": ["the ballplayer slides the legs (when different from the ballplayer) on a terra firma to a stand at a stadium.", "the baseball player slides the slider (when different from the baseball player) on a land to a bag at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home plate at a baseball."], "NEG": ["the ballplayer slides the legs (when different from the ballplayer) on a ground to a needle at a stadium.", "the baseball player slides the slider (when different from the baseball player) on a earth to a brick at a diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a wire wool at a baseball game."]}], ["throwing_354.jpg", {"POS": ["the adult male throws an knife towards a target area at a backyard.", "the adult male throws an item towards a mark at a open air.", "the adult male throws an item towards a mark at a yard."], "NEG": ["the adult male throws an knife towards a joist at a backyard.", "the adult male throws an item towards a rabbit at a out-of-doors.", "the man throws an item towards a front end at a curtilage."]}], ["stuffing_290.jpg", {"POS": ["the adult male stuffs the mouth in the cafeteria at the food", "the adult male stuffs the sandwich in the mouth at the eating place", "the man stuffs the sandwich in the mouth at the inside"], "NEG": ["the adult male stuffs the rima oris in the glass at the food", "the adult male stuffs the sandwich in the metatarsal arch at the restaurant", "the adult male stuffs the sandwich in the drawer at the inside"]}], ["pouring_192.jpg", {"POS": ["an man pours a tea from a teapot to a container with a manus in a inside", "an man pours a tea from a teapot to a destination with a manus in a inside", "an server pours a tea from a teapot to a cup with a paw in a Kingdom of Morocco"], "NEG": ["an adult male pours a tea from a teapot to a pouch with a paw in a interior", "an adult male pours a tea from a teapot to a tubing with a hand in a inside", "an waiter pours a tea from a teapot to a cooky with a mitt in a Maroc"]}], ["pouring_299.jpg", {"POS": ["an adult female pours a H2O from a bottle to a mouth with a hand in a desert", "an woman pours a H2O from a bottle to a oral fissure with a hand in a exterior", "an woman pours a H2O from a bottle to a oral fissure with a paw in a desert"], "NEG": ["an adult female pours a water from a bottle to a harness with a paw in a desert", "an adult female pours a water from a bottle to a first with a paw in a exterior", "an woman pours a water from a bottle to a physical structure with a hand in a desert"]}], ["stuffing_295.jpg", {"POS": ["the squirrel stuffs the mouth in the outdoors at the nut", "the chipmunk stuffs the food in the oral fissure at the tree", "the chipmunk stuffs the nut in the oral fissure at the exterior"], "NEG": ["the squirrel stuffs the oral cavity in the milking machine at the nut", "the chipmunk stuffs the food in the floater at the tree", "the chipmunk stuffs the nut in the crowd at the outside"]}], ["applying_286.jpg", {"POS": ["individual is applying a lip rouge to a lip using mitt in a inside.", "adult female is applying a mascara to a supercilium using brush in a room.", "people is applying a make-up to a human face using brush in a place."], "NEG": ["mortal is applying a lipstick to a net using mitt in a inside.", "adult female is applying a mascara to a circuit board using brush in a room.", "people is applying a war paint to a feeding bottle using brush in a place."]}], ["raking_114.jpg", {"POS": ["an girl rakes an leaf from a land into a mound at a field", "an adult female rakes an foliage from a ground into a destination at a open air", "an mortal rakes an foliage from a ground into a pile at a park"], "NEG": ["an fille rakes an foliage from a solid ground into a friend at a field", "an adult female rakes an leafage from a solid ground into a hairpin at a out-of-doors", "an person rakes an foliage from a earth into a desk at a park"]}], ["sprinkling_13.jpg", {"POS": ["an adult female sprinkles an spice from a cup onto a pastry at a kitchen", "an woman sprinkles an cinnamon from a paw onto a cookie at a kitchen", "an mortal sprinkles an spice from a hand onto a biscuit at a table"], "NEG": ["an adult female sprinkles an spice from a cup onto a client at a kitchen", "an adult female sprinkles an cinnamon from a mitt onto a bookshelf at a kitchen", "an somebody sprinkles an spice from a mitt onto a water at a table"]}], ["pouring_243.jpg", {"POS": ["an scientist pours a compound from a beaker to a test tube with a hand in a place", "an adult male pours a chemical substance from a beaker to a test tube with a hand in a lab", "an hand pours a liquid from a cup to a tubing with a glove in a inside"], "NEG": ["an scientist pours a compound from a beaker to a countertop with a hand in a place", "an adult male pours a chemical substance from a beaker to a trough with a hand in a research laboratory", "an paw pours a liquid from a cup to a uniform with a glove in a interior"]}], ["raking_33.jpg", {"POS": ["an boy rakes an leaf from a terra firma into a mound at a grounds", "an male child rakes an foliage from a land into a destination at a open air", "an bambino rakes an leafage from a earth into a ground at a open air"], "NEG": ["an boy rakes an leaf from a land into a goal at a yard", "an boy rakes an leafage from a land into a ocean at a out-of-doors", "an toddler rakes an leafage from a land into a bunny rabbit at a out-of-doors"]}], ["lathering_172.jpg", {"POS": ["an beautician lathers a towel into a face at a beauty parlor", "an adult male lathers a shaving cream into a face at a inside", "an barber lathers a shaving cream into a human face at a beauty parlor"], "NEG": ["an beautician lathers a towel into a room at a beauty parlor", "an adult male lathers a shaving cream into a eye at a interior", "an barber lathers a shaving cream into a ice-hockey rink at a beauty parlour"]}], ["throwing_55.jpg", {"POS": ["the basketball player throws an basketball towards a basket at a basketball court.", "the basketeer throws an basketball towards a hoop at a basketball court.", "the man throws an ball towards a basketball game at a stadium."], "NEG": ["the cager throws an basketball towards a cart at a basketball court.", "the cager throws an basketball towards a space at a basketball court.", "the adult male throws an ball towards a compost at a arena."]}], ["pooing_94.jpg", {"POS": ["woman poos onto a toilet at a bathroom", "adult female poos onto a privy at a privy", "adult female poos onto a crapper at a lavatory"], "NEG": ["woman poos onto a ball at a bathroom", "adult female poos onto a ladder at a lav", "adult female poos onto a crochet stitch at a toilet"]}], ["stuffing_313.jpg", {"POS": ["the adult female stuffs the cake in the oral cavity at the interior", "the adult female stuffs the cake in the oral cavity at the desk", "the adult female stuffs the cake in the mouth at the office"], "NEG": ["the adult female stuffs the cake in the balloon at the inside", "the woman stuffs the cake in the town at the desk", "the adult female stuffs the cake in the ice-hockey rink at the office"]}], ["fastening_130.jpg", {"POS": ["an famous person fastens an helmet into a head with a strap using a paw at a cervix", "an adult male fastens an helmet into a head with a buckle using a hand at a place", "an driver fastens an helmet into a caput with a strap using a hand at a out-of-doors"], "NEG": ["an celebrity fastens an helmet into a pot with a strap using a hand at a neck", "an adult male fastens an helmet into a eating house with a buckle using a hand at a place", "an driver fastens an helmet into a lawn with a strap using a paw at a open"]}], ["putting_17.jpg", {"POS": ["an adult male puts an band into a finger in a place", "an man puts an band into a finger in a place", "an man puts an floor into a paw in a place"], "NEG": ["an adult male puts an ring into a lawn in a place", "an adult male puts an ring into a trough in a place", "an man puts an floor into a ground in a place"]}], ["milking_36.jpg", {"POS": ["an man milks a cow with a mitt into a bucket in a farm", "an manus milks a moo-cow with a manus into a pail in a barn", "an adult male milks a oxen with a hand into a pail in a barn"], "NEG": ["an adult male milks a cow with a paw into a drinking straw in a farm", "an manus milks a moo-cow with a mitt into a soccer player in a barn", "an adult male milks a Bos taurus with a hand into a river in a barn"]}], ["sliding_109.jpg", {"POS": ["the baseball player slides the slider (when different from the baseball player) on a land to a bag at a ball field.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home base at a baseball.", "the adult male slides the slider (when different from the adult male) on a soil to a home plate at a ball field."], "NEG": ["the ballplayer slides the slider (when different from the ballplayer) on a ground to a ring at a baseball field.", "the baseball player slides the slider (when different from the baseball player) on a sand to a babe at a baseball.", "the man slides the slider (when different from the man) on a soil to a tin at a diamond."]}], ["lathering_153.jpg", {"POS": ["an man lathers a shaving foam into a human face at a shop", "an barber lathers a shaving cream into a human face at a barbershop", "an barber lathers a shaving cream into a client at a shop"], "NEG": ["an man lathers a shaving foam into a jigsaw puzzle at a store", "an barber lathers a shaving cream into a cheek at a barbershop", "an barber lathers a shaving cream into a port at a store"]}], ["milking_146.jpg", {"POS": ["an adult female milks a cow with a mitt into a bucket in a farm", "an adult female milks a cow with a mitt into a bucket in a exterior", "an adult female milks a cow with a hand into a pail in a barnyard"], "NEG": ["an adult female milks a cow with a mitt into a tennis ball in a farm", "an adult female milks a cow with a manus into a ring in a exterior", "an woman milks a cow with a mitt into a garden in a barnyard"]}], ["stuffing_8.jpg", {"POS": ["the man stuffs the hotdog in the rima oris at the open", "the man stuffs the hot dog in the rima oris at the coffee shop", "the young buck stuffs the chili dog in the mouth at the out-of-doors"], "NEG": ["the man stuffs the hot dog in the body of water at the open air", "the man stuffs the hotdog in the sea at the coffee shop", "the young buck stuffs the chili dog in the fish at the open"]}], ["milking_190.jpg", {"POS": ["an woman milks a caprine animal with a paw into a can in a farm", "an adult female milks a caprine animal with a mitt into a can in a open air", "an adult female milks a goat with a mitt into a container in a wood"], "NEG": ["an woman milks a goat with a paw into a block in a farm", "an adult female milks a goat with a paw into a goblet in a outdoors", "an woman milks a goat with a paw into a flowerpot in a forest"]}], ["pouring_17.jpg", {"POS": ["an adult male pours a tea from a teapot to a cup with a manus in a room", "an man pours a tea from a teapot to a glass with a paw in a edifice", "an adult male pours a substance from a kettle to a drinking glass with a manus in a eating place"], "NEG": ["an adult male pours a tea from a teapot to a physical object with a hand in a room", "an man pours a tea from a teapot to a cart with a hand in a edifice", "an man pours a substance from a boiler to a arts and crafts with a mitt in a eating place"]}], ["stuffing_219.jpg", {"POS": ["the squirrel stuffs the mouth in the table at the nut", "the chipmunk stuffs the peanut in the oral cavity at the table", "the chipmunk stuffs the nut in the oral fissure at the exterior"], "NEG": ["the squirrel stuffs the mouth in the barn at the nut", "the chipmunk stuffs the peanut in the true cat at the table", "the chipmunk stuffs the nut in the stain at the exterior"]}], ["sliding_85.jpg", {"POS": ["the baseball player slides the ballplayer (when different from the baseball player) on a land to a bag at a diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a home base at a baseball game.", "the baseball player slides the slider (when different from the baseball player) on a dirt to a home base at a baseball diamond."], "NEG": ["the ballplayer slides the ballplayer (when different from the ballplayer) on a soil to a glass at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a sand to a river at a baseball.", "the ballplayer slides the slider (when different from the ballplayer) on a dirt to a paint at a diamond."]}], ["putting_151.jpg", {"POS": ["an woman puts an makeup into a eye in a room", "an adult female puts an mascara into a cilium in a place", "an woman puts an mascara into a cilium in a interior"], "NEG": ["an adult female puts an composition into a sewer system in a room", "an adult female puts an mascara into a CPU board in a place", "an woman puts an mascara into a back in a inside"]}], ["milking_90.jpg", {"POS": ["an man milks a cow with a mitt into a container in a farm", "an husbandman milks a cow with a milking machine into a container in a barn", "an man milks a cow with a milking machine into a pail in a dairy"], "NEG": ["an adult male milks a cow with a hand into a sea lion in a farm", "an farmer milks a moo-cow with a milking machine into a xerographic copier in a barn", "an adult male milks a moo-cow with a milking machine into a coffin in a dairy"]}], ["applying_246.jpg", {"POS": ["woman is applying a cream to a nose using finger in a place.", "adult female is applying a lotion to a destination using mitt in a place.", "woman is applying a lotion to a human face using mitt in a place."], "NEG": ["adult female is applying a cream to a crop using finger in a place.", "adult female is applying a lotion to a squash using mitt in a place.", "woman is applying a lotion to a tomb using manus in a place."]}], ["pouring_319.jpg", {"POS": ["an female pours a H2O from a jug to a drinking glass with a manus in a countertop", "an adult female pours a water from a jar to a drinking glass with a tool in a tabular array", "an woman pours a H2O from a ewer to a glass with a hand in a kitchen"], "NEG": ["an female pours a H2O from a jug to a Styrofoam with a paw in a countertop", "an woman pours a H2O from a jar to a tube with a tool in a table", "an woman pours a H2O from a ewer to a strip with a hand in a kitchen"]}], ["milking_188.jpg", {"POS": ["an male child milks a cow with a manus into a pail in a farm", "an shaver milks a moo-cow with a paw into a bucket in a barn", "an twosome milks a cow with a hand into a pail in a barn"], "NEG": ["an male child milks a cow with a mitt into a bunny rabbit in a farm", "an fry milks a moo-cow with a manus into a golf tee in a barn", "an twosome milks a cow with a mitt into a net in a barn"]}], ["stuffing_246.jpg", {"POS": ["the missy stuffs the corn dodger in the oral cavity at the place", "the young lady stuffs the nutrient in the oral fissure at the room", "the female child stuffs the food in the oral fissure at the place"], "NEG": ["the young lady stuffs the corn dab in the tum at the place", "the miss stuffs the food in the casserole at the room", "the female child stuffs the food in the cervix at the place"]}], ["tying_201.jpg", {"POS": ["an little girl ties an shoe to a human foot using a shoe string at a track", "an fille ties an shoestring to a shoelace using a paw at a course", "an woman ties an shoe to a destination using a shoestring at a exterior"], "NEG": ["an little girl ties an shoe to a kitchen table using a shoestring at a raceway", "an young lady ties an shoe string to a mount using a mitt at a course", "an adult female ties an shoe to a ownership using a shoe lace at a outside"]}], ["putting_14.jpg", {"POS": ["an adult male puts an eye-drop into a optic in a place", "an mortal puts an eyedrop into a eye in a place", "an someone puts an eye-drop into a oculus in a place"], "NEG": ["an man puts an eyedrop into a pillow in a place", "an individual puts an eye-drop into a body in a place", "an soul puts an eyedrop into a elevator in a place"]}], ["fastening_150.jpg", {"POS": ["an adult male fastens an belt into a buckle with a tongue using a paw at a place", "an man fastens an haversack into a buckle with a clasp using a mitt at a place", "an adult male fastens an strap into a buckle with a prong using a hand at a place"], "NEG": ["an man fastens an belt into a owner with a tongue using a mitt at a place", "an adult male fastens an backpack into a tennis ball with a clasp using a paw at a place", "an adult male fastens an strap into a N with a prong using a hand at a place"]}], ["tying_204.jpg", {"POS": ["an female ties an shoe to a pes using a shoe lace at a open air", "an woman ties an shoestring to a shoe using a manus at a outside", "an adult female ties an shoe to a destination using a shoe lace at a exterior"], "NEG": ["an female ties an shoe to a wall using a shoe lace at a open", "an woman ties an shoe lace to a sidewalk using a manus at a exterior", "an adult female ties an shoe to a tin using a shoestring at a outside"]}], ["plunging_98.jpg", {"POS": ["an people plunges a human foot (when different than the people) into a ball at a land", "an adult male plunges a leg (when different than the adult male) into a soccer ball at a playing field", "an man plunges a ball (when different than the man) into a terra firma at a field"], "NEG": ["an people plunges a pes (when different than the people) into a tub at a solid ground", "an man plunges a leg (when different than the man) into a tape at a playing area", "an adult male plunges a ball (when different than the adult male) into a reel at a field"]}], ["applying_204.jpg", {"POS": ["old woman is applying a sun blocker to a cheek using finger in a outdoors.", "woman is applying a lotion to a human face using finger in a place.", "woman is applying a substance to a cheek using finger in a open air."], "NEG": ["old woman is applying a sun blocker to a countertop using finger in a out-of-doors.", "woman is applying a lotion to a backstop using finger in a place.", "woman is applying a substance to a food using finger in a out-of-doors."]}], ["stuffing_25.jpg", {"POS": ["the puffin stuffs the fish in the pecker at the open air", "the puffin stuffs the fish in the bill at the rock", "the bird stuffs the fish in the oral fissure at the open air"], "NEG": ["the puffin stuffs the fish in the lounge at the open air", "the puffin stuffs the fish in the coat at the stone", "the bird stuffs the fish in the kitchen at the outdoors"]}], ["filling_31.jpg", {"POS": ["woman fills petrol tank with gasoline from storage tank at a gas station", "woman fills petrol tank with gas from hosepipe at a gas station", "individual fills machine with gasoline from hosepipe at a gas station"], "NEG": ["woman fills brick with petrol from storage tank at a petrol station", "woman fills sky with gasolene from hosepipe at a petrol station", "mortal fills rock with gas from hosepipe at a petrol station"]}], ["attaching_202.jpg", {"POS": ["an woman attaches a paper to a destination with gum using a hand at a place", "an mortal attaches a paper to a pencil with glue using a tool at a place", "an soul attaches a paper to a pencil with gum using a tool at a place"], "NEG": ["an adult female attaches a paper to a pond with gum using a mitt at a place", "an someone attaches a newspaper to a trough with gum using a tool at a place", "an mortal attaches a paper to a coat with gum using a tool at a place"]}], ["sliding_137.jpg", {"POS": ["the ballplayer slides the slider (when different from the ballplayer) on a solid ground to a base at a infield.", "the ballplayer slides the slider (when different from the ballplayer) on a air to a home base at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a ground to a base at a playing field."], "NEG": ["the baseball player slides the slider (when different from the baseball player) on a terra firma to a sales booth at a baseball diamond.", "the baseball player slides the slider (when different from the baseball player) on a air to a trim at a diamond.", "the ballplayer slides the slider (when different from the ballplayer) on a ground to a pupil at a field."]}], ["applying_199.jpg", {"POS": ["woman is applying a lip rouge to a lip using brush in a room.", "woman is applying a lipstick to a lip using brush in a interior.", "woman is applying a lip rouge to a lip using applier in a room."], "NEG": ["adult female is applying a lipstick to a oven using brush in a room.", "woman is applying a lipstick to a gem using brush in a inside.", "woman is applying a lipstick to a Erlenmeyer flask using applicator in a room."]}], ["filling_195.jpg", {"POS": ["man fills bowl with soup from pot at a inside", "adult male fills bowl with nutrient from pan at a interior", "adult male fills bowl with spoon from pot at a kitchen"], "NEG": ["adult male fills tin with soup from pot at a interior", "adult male fills pizza with nutrient from cooking pan at a inside", "adult male fills scrap with spoon from pot at a kitchen"]}], ["pooing_136.jpg", {"POS": ["man poos onto a stool at a bathroom", "adult male poos onto a potty at a toilet", "adult male poos onto a throne at a bath"], "NEG": ["man poos onto a Panthera pardus at a bath", "man poos onto a buckle at a toilet", "adult male poos onto a trim at a bathroom"]}]]